{
  "chapterNum": 28,
  "english_title": "Foods (Kitab Al-At'imah)",
  "totalHadiths_inChapter": 119,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 3737,
      "title": "Sunan Abi Dawud 3736",
      "narrator": "‘Abd Allah b. ‘Umar reported the Prophet(ﷺ) as sayings:",
      "english_text": "when one of you is invited for a wedding feast, he must attend it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 3738,
      "title": "Sunan Abi Dawud 3737",
      "narrator": "The tradition mentioned above has also been transmitted by Ibn ‘Umar to the same effect through a different chain of narrators. This version has the additional words:",
      "english_text": "If he is not fasting, he should eat, and if he is fasting, he should leave it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 3739,
      "title": "Sunan Abi Dawud 3738",
      "narrator": "Ibn ‘Umar reported the Messenger of Allah(ﷺ) as saying:",
      "english_text": "if one of you  invites  his brother, he should accept(the invitation), whether it is a wedding feast or something of that nature.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 3740,
      "title": "Sunan Abi Dawud 3739",
      "narrator": "",
      "english_text": "The tradition mentioned above has also been transmitted by Nafi’ to the same effect through the chain of narrators as mentioned in Ayyub.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 3741,
      "title": "Sunan Abi Dawud 3740",
      "narrator": "Jabir reported the Messenger of Allah(ﷺ) as sayings:",
      "english_text": "when one of you is invited to a meal, he must accept. If he wishes he may eat, but if he wishes(to leave), he may leave.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 3742,
      "title": "Sunan Abi Dawud 3741",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) said: He who does not accept an invitation which he receives has disobeyed Allah and His Apostle, and he who enters without invitation enters as a thief and goes out as a raider.\n\n\n\nAbu Dawud said: Aban bin Tariq is unknown.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 3743,
      "title": "Sunan Abi Dawud 3742",
      "narrator": "Abu Hurairah said:",
      "english_text": "The worst kind of food is that at a wedding feast to which the rich are invited and from which the poor are left out. If anyone does not attend the feast to which he was invited, he has disobeyed Allah and His Apostle (may peace upon him).",
      "grade": "صحيح ق موقوفا م مرفوعا   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 3744,
      "title": "Sunan Abi Dawud 3743",
      "narrator": "Thabit said:",
      "english_text": "The marriage of Zainab daughter of Jahsh was mentioned before Anas b. Malik. He said: I did not see that the Messenger of Allah (ﷺ) held such a wedding feast for any of his wives as he did for her. He held a wedding feast with a sheep.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 3745,
      "title": "Sunan Abi Dawud 3744",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Prophet (ﷺ) held a wedding feast for Safiyyah with meal and dates.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 3746,
      "title": "Sunan Abi Dawud 3745",
      "narrator": "Narrated Zubayr ibn Uthman:",
      "english_text": "The Prophet (ﷺ) said: The wedding feast on the first day is a duty, that on the second is a good practice, but that on the third day is to make men hear of it and show it to them. Qatadah said: A man told me that Sa'id ibn al-Musayyab was invited (to a wedding feast on the first day and he accepted it. He was again invited on the second day, and he accepted. When he was invited on the third day, he did not accept; he said: They are the people who make men hear of it and show it to them.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 3747,
      "title": "Sunan Abi Dawud 3746",
      "narrator": "Qatadah reported this story from Sa’id b. al-Musayyab. This version adds:",
      "english_text": "When he was invited on the third day, he did not accept but threw pebbles on the messenger.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 3748,
      "title": "Sunan Abi Dawud 3747",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "When the Prophet (ﷺ) returned to Medina, he would slaughter a camel or a cow.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 3749,
      "title": "Sunan Abi Dawud 3748",
      "narrator": "Abu Shuraih al-Ka’bi reported the Messenger of Allah(ﷺ) as sayings:",
      "english_text": "He who believes in Allah and the Last Day should honour his guest provisions for the road are what will serve for a day and night: hospitality extends for three days; what goes after that is sadaqah(charity): and it is not allowable that a guest should stay till he makes himself an encumbrance.\n\n\nAbu Dawud said: Malik was asked about the saying of the Prophet: \"Provisions for the road what will serve for a day a night.\" He said: He should honor him, present him some gift, and protect him for a day and night, and hospitality for three days.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 3750,
      "title": "Sunan Abi Dawud 3749",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: Hospitality extend for three days, and what goes beyond that is sadaqah (charity).",
      "grade": "حسن صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 3751,
      "title": "Sunan Abi Dawud 3750",
      "narrator": "Narrated AbuKarimah:",
      "english_text": "The Prophet (ﷺ) said: It is a duty of every Muslim (to provide hospitality) to a guest for a night. If anyone comes in the morning to his house, it is a debt due to him. If he wishes, he may fulfil it, and if he wishes he may leave it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 3752,
      "title": "Sunan Abi Dawud 3751",
      "narrator": "Narrated Al-Miqdam AbuKarimah:",
      "english_text": "The Prophet (ﷺ) said: If any Muslim is a guest of people and is given nothing, it is the duty of every Muslim to help him to the extent of taking for him from their crop and property for the entertainment of one night.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 3753,
      "title": "Sunan Abi Dawud 3752",
      "narrator": "‘Uqbah b. ‘Amir said:",
      "english_text": "we said: Messenger of Allah! You send us out and we come to people who do not give hospitality, so what is your opinion? The Messenger of Allah(ﷺ) said: If you come to people who order for you what is fitting for a guest, accept it; but if they do not, take from them what is fitting for them to give to a guest.\n\n\nAbu Dawud said: And this is an authority for a man to take a thing if it is due to him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 3754,
      "title": "Sunan Abi Dawud 3753",
      "narrator": "Narrated Abdullah Ibn Abbas:",
      "english_text": "When the verse: \"O ye who believe! eat not up your property among yourselves in vanities, but let there be amongst you traffic and trade by mutual good will\" was revealed, a man thought it a sin to eat in the house of another man after the revelation of this verse.  \n\n\n\n\n\nThen this (injunction) was revealed by the verse in Surat an-Nur: \"No blame on you whether you eat in company or separately.\"  \n\n\n\n\n\nWhen a rich man (after revelation) invited a man from his people to eat food in his house, he would say: I consider it a sin to eat from it, and he said: a poor man is more entitled to it than I. The Arabic word tajannah means sin or fault. It was then declared lawful to eat something on which the name of Allah was mentioned, and it was made lawful to eat the flesh of an animal slaughtered by the people of the Book.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 3755,
      "title": "Sunan Abi Dawud 3754",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) forbade that the food of two people who were rivalling on another should be eaten\n\n\n\nAbu Dawud said: Most of those who narrated it from Jarir did not mention the name of Ibn Abbas. Harun al-Nahwi mentioned Ibn 'Abbas in it, and Hammad bin Zaid did not mention Ibn 'Abbas.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 3756,
      "title": "Sunan Abi Dawud 3755",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "Safinah AbuAbdurRahman said that a man prepared food for Ali ibn AbuTalib who was his guest, and Fatimah said: I wish we had invited the Messenger of Allah (ﷺ) and he had eaten with us. They invited him, and when he came he put his hands on the side-ports of the door, but when he saw the figured curtain which had been put at the end of the house, he went away. So Fatimah said to Ali: Follow him and see what turned him back. I (Ali) followed him and asked: What turned you back, Messenger of Allah? He replied: It is not fitting for me or for any Prophet to enter a house which is decorated.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 3757,
      "title": "Sunan Abi Dawud 3756",
      "narrator": "Narrated AbdurRahman al-Himyari:",
      "english_text": "A companion of the Prophet (ﷺ) reported him as saying: When two people come together to issue an invitation, accept that of the one whose door is nearer in neighbourhood, but if one of them comes before the other accept the invitation of the one who comes first.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 3758,
      "title": "Sunan Abi Dawud 3757",
      "narrator": "Ibn ‘Umar reported the Prophet(ﷺ) as sayings:",
      "english_text": "When the evening meal is brought before one of you and the congregational prayer is also ready, he should not get up until he finishes(eating). Musaddad’s version adds: When the evening meal was put before ‘Abd Allah b. ‘Umar, or it was brought to him, he did not get up until he finished it, even if he heard call to prayer(just before it), and even if he heard the recitation of the Qur’an by the leader-in-prayer.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 3759,
      "title": "Sunan Abi Dawud 3758",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Prophet (ﷺ) said: Prayer should not be postponed for taking meals nor for any other thing.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 3760,
      "title": "Sunan Abi Dawud 3759",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "Abdullah ibn Ubaydullah ibn Umayr said: I was with my father in the time of Ibn az-Zubayr sitting beside Abdullah ibn Umar. Then Abbad ibn Abdullah ibn az-Zubayr said: We have heard that the evening meal is taken just before the night prayer. Thereupon Abdullah ibn Umar said: Woe to you! what was their evening meal? Do you think it was like the meal of your father?",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 3761,
      "title": "Sunan Abi Dawud 3760",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) came out from the privy and was presented to him. They (the people) asked: Should we bring you water for ablution? He replied: I have been commanded to perform ablution when I get up for prayer.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 3762,
      "title": "Sunan Abi Dawud 3761",
      "narrator": "Narrated Salman al-Farsi:",
      "english_text": "I read in the Torah that the blessing of food consists in ablution before it. So I mentioned it to the Prophet (ﷺ). He said: The blessing of food consists in ablution before it and ablution after it.\n\n\n\nSufyan disapproved of performing ablution before taking food.\n\n\nAbu Dawud said: It is weak.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 3763,
      "title": "Sunan Abi Dawud 3762",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Messenger of Allah (ﷺ) came out from the valley of a mountain where he had eased himself. There were some dried dates on a shield before us. We called him and he ate with us. He did not touch water.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 3764,
      "title": "Sunan Abi Dawud 3763",
      "narrator": "Abu Hurairah said:",
      "english_text": "The Messenger of Allah (ﷺ) never expressed disapproval of food; if he desired it, he ate it, and if he disliked it, he left it alone.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 3765,
      "title": "Sunan Abi Dawud 3764",
      "narrator": "Narrated Wahshi ibn Harb:",
      "english_text": "The Companions of the Prophet (ﷺ) said: Messenger of Allah (ﷺ) we eat but we are not satisfied. He said: Perhaps you eat separately. They replied: Yes. He said: If you gather together at your food and mention Allah's name, you will be blessed in it.\n\n\n\nAbu Dawud said: If you are invited to a wedding feast before you, do not take it until the owner of the house (i.e. the host) allows you (to eat).",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 3766,
      "title": "Sunan Abi Dawud 3765",
      "narrator": "Jabir bin ‘Abd Allah said that he heard the Prophet(ﷺ) say:",
      "english_text": "When a man enters his house and mention Allah’s name on entering and on his food, the devil says: You have no place to spend the night and no evening meal; but when he enters without mentioning Allah’s name on entering, the devil says: You have found a place to spend the night, and when he does not mention Allah’s name at his food, he says: You have found a place to spend the night and an evening meal.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 3767,
      "title": "Sunan Abi Dawud 3766",
      "narrator": "When we were at food with the Messenger of Allah(ﷺ) none of us put in his hand till the Messenger of Allah(ﷺ)put his hand first. Once we were at food with him. A nomad Arab came in as though he were being pushed, and he was about to put his hand in food when the Messenger of Allah (ﷺ) seized him by the hand. Then a girl came in as though she were being pushed, and she was about to put her hand in the food when the Messenger of Allah (ﷺ) seized her by the hand, and he said:",
      "english_text": "The devil considers the food when Allah’s name is not mentioned over it, and he brought his nomad Arab that it might be lawful by means of him, so I seized his hand: then he brought this girl that it might be lawful by means of her, so I seized her hand. By Him in Whose hand my soul is, His hand is in my hand along with their hands.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 3768,
      "title": "Sunan Abi Dawud 3767",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) said: When one of you eats, he should mention Allah's name; if he forgets to mention  Allah's name at the beginning, he should say: \"In the name of Allah at the beginning and at the end of it.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 3769,
      "title": "Sunan Abi Dawud 3768",
      "narrator": "Narrated Umayyah ibn Makhshi:",
      "english_text": "Umayyah was sitting and a man was eating. He did not mention Allah's name until there remained the last morsel. When he raised it to his mouth, he said: In the name of Allah at the beginning and at the end of it. The Prophet (ﷺ) laughed and said: The devil kept eating along with him, but when he mentioned Allah's name, he vomited what was in his belly.\n\n\nAbu Dawud: Jabir bin Subh is grandfather of Sulaiman bin Harb from his mother's side.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 3770,
      "title": "Sunan Abi Dawud 3769",
      "narrator": "Abu Juhaifah reported the Prophet (ﷺ) as sayings:",
      "english_text": "I do not eat while reclining.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 3771,
      "title": "Sunan Abi Dawud 3770",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Messenger of Allah (ﷺ) was never seen reclining while eating, nor walking with two men at his heels.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 3772,
      "title": "Sunan Abi Dawud 3771",
      "narrator": "Anas said:",
      "english_text": "The Prophet(ﷺ) sent me(for some work), and when I returned to him found him eating dates and squatting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 3773,
      "title": "Sunan Abi Dawud 3772",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: When one of you eats, he must not eat from the top of the dish, but should eat from the bottom; for the blessing descends from the top of it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 3774,
      "title": "Sunan Abi Dawud 3773",
      "narrator": "Narrated Abdullah ibn Busr:",
      "english_text": "The Prophet (ﷺ) had a bowl called gharra'. It was carried by four persons. When the sun rose high, and they performed the forenoon prayer, the bowl in which tharid was prepared was brought, and the people gathered round it. When they were numerous, the Messenger of Allah (ﷺ) said: Allah has made me a respectable servant, and He did not make me an obstinate tyrant. The Messenger of Allah (ﷺ) said: Eat from it sides and leave its top, the blessing will be conferred on it",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 3775,
      "title": "Sunan Abi Dawud 3774",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Messenger of Allah (ﷺ) forbade two kinds of food: to sit at cloth on which wine is drunk, and to eat by a man while lying on his stomach.\n\n\nAbu Dawud said : Ja'far did not hear this tradition from al-Zuhri. His tradition is rejected.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 3776,
      "title": "Sunan Abi Dawud 3775",
      "narrator": "",
      "english_text": "The tradition mentioned above has been transmitted by al-Zuhri from a different chain of narrators.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 3777,
      "title": "Sunan Abi Dawud 3776",
      "narrator": "Ibn ‘Umar reported the Prophet(ﷺ) as sayings:",
      "english_text": "When any of you eats, he should eat with his right hand, and when he drinks, he should drink with his right hand, for the devil eats with his left hand and drinks with his left hand.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 3778,
      "title": "Sunan Abi Dawud 3777",
      "narrator": "Narrated Umar ibn AbuSalamah:",
      "english_text": "The Prophet (ﷺ) said: Come near, my son, mention Allah's name, eat with your right hand and eat from what is next to you.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 3779,
      "title": "Sunan Abi Dawud 3778",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) said: Do not eat meat with a knife, for it is a foreign practice, but bite it, for it is more beneficial and wholesome.\n\n\n\nAbu Dawud said: This tradition is not strong.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 3780,
      "title": "Sunan Abi Dawud 3779",
      "narrator": "Narrated Safwan ibn Umayyah:",
      "english_text": "I was eating with the Prophet (ﷺ) and snatching the meat from the bone with my hand. He said: bring the bone near your mouth, for it is more beneficial and wholesome.\n\n\nAbu Dawud said: 'Uthman did not hear (traditions) from Safwan. This is a mursal tradition.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 3781,
      "title": "Sunan Abi Dawud 3780",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "The bone dearer to the Messenger of Allah (ﷺ) was the bone of sheep.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 3782,
      "title": "Sunan Abi Dawud 3781",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "The tradition mentioned above (No. 3771) has also been narrated by Ibn Mas'ud  with a different chain of narrators. \n\n\n\n\n\nThis version has: The Prophet (ﷺ) liked the foreleg (of a sheep). Once the foreleg was poisoned, and he thought that the Jews had poisoned it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 3783,
      "title": "Sunan Abi Dawud 3782",
      "narrator": "Anas b. Malik said:",
      "english_text": "A tailor invited the Messenger of Allah (ﷺ) to a meal which he had prepared. Anas said: I went along with the Messenger of Allah(ﷺ) barley bread and soup containing pumpkin and dried sliced meat. Anas said: I saw the Messenger of Allah (ﷺ) going after the pumpkin round the dish, so I have always liked pumpkins since that day.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 3784,
      "title": "Sunan Abi Dawud 3783",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The food the Messenger of Allah (ﷺ) liked best was tharid made from bread and tharid made from Hays.\n\n\n\nAbu Dawud said: It is a weak (tradition).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 3785,
      "title": "Sunan Abi Dawud 3784",
      "narrator": "Narrated Qabisah ibn Halb:",
      "english_text": "A man asked the Messenger of Allah (ﷺ): Is there any food from which I should keep myself away? I heard the Messenger of Allah (ﷺ) say: Anything which creates doubt should not occur in your mind by which you resemble Christianity.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 3786,
      "title": "Sunan Abi Dawud 3785",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Messenger of Allah (ﷺ) prohibited eating the animal which feeds on filth and drinking its milk.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 3787,
      "title": "Sunan Abi Dawud 3786",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) prohibited to drink the milk of the animal which feeds on filth.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 3788,
      "title": "Sunan Abi Dawud 3787",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Messenger of Allah (ﷺ) forbade riding the camel which feeds on filth and drinking its milk.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 3789,
      "title": "Sunan Abi Dawud 3788",
      "narrator": "Jabir  b. ‘Abd Allah said:",
      "english_text": "The Messenger of Allah(ﷺ) forbade the flesh of domestic asses on the day of Khaibar, but permitted horse flesh.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 3790,
      "title": "Sunan Abi Dawud 3789",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "On the day of Khaybar we slaughtered horses, mules, and assess. The Messenger of Allah (ﷺ) forbade us (to eat) mules and asses, but he did not forbid horse-flesh.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 3791,
      "title": "Sunan Abi Dawud 3790",
      "narrator": "Narrated Khalid ibn al-Walid:",
      "english_text": "The Messenger of Allah (ﷺ) forbade us to eat horse-flesh, the flesh of mules and of asses. The narrator Haywah added: Every beast of prey with a fang.\n\n\nAbu Dawud said: This view is held by Malik.\n\n\nAbu Dawud said: There is no harm in (eating) horse-flesh and this tradition is not practised.\n\n\nAbu Dawud said: This tradition has been abrogated. A body of Companions of the Prophet (ﷺ) had eaten horse-flesh. OF them are: Ibn al-Zubair, Fudalah bin 'Ubaid, Anas bin Malik, Asma' daughter of Abu Bakr, Suwaid bin Ghaflah, 'Alqamah; the Quraish used to slaughter them (horses) during the time of the Messenger of Allah (ﷺ).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 3792,
      "title": "Sunan Abi Dawud 3791",
      "narrator": "Anas b. Malik said:",
      "english_text": "I was an adolescent boy. I hunted a hare and roasted it. Abu Talha sent its hunch through me to the Prophet (ﷺ), so I brought it to him and he accepted it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 3793,
      "title": "Sunan Abi Dawud 3792",
      "narrator": "Abu Khalid b. al-Huwairith said :",
      "english_text": "‘Abd Allah b. ‘Amar was in al-safah. The narrator Muhammed (b. Khalid) said: it is a place in Mecca. A man brought a hare which he had haunted. He said: ‘Abd Allah b. ‘Amr, what do you say ? He said: It was brought to the Messenger of Allah (ﷺ) when I was sitting (with him). He did not eat it, nor did he prohibit to eat it. He thought that it menstruated.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 3794,
      "title": "Sunan Abi Dawud 3793",
      "narrator": "",
      "english_text": "Ibn ‘Abbas said that his maternal aunt presented to the Messenger of Allah (ﷺ) clarified butter, lizards and cottage cheese. He ate from clarified butter and cheese, but left the lizard abominably. It was eaten on the food cloth of the Messenger of Allah (ﷺ). Had it been unlawful, it would not have been eaten on the food cloth of the Messenger of Allah (ﷺ).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 3795,
      "title": "Sunan Abi Dawud 3794",
      "narrator": "Ibn ‘Abbas said on the authority of Khalid b. al-Walid that he entered the house of Maimunah along with the Messenger of Allah (ﷺ). A roasted lizard was offered to him. The Messenger of Allah (ﷺ) stretched his hand for it. Some of the women is going to eat. They said:",
      "english_text": "It is a lizard. The Messenger of Allah (ﷺ) raised his hand. I (Khalid) asked: Is it forbidden, Messenger of Allah? He replied, No, but it is not found in the land of my people, so I find it distasteful. Khalid said: I then pulled it and ate it while The Messenger of Allah (ﷺ) was seeing.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 3796,
      "title": "Sunan Abi Dawud 3795",
      "narrator": "Narrated Thabit ibn Wadi'ah:",
      "english_text": "We were in an army with the Messenger of Allah (ﷺ). We got some lizards. I roasted one lizard and brought it to the Messenger of Allah (ﷺ) and placed it before him. He took a stick and counted its fingers. He then said: A group from the children of Isra'il was transformed into an animal of the land, and I do not know which animal it was. He did not eat it nor did he forbid (its eating).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 3797,
      "title": "Sunan Abi Dawud 3796",
      "narrator": "Narrated AbdurRahman ibn Shibl:",
      "english_text": "The Messenger of Allah (ﷺ) forbade to eat the flesh of lizard.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 3798,
      "title": "Sunan Abi Dawud 3797",
      "narrator": "Narrated Safinah:",
      "english_text": "I ate the flesh of a bustard along with the Prophet (ﷺ).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 3799,
      "title": "Sunan Abi Dawud 3798",
      "narrator": "Narrated at-Talabb ibn Tha'labah at-Tamimi:",
      "english_text": "I accompanied the Messenger of Allah (ﷺ), but I did not hear about the prohibition of (eating) insects and little creatures of land.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 3800,
      "title": "Sunan Abi Dawud 3799",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "Numaylah  said: I was with Ibn Umar. He was asked about eating hedgehog. He recited: \"Say: I find not in the message received by me by inspiration any (meat) forbidden.\" An old man who was with him said: I heard AbuHurayrah say: It was mentioned to the Messenger of Allah (ﷺ). Noxious of the noxious. Ibn Umar said: If the Messenger of Allah (ﷺ) had said it, it is as he said that we did not know.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 3801,
      "title": "Sunan Abi Dawud 3800",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The people of pre-Islamic times used to eat some things and leave others alone, considering them unclean. Then Allah sent His Prophet (ﷺ) and sent down His Book, marking some things lawful and others unlawful; so what He made lawful is lawful, what he made unlawful is unlawful, and what he said nothing about is allowable. And he recited: \"Say: I find not in the message received by me by inspiration any (meat) forbidden to be eaten by one who wishes to eat it....\" up to the end of the verse.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 3802,
      "title": "Sunan Abi Dawud 3801",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "I asked the Messenger of Allah (ﷺ) about the hyena. He replied: It is game, and if one who is wearing ihram (pilgrim's robe) hunts it, he should give a sheep as atonement.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 3803,
      "title": "Sunan Abi Dawud 3802",
      "narrator": "Abu Tha’labah al-Khushani said:",
      "english_text": "The Messenger of Allah (ﷺ) prohibited eating fanged beasts of prey.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 3804,
      "title": "Sunan Abi Dawud 3803",
      "narrator": "Ibn ‘Abbas said:",
      "english_text": "The Messenger of Allah(ﷺ) prohibited the eating of every beast of prey with fang, and every bird with a talon.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 3805,
      "title": "Sunan Abi Dawud 3804",
      "narrator": "Narrated Al-Miqdam ibn Ma'dikarib:",
      "english_text": "The Prophet (ﷺ) said: Beware, the fanged beast of prey is not lawful, nor the domestic asses, nor the find from the property of a man with whom treaty has been concluded, except that he did not need it. If anyone is a guest of people who provide no hospitality for him, he is entitled to take from them the equivalent of the hospitality due to him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 3806,
      "title": "Sunan Abi Dawud 3805",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "On the day of Khaybar the Messenger of Allah (ﷺ) prohibited eating every beast of prey, and every bird with a talon.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 3807,
      "title": "Sunan Abi Dawud 3806",
      "narrator": "Narrated Khalid ibn al-Walid:",
      "english_text": "I went with the Messenger of Allah (ﷺ) to fight at the battle of Khaybar, and the Jews came and complained that the people had hastened to take their protected property (as a booty), so the Messenger of Allah (ﷺ) said: The property of those who have been given a mules, every fanged beast of prey, and every bird with a talon are forbidden for you.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 3808,
      "title": "Sunan Abi Dawud 3807",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "that the Prophet (ﷺ) forbade payment for a cat. Ibn AbdulMalik said: to eat a cat and to enjoy its price.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 3809,
      "title": "Sunan Abi Dawud 3808",
      "narrator": "Jabir b. ‘Abd Allah said:",
      "english_text": "On the day of Khaibar the Messenger of Allah(ﷺ) forbade us to eat the flesh of domestic asses, and ordered us to eat horse-flesh. ‘Amr said: I informed Abu al-Sha’tha’ about this tradition. He said: Al-Hakam al-Ghifari among us said this, and the” ocean” denied that, intending thereby Ibn’ Abbas.",
      "grade": "صحيح ق دون قول عمرو فأخبرت .. الخ   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 3810,
      "title": "Sunan Abi Dawud 3809",
      "narrator": "Narrated Ghalib ibn Abjar:",
      "english_text": "We faced a famine, and I had nothing from my property which I could feed my family ex except a few asses, and the Prophet (ﷺ) forbade the flesh of domestic asses. So I came to the Prophet (ﷺ) and said: Messenger of Allah (may peace be upon) , we are suffering from famine, and I have no property which I feed my family except some fat asses, and you have forbidden the flesh of domestic asses. He said: Feed your family on the fat asses of yours, for I forbade them on account of the animal which feeds on the filth of the town, that is, the animal which feeds on filth.\n\n\n\nAbu Dawud said: This 'Abd al-Rahman is Ibn Ma'qil.\n\n\nAbu Dawud said: Suh'bah transmitted this tradition from 'Ubaid Abi al-Hasan, from 'Abd al-Rahman bin Maq'il, from'Abd al-Rahman bin Bishr, from some people of Muzainah stating that Abjar, the chief of Muzainah, or Ibn Abjar asked the Prophet (ﷺ).",
      "grade": "ضعيف الإسناد مضطرب   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 3811,
      "title": "Sunan Abi Dawud 3810",
      "narrator": "Muhammed b. Sulaiman narrated from Abu Nu’aim, from Mis’ar, from Ibn ‘Ubaid, from Ibn Ma’qil, from two men of Muzainah, one from the other, one of them is ‘Abd Allah b. ‘Amr b. ‘Uwaim, and the other is Ghalib b. al-Abjar. Mis’ar said:",
      "english_text": "I think it was Ghalib who had come to the Prophet(ﷺ) with tradition.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 3812,
      "title": "Sunan Abi Dawud 3811",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "On the day of Khaybar the Messenger of Allah (may pease be upon him) forbade (eating) the flesh of domestic asses, and the animal which feeds on filth: riding it and eating its flesh.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 3813,
      "title": "Sunan Abi Dawud 3812",
      "narrator": "Abu Ya’fur said:",
      "english_text": "I heard Ibn Abi Awfa say when I asked him about (eating) locusts: I went on six or seven expeditions along with the Messenger of Allah (ﷺ) and we ate them (locusts) along with him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 3814,
      "title": "Sunan Abi Dawud 3813",
      "narrator": "Narrated Salman al-Farsi:",
      "english_text": "The Messenger of Allah (ﷺ) was asked about (eating) locusts. He replied: They are the most numerous of Allah's hosts. I neither eat them nor declare them unlawful.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 3815,
      "title": "Sunan Abi Dawud 3814",
      "narrator": "The tradition mentioned above has also been transmitted by Salman through a different chain of narrators. This version goes:",
      "english_text": "Salman said: The Messenger of Allah(ﷺ) was asked about locusts. He replied in a similar way(as mentioned above) saying: The most numerous of Allah’s host. The narrator ‘Ali said: His name is Fa’id, that is the name of al-Awwam.\n\n\nAbu Dawud said: This tradition has been transmitted by Hammad b. Salamah, from Abu al-Awwam from Abu uthman, from the Prophet (ﷺ). He did not mention salman (i.e., the companions).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 3816,
      "title": "Sunan Abi Dawud 3815",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Prophet (ﷺ) said: What the sea throws up and is left by the tide you may eat, but what dies in the sea and floats you must not eat.\n\n\n\nAbu Dawud said: This tradition has been transmitted by Sufyan al-Thawri, Ayyub and Hammad from Abu al-Zubair as the statement of Jabor himself (and not from the Prophet). It has been also transmitted direct from the Prophet (ﷺ) through a weak chain by Abu Dhi'b, from Abu al-Zubair on the authority if Jabir from the Prophet (ﷺ).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 3817,
      "title": "Sunan Abi Dawud 3816",
      "narrator": "Narrated Jabir ibn Samurah:",
      "english_text": "A man alighted at Harrah with his wife and children.  A man said (to him): My she-camel has strayed; if you find it, detain it.  \n\n\n\n\n\nHe found it, but did not find its owner, and it fell ill. His wife said: Slaughter it. But he refused and it died. \n\n\n\n\n\nShe said: Skin it so that we may dry its fat and flesh and then eat them.  \n\n\n\n\n\nHe said: Let me ask the Messenger of Allah (ﷺ). So he came to him (the Prophet) and asked him.  He said: Have you sufficient for your needs?  He replied: No.  He then said: Then eat it. \n\n\n\n\n\nThen its owner came and he told him the story.  He said: Why did you not slaughter it? He replied: I was ashamed (or afraid) of you.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 3818,
      "title": "Sunan Abi Dawud 3817",
      "narrator": "Narrated Al-Faji' ibn Abdullah al-Amiri:",
      "english_text": "Al-Faji' came to the Messenger of Allah (ﷺ) and asked: Is not dead meat lawful for us? He said: What is your food? We said: Some food in the evening and some in the morning. AbuNu'aym said: Uqbah explained it to me saying: a cup (of milk) in the morning and a cup in the evening; this does not satisfy the hunger. So made the carrion lawful for them in this condition.\n\n\n\nAbu Dawud said: Ghabuq is a drink in the evening and Sabuh is a drink in the morning.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 3819,
      "title": "Sunan Abi Dawud 3818",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) said: I wish I had a white loaf made from tawny and softened with clarified butter and milk. A man from among the people got up and getting one brought it. He asked: In which had it been? He replied: In a lizard skin. He said: Take it away.\n\n\nAbu Dawud said: This is a munkar (rejected) tradition.\n\n\nAbu Dawud said: Ayyub, the narrator of this tradition, is not (Ayyub) al-Sakhtiyani.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 3820,
      "title": "Sunan Abi Dawud 3819",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) was brought a piece of cheese in Tabuk. He called for a knife, mentioned Allah's name and cut it.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 3821,
      "title": "Sunan Abi Dawud 3820",
      "narrator": "Jabir reported the Prophet (ﷺ) as saying:",
      "english_text": "What a good condiment vinegar is!",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 3822,
      "title": "Sunan Abi Dawud 3821",
      "narrator": "Jabir b. ‘Abd Allah reported the Prophet (ﷺ) as sayings:",
      "english_text": "What a good condiment vinegar is!",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 3823,
      "title": "Sunan Abi Dawud 3822",
      "narrator": "Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as sayings:",
      "english_text": "He who eats garlic or onion must keep away from us. Or he said: must keep away from our mosque or must sit in his house. A dish containing green vegetables was brought to him, and noticing that it had an odour he asked (about it). He was told that it contained some vegetables. He then said: Bring it near, to one of his companion who was with him. When he saw it, he abominated eating it, and said: eat for I hold intimate converse with one with whom you do not. Ahmad b. Salih said: Ibn Wahb explained the word badr as meaning dish.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 3824,
      "title": "Sunan Abi Dawud 3823",
      "narrator": "Narrated AbuSa'id al-Khudri:",
      "english_text": "The garlic and onions were mentioned before the Messenger of Allah (ﷺ). He was told: The most severe of them is garlic. Would you make it unlawful? The Prophet (ﷺ) said: Eat it, and he who eats it should not come near this mosque until its odour goes away.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 3825,
      "title": "Sunan Abi Dawud 3824",
      "narrator": "Narrated Hudhayfah ibn al-Yaman:",
      "english_text": "Zirr ibn Hubaysh said: Hudhayfah traced, I think, to the Messenger of Allah (ﷺ) the saying: He who spits in the direction of the qiblah will come on the Day of Resurrection in the state that his saliva will be between his eyes; and he who eats from this noxious vegetable should not come near our mosque, saying it three times.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 3826,
      "title": "Sunan Abi Dawud 3825",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) said: He who eats from this plant should not come near the mosques.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 3827,
      "title": "Sunan Abi Dawud 3826",
      "narrator": "Narrated Al-Mughirah ibn Shu'bah:",
      "english_text": "I ate garlic and came to the place where the Prophet (ﷺ) was praying; one rak'ah of prayer had been performed when I joined. When I entered the mosque, the Prophet (ﷺ) noticed the odour of garlic.  \n\n\n\n\n\nWhen the Messenger of Allah (ﷺ) finished his prayer, he said: He who eats from this plant should not come near us until its odour has gone away.  \n\n\n\n\n\nWhen I finished the prayer, I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, do give me your hand. Then I put his hand in the sleeve of my shirt, carrying it to my chest to show that my chest was fastened with a belt.  He said: You have a (valid) excuse.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 3828,
      "title": "Sunan Abi Dawud 3827",
      "narrator": "Narrated Mu'awiyah ibn Qurrah:",
      "english_text": "The Messenger of Allah (ﷺ) forbade these two plants (i.e. garlic and onions), and he said: He who eats them should not come near our mosque. If it is necessary to eat them, make them dead by cooking, that is, onions and garlic.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 3829,
      "title": "Sunan Abi Dawud 3828",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "It is forbidden to eat garlic unless it is cooked.\n\n\n\nAbu Dawud said: The full name of the narrator Sharik is Sharik bin Hanbal.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 3830,
      "title": "Sunan Abi Dawud 3829",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Khalid said: AbuZiyad Khiyar ibn Salamah asked Aisha about onions. She replied: The last food which the Messenger of Allah (ﷺ) ate was some which contained onions.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 3831,
      "title": "Sunan Abi Dawud 3830",
      "narrator": "Narrated Yusuf ibn Abdullah ibn Salam:",
      "english_text": "I saw that the Prophet (ﷺ) took a piece of bread of barley and put a date on it and said: This is the condiment of this.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 3832,
      "title": "Sunan Abi Dawud 3831",
      "narrator": "’A’ishah reported the Prophet(ﷺ) as saying:",
      "english_text": "A family which has no dates will be hungry.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 3833,
      "title": "Sunan Abi Dawud 3832",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "When the Prophet (ﷺ) was brought some old dates, he began to examine them and remove the worms from them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 3834,
      "title": "Sunan Abi Dawud 3833",
      "narrator": "Narrated Abdullah ibn AbuTalhah:",
      "english_text": "The Prophet (ﷺ) was brought some dates which contained worms. He then mentioned the rest of the tradition to the same effect as the previous (No 3823).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 3835,
      "title": "Sunan Abi Dawud 3834",
      "narrator": "Ibn ‘Umar said:",
      "english_text": "The Messenger of Allah(ﷺ) prohibited anyone taking two dates together with the exception that you ask permission from your companions.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 3836,
      "title": "Sunan Abi Dawud 3835",
      "narrator": "‘Abd Allah b. Ja’far said:",
      "english_text": "The Prophet(ﷺ) used to eat cucumber with fresh dates",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 3837,
      "title": "Sunan Abi Dawud 3836",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) used to eat melon with fresh dates, and he used to say: The heat of the one is broken by the coolness of the other, and the coolness of the one by the heat of the other.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 3838,
      "title": "Sunan Abi Dawud 3837",
      "narrator": "Narrated Abdullah ibn Busr ibn Atiyyah ibn Busr:",
      "english_text": "The Messenger of Allah (ﷺ) came to visit us and we offered him butter and dates, for he liked butter and dates.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 3839,
      "title": "Sunan Abi Dawud 3838",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "I was on an expedition along with the Messenger of Allah (ﷺ). We got the vessels and skins of the polytheists and used them. But he did not object to them (i.e. us) for that (action).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 3840,
      "title": "Sunan Abi Dawud 3839",
      "narrator": "Abu  Tha’labah al-khushani said that he asked the Messenger of Allah(ﷺ):",
      "english_text": "We live in the neighbourhood of the People of the Book and they cook in their pots(the flesh of) swine and drink wine in their vessels. The Messenger of Allah(ﷺ) said: If you find any other pots, then eat in them and drink. But if you do not find any others, then wash them with water and eat and drink (In them).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 3841,
      "title": "Sunan Abi Dawud 3840",
      "narrator": ") Jabir said:",
      "english_text": "The Messenger of Allah (ﷺ) sent us on an expedition and made Abu ‘Ubaidah b. al-Jarrah our leader. We had to meet a caravan of the Quraish. He gave us a bag of dates as a light meal during the journey. We had nothing except that. Abu ‘Ubaidah would give each of us one date. We used to suck them as a child sucks, and drink water after that and it sufficed us that day till night. We used to beat leaves off the trees with our sticks (for food), wetted them with water and ate them. We then went to the coast of the sea. There appeared to us a body like a great mound. When we came to it, we found that it was an animal called al-anbar. Abu ‘Ubaidah said: It is a carrion, and it is not lawful for us. He then said: No, we are the Messengers of the Apostel of Allah (ﷺ) and we are in the path of Allah. If you are forced by necessity (to eat it), then eat it. We stayed feeding on it for one mouth, till we became fat, and we were three hundred in number. When we came to the Messenger of Allah (ﷺ), we mentioned it to him. He said : It is a provision which Allah has brought forth for you, and give us some to eat if you have any meat of it with you. So we sent some of it to the Messenger of Allah (ﷺ) and he ate (it).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 3842,
      "title": "Sunan Abi Dawud 3841",
      "narrator": "Maimunah said:",
      "english_text": "A mouse fell into clarified butter. The Prophet (ﷺ) was informed of it. He said: Throw what is around it and eat.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 3843,
      "title": "Sunan Abi Dawud 3842",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: When a mouse falls into clarified butter, if it is sold, throw the mouse and what is around it away, but if it is in a liquid state, do not go near it. \n\n\nAl-Hasan said: AbdurRazzaq said: This tradition has been transmitted by Ma'mar, from az-Zuhri, from Ubaydullah ibn Abdullah ibn Abbas, from Maymunah, from the Prophet (ﷺ).",
      "grade": "Shadh (Al-Albani)  شاذ   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 3844,
      "title": "Sunan Abi Dawud 3843",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The tradition mentioned above (No. 3833) has also been transmitted by Ibn Abbas from Maymunah, from the Prophet (ﷺ) like the tradition narrated by az-Zuhri, from Ibn al-Musayyab.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 3845,
      "title": "Sunan Abi Dawud 3844",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:",
      "english_text": "when a fly alights in anyone’s vessel, he should plunge it all in, for in one of its wings there is a disease, and in the other is a cure. It prevents the wing of it is which there is a cure, so plunge it all in (the vessel).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 3846,
      "title": "Sunan Abi Dawud 3845",
      "narrator": "Anas b. Malik said that when the Messenger of Allah (ﷺ) ate food, he licked his three fingers. And he said:",
      "english_text": "If the morsel of one of you falls down, he should wipe away anything injurious on it and eat it and not leave it for the devil. And he ordered us to clean the dish, for one of  you does not leave it for the devil. And he ordered us to clean the dish, for one of you does not know in what part of his food the blessing lies.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 3847,
      "title": "Sunan Abi Dawud 3846",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying :",
      "english_text": "If the servant of any of you prepares food for him, and he brings it to him, while he had suffered its heat and smoke. He should make him sit with him to eat. If the food is scanty, he should put one or two morsels in his hand.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 3848,
      "title": "Sunan Abi Dawud 3847",
      "narrator": "Ibn ‘Abbas reported the Messenger of Allah (ﷺ) as saying :",
      "english_text": "When one of you eats, he must not wipe his hand with a handkerchief till he licks it or gives it to someone to lick.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 3849,
      "title": "Sunan Abi Dawud 3848",
      "narrator": "Ka’b b. Malik said:",
      "english_text": "The Prophet (ﷺ) used to eat with three fingers and not wipe his before licking it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 3850,
      "title": "Sunan Abi Dawud 3849",
      "narrator": "Abu Umamah said:",
      "english_text": "When the food cloth was removed, the Messenger of Allah (ﷺ) said: “praise be to Allah abundantly and sincerely, of such a nature as is productive of blessing, is not insufficient, Abandoned, or ignored, O our lord.”",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 3851,
      "title": "Sunan Abi Dawud 3850",
      "narrator": "Narrated AbuSa'id al-Khudri:",
      "english_text": "When the Messenger of Allah (ﷺ) finished his food, he said: \"Praise be to Allah Who has given us food and drink and made us Muslims.\"",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 3852,
      "title": "Sunan Abi Dawud 3851",
      "narrator": "Narrated AbuAyyub al-Ansari:",
      "english_text": "When the Messenger of Allah (ﷺ) ate or drank, he said: \"Praise be to Allah Who has given food and drink and made it easy to swallow, and provided an exit for it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 3853,
      "title": "Sunan Abi Dawud 3852",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone spends the night with grease on his hand which he has not washed away, he can blame only himself if some trouble comes to him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 3854,
      "title": "Sunan Abi Dawud 3853",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "AbulHaytham ibn at-Tayhan prepared food for the Messenger of Allah (ﷺ), and he invited the Prophet (ﷺ) and his Companions. When they finished (food), the said: If some people enter the house of a man, his food is eaten and his drink is drunk, and they supplicate (to Allah) for him, this is his reward.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 3855,
      "title": "Sunan Abi Dawud 3854",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Prophet (ﷺ) came to visit Sa'd ibn Ubaydah, and he brought bread and olive oil, and he ate (them). Them). Then the Prophet (ﷺ) said: May the fasting (men) break their fast with you, and the pious eat your food, and the angels pray for blessing on you.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}