{
  "chapterNum": 27,
  "english_title": "Drinks (Kitab Al-Ashribah)",
  "totalHadiths_inChapter": 67,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 3670,
      "title": "Sunan Abi Dawud 3669",
      "narrator": "’Umar said :",
      "english_text": "The prohibition of wine came down when (the Quranic verse ) came down. It was  made from five thing namely, grapes, dates, honey, wheat ,barley. Wine is what infects (khamara) the mind. There are three things I wished that the prophet (ﷺ) would not leave us until he explained them fully to our satisfaction: (share of) grandfather, one who leaves  no  descendants or ascendants as hairs, and the details of usury.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 3671,
      "title": "Sunan Abi Dawud 3670",
      "narrator": "Narrated Umar ibn al-Khattab:",
      "english_text": "When the prohibition of wine (was yet to be) declared, Umar said: O Allah, give us a satisfactory explanation about wine.  \n\n\n\n\n\nSo the following verse of Surat al-Baqarah revealed; \"They ask thee concerning wine and gambling. Say: In them is great sin....\" Umar was then called and it was recited to him.  \n\n\n\n\n\nHe said: O Allah, give us a satisfactory explanation about wine.  \n\n\n\n\n\nThen the following verse of Surat an-Nisa' was revealed: \"O ye who believe! approach not prayers with a mind befogged....\" Thereafter the herald of the Messenger of Allah (ﷺ) would call when the (congregational) prayer was performed: Beware, one who is drunk should not come to prayer. Umar was again called and it was recited to him).  \n\n\n\n\n\nHe said: O Allah, give us a satisfactory explanation about wine. This verse was revealed: \"Will ye not then abstain?\"  Umar said: We abstained.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 3672,
      "title": "Sunan Abi Dawud 3671",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "A man of the Ansar called him and AbdurRahman ibn Awf and supplied them wine before it was prohibited. Ali then led them in the evening prayer, and he recited; \"Say: O ye who reject faith.\" He was confused in it. Then the following verse came down: \"O ye who believe! approach not prayers with a mind befogged until you can understand all that ye say.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 3673,
      "title": "Sunan Abi Dawud 3672",
      "narrator": "Ibn  Abbas said:",
      "english_text": "The Quranic verse :”O ye who believe ,approach not prayer with minds befogged until you can understand all they say,” and the verse: “They ask thee concerning wine and gambling.  Say: In them is great sin and some profit for men ,” were repeated by the verse in Surat al-Ma’idah: ”O ye who believe, intoxicants and gambling,(dedication) stones.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 3674,
      "title": "Sunan Abi Dawud 3673",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "I was serving wine to the people in the house of AbuTalhah when it was prohibited and that day our wine was made from unripe dates. A man entered upon us and said: The wine has been prohibited, and the herald of the Messenger of Allah (ﷺ) made an announcement. We then said: This is the herald of the Messenger of Allah (ﷺ)",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 3675,
      "title": "Sunan Abi Dawud 3674",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) said: Allah has cursed wine, its drinker, its server, its seller, its buyer, its presser, the one for whom it is pressed, the one who conveys it, and the one to whom it is conveyed.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 3676,
      "title": "Sunan Abi Dawud 3675",
      "narrator": "Anas b. Malik said :",
      "english_text": "Abu Talhah asked the prophet (ﷺ) about the orphans who had inherited wine. He replied: Pour it out. He asked: May I not make vinegar of it ? He replied : No.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 3677,
      "title": "Sunan Abi Dawud 3676",
      "narrator": "Narrated An-Nu'man ibn Bashir:",
      "english_text": "The Prophet (ﷺ) said: from grapes wine is made, from dried dates wine is made, from honey wine is made, from wheat wine is made, from barley wine is made.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 3678,
      "title": "Sunan Abi Dawud 3677",
      "narrator": "Narrated An-Nu'man ibn Bashir:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: Wine is made from grape-syrup, raisins, dried dates, wheat, barley, millet, and I forbid you from every intoxicant.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 3679,
      "title": "Sunan Abi Dawud 3678",
      "narrator": "Abu Hurairah b. Bashir reported the Apostel of Allah (ﷺ)as saying:",
      "english_text": "Wine comes from these two trees, the date-palm and the grapes-vine.\n\n\nAbu Dawud said : The name of Abu KAthir al-Ubari is Yazid b. ‘Abd al-Rahman b. Ghufailat al-Sahmi. Some said: Uzainah. What is correct is Ghufailah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 3680,
      "title": "Sunan Abi Dawud 3679",
      "narrator": "Ibn ‘Umar reported the Apostel of Allah (ﷺ) as saying:",
      "english_text": "Every intoxicant is forbidden. He who drinks wine in this world, and dies when he is addiction to it, will not drink it in the next.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 3681,
      "title": "Sunan Abi Dawud 3680",
      "narrator": "Narrated Abdullah Ibn Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) said: Every intoxicant is khamr (wine) and every intoxicant is forbidden. If anyone drinks wine, Allah will not accept prayer from him for forty days, but if he repents, Allah will accept his repentance. If he repeats it a fourth time, it is binding on Allah that He will give him tinat al-khabal to drink.  \n\n\n\n\n\nHe was asked: What is tinat al-khabal, Messenger of Allah?  He replied: Discharge of wounds, flowing from the inhabitants of Hell. If anyone serves it to a minor who does not distinguish between the lawful and the unlawful, it is binding on Allah that He will give him to drink the discharge of wounds, flowing from the inhabitants of Hell.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 3682,
      "title": "Sunan Abi Dawud 3681",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Prophet (ﷺ) said: If a large amount of anything causes intoxication, a small amount of it is prohibited.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 3683,
      "title": "Sunan Abi Dawud 3682",
      "narrator": "’A’ishah said :",
      "english_text": "The Messenger of Allah (ﷺ) was asked about bit’. He replied: Every liquor which intoxicates is forbidden.\n\n\nAbu Dawud said: I read out this tradition to Yazid bin 'Abd Rabbihi al-Jurjisi. Muhammad bin Hard told you this tradition from al-Zabidi from al-Zuhri through his chain of narrators. This version added: Bit' is the nabidh from honey, which the people of the Yemen would drink.\n\n\nAbu Dawud said: I heard Ahmad bin Hanbal say: There is no god but Allah. there was none stronger in memory and like al-Jurjisi among the people of Hims.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 3684,
      "title": "Sunan Abi Dawud 3683",
      "narrator": "Narrated Daylam al-Himyari:",
      "english_text": "I asked the Prophet (ﷺ) and said: Messenger of Allah! we live in a cold land in which we do heavy work and we make a liquor from wheat to get strength from if for our work and to stand the cold of our country.  He asked: Is it intoxicating? I replied: Yes. He said: You must avoid it. I said: The people will not abandon it. He said: If they do not abandon it, fight with them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 3685,
      "title": "Sunan Abi Dawud 3684",
      "narrator": "Abu Musa said :",
      "english_text": "I asked the prophet (ﷺ) about wine made from honey.  He said: That is bit. I said: And the one made from barley and millet ? He said :That is mizr. He then said: Tell your people that every intoxicant is prohibited.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 3686,
      "title": "Sunan Abi Dawud 3685",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Prophet (ﷺ) forbade wine (khamr), game of chance (maysir), drum (kubah), and wine made from millet (ghubayrah), saying: Every intoxicant is forbidden.\n\n\nAbu Dawud said: Ibn Sallam Abu 'Ubaid said: Ghubairah was an intoxicant liquor made from millet. This wine was made by the Abyssinians",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 3687,
      "title": "Sunan Abi Dawud 3686",
      "narrator": "Narrated Umm Salamah, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) forbade every intoxicant and everything which produces languidness.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 3688,
      "title": "Sunan Abi Dawud 3687",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: Every intoxicant is forbidden; if a faraq of anything causes intoxication, a handful of it is forbidden.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 3689,
      "title": "Sunan Abi Dawud 3688",
      "narrator": "Narrated AbdurRahman ibn Ghanam:",
      "english_text": "Malik ibn AbuMaryam said: AbdurRahman ibn Ghanam entered upon us and we discussed tila' and he said: AbuMalik al-Ash'ari told me that he heard the Messenger of Allah (ﷺ) say: Some of my people will assuredly drink wine calling it by another name.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 3690,
      "title": "Sunan Abi Dawud 3689",
      "narrator": "Abu Dawud said:",
      "english_text": "An old man of the people of Wasit narrated from Abu Mansur al-Harith bin Mansur saying: I heard Sufyan Al-Thawri who was asked about al-dadhi. He said: The Messenger of Allah (ﷺ) said: Some of my people will assuredly drink wine calling it by another name.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 3691,
      "title": "Sunan Abi Dawud 3690",
      "narrator": "Ibn ‘Umar and Ibn ‘Abbas said :",
      "english_text": "We testify that the Messenger of Allah (ﷺ) forbade (the use of) gourds, green jars, receptacles smeared with pitch, and hollowed stumps of palm-trees.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 3692,
      "title": "Sunan Abi Dawud 3691",
      "narrator": "'Adb Allah bin 'Umar said:",
      "english_text": "The Messenger of Allah (ﷺ) forbade the nabidh (date-wine) of jarr. I was alarmed by his statement: The Apostel of Allah (ﷺ) forbade the nabidh of jarr. I then entered upon Ibn ‘Abbas and asked him : Are you listening to what  Ibn Umar says ? He asked : What is that ? I said : The Apostel of Allah (ﷺ) forbade the nabidh of jarr . He said :He spoke the truth. The Apostel of Allah (ﷺ) forbade the nabidh of jarr .I asked :what is jarr ? He replied : Anything made of clay.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 3693,
      "title": "Sunan Abi Dawud 3692",
      "narrator": "Ibn 'Abbas said:",
      "english_text": "The deputation of 'Abd al-Qais came to Messenger of Allah (ﷺ) and said: This is the tribe of Rabi'ah, and the infidels of Mudar are between us and you. We are able to come to you only in the sacred month. So give a decisive command which we may follow ourselves and to which we call those at home behind us. He (the Prophet) said: I command you to observe four things, and forbade you four things: Belief in Allah. the testimony that there is no god but Allah, and he expresses one by folding his hand. Musadad's version has: Faith in Allah, and he explained to them: The testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, observance of prayer, payment of zakat, and your giving the filth of the booty. I forbid you the use of pumpkins, green jarrs, vessels smeared with pitch, and hollow stumps of palm-trees. Ibn 'Ubaid's version has word muqayyar (vessels smeared with pitch) instead of naqir (hollow stumps). Musaddad's version has naqir and muqayyar (pitch); he did not mention muzaffat (vessels smeared with pitch).\n\n\nAbu Dawud said: The name of Abu Jamrah is Nasr bin 'Imran al-Duba'i.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 3694,
      "title": "Sunan Abi Dawud 3693",
      "narrator": "Abu Hurairah said:",
      "english_text": "The Messenger of Allah (ﷺ) said to the deputation of 'Abd al-Qais: I forbid you the use of hollow stumps, vessels smeared with pitch, green harrs, pumpkins, and a skin cut off at the top, but drink from your skin and tie it with string.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 3695,
      "title": "Sunan Abi Dawud 3694",
      "narrator": "In the story of the deputation of AbdulQays Ibn Abbas said:",
      "english_text": "They (the people) asked: In which should we drink, Prophet of Allah? The Prophet (ﷺ) said: You should use those skin vessels that are tied at their mouths.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 3696,
      "title": "Sunan Abi Dawud 3695",
      "narrator": "A man of the deputation of 'Abd al-Qais who came to the Prophet (ﷺ) said - the narrator 'Awf thinks that his name was Qais bin al-Nu'man:",
      "english_text": "The Prophet (ﷺ) said: Do not drink from hollowed stumps, vessel smeared with pitch, pumpkins, and green jars, but drink from a skin which is tied with string. If the drink ferments, lighten it by infusing water. If you are helpless, then pour it away.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 3697,
      "title": "Sunan Abi Dawud 3696",
      "narrator": "Ibn ‘Abbas said :",
      "english_text": "The deputation of ‘Abd al-Qais asked (the prophet):From which(vessels)should we drink ? He (the prophet) replied: Do not drink from the pumpkins, vessels smeared with pitch, and hollow stumps , and steep dates in skins. They asked: Messenger of Allah, if it ferments?  He replied: infuse water in it. They asked: Messenger of Allah...” (repeating the same words). He replied to them third or fourth time: Pour it away. He then said: Allah has forbidden me, or  he said: He has forbidden me wine, game of chance and kubah(drums). He said: Every intoxicant is unlawful. Sufyan said: I asked ‘All b. Badhimah about kubah\t. He replied: Drum.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 3698,
      "title": "Sunan Abi Dawud 3697",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "The Messenger of Allah (ﷺ) forbade us the use of pumpkins, green jars, hollow stumps and wine made from barley.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 3699,
      "title": "Sunan Abi Dawud 3698",
      "narrator": "Narrated Buraydah ibn al-Hasib:",
      "english_text": "The Prophet (ﷺ) said: I forbade you three things, and now I command (permit) you for them. I forbade you to visit graves, now you may visit them, for in visiting them there is admonition. I forbade you drinks except from skin vessels, but now you may drink from any kind of vessels, but do not drink an intoxicant. I forbade you to eat the meat of sacrificial animals after three days, but now you may eat and enjoy it during your journeys.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 3700,
      "title": "Sunan Abi Dawud 3699",
      "narrator": "Jabir b. ‘Abd Allah said:",
      "english_text": "When the Messenger of Allah(ﷺ) forbade the use of(wine) vessels,  Ansar  said: They are inevitable for us. Thereupon he said: If so, then no",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 3701,
      "title": "Sunan Abi Dawud 3700",
      "narrator": "‘Abd Allah b.’ Amr said:",
      "english_text": "The Prophet(ﷺ) mentioned the vessels: pumpkins, green jarrs, vessels smeared with pitch and hollow stumps. A desert Arab said: We have no vessels(except these). He said: Drink(from them) what is lawful.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 3702,
      "title": "Sunan Abi Dawud 3701",
      "narrator": "The tradition mentioned above has also been transmitted by Sharik through a different chain  of narrators. This version has:",
      "english_text": "Avoid that which produces intoxication.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 3703,
      "title": "Sunan Abi Dawud 3702",
      "narrator": "Jabir b. ‘Abd Allah said:",
      "english_text": "Dates were steeped for the Messenger of Allah (ﷺ) in a skin, but when they could not find a skin, they were steeped for him in a small stone vessel.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 3704,
      "title": "Sunan Abi Dawud 3703",
      "narrator": "Jabir b.’Abd Allah said:",
      "english_text": "The Messenger of Allah(ﷺ) forbade mixing of raisins and dried dates: and unripe dates and fresh dates.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 3705,
      "title": "Sunan Abi Dawud 3704",
      "narrator": "‘Abd Allah b. Abi Qatadah said that his father Abu Qatadah forbade mixing raisins and dried dates, mixing unripe dates and fresh dates, and mixing dates beginning to take on colour and fresh dates. He said:",
      "english_text": "Make nabidh  (drink) from each separately.\n\n\nHe (the narrator Yahya) said: Abu Salamah bin 'Abd al-Rahman narrated to me this tradition on the authority of Abu Qatadah from the Prophet (ﷺ)",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 3706,
      "title": "Sunan Abi Dawud 3705",
      "narrator": "Narrated A man:",
      "english_text": "A man from among the Companions of the Prophet (ﷺ) said: The Prophet (ﷺ) forbade (mixing) unripe dates and dried dates, and (mixing) raisins and dried dates.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 3707,
      "title": "Sunan Abi Dawud 3706",
      "narrator": "Narrated Umm Salamah, Ummul Mu'minin:",
      "english_text": "Kabshah, daughter of AbuMaryam, asked Umm Salamah (Allah be pleased with her): What did the Prophet (ﷺ) prohibit? She replied: He forbade us to boil dates so much so that the kernels are spoiled, and to mix raisins and dried dates.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 3708,
      "title": "Sunan Abi Dawud 3707",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Raisins were steeped for the Messenger of Allah (ﷺ) and then dried dates were infused in them, or dried dates were steeped and then raisins were infused in them.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 3709,
      "title": "Sunan Abi Dawud 3708",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Safiyyah, daughter of Atiyyah, said: I entered upon Aisha with some women of AbdulQays, and asked her about mixing dried dates and raisins (for drink). She replied: I used to take a handful of dried dates and a handful or raisins and put them in a vessel, and then crush them (and soak in water). Then I would give it to the Prophet (ﷺ) to drink.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 3710,
      "title": "Sunan Abi Dawud 3709",
      "narrator": "Qatadah said on the authority of Jabir b. Zaid and ‘Ikrimah that they disapprove of drink made exclusively from unripe dates. This they reported on the authority of Ibn ‘Abbas said:",
      "english_text": "I am afraid it may not be muzza  from which(the people of) ‘Abd al-Qais were prohibited. I asked Qatadah : What is muzza’?  He replied: Drink of dates made in a green jar and vessels smeared with pitch.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 3711,
      "title": "Sunan Abi Dawud 3710",
      "narrator": "Narrated Ad-Daylami:",
      "english_text": "We came to the Prophet (ﷺ) and said to him: Messenger of Allah, you know who we are, from where we are and to whom we have come. He said: To Allah and His Apostle. We said: Messenger of Allah, we have grapes; what should we do with them? He said: Make them raisins. We then asked: What should we do with raisins? He replied: Steep them in the morning and drink in the evening, and steep them in the evening and drink in the morning. Steep them in skin vessels and do not steep them in earthen jar, for it it is delayed in pressing, it becomes vinegar.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 3712,
      "title": "Sunan Abi Dawud 3711",
      "narrator": "A’ishah said :",
      "english_text": "Dates were steeped for the Apostel of Allah (ﷺ) in skin which was tied up at the top and had a mouth. What was steeped in the morning he would drink in the evening and what was steeped in the evening he would drink in the morning.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 3713,
      "title": "Sunan Abi Dawud 3712",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Amrah said on the authority of Aisha that she would steep dates for the Messenger of Allah (ﷺ) in the morning. When the evening came, he took his dinner and drank it after his dinner. If anything remained, she poured it out. She then would steep for him at night. When the morning came, he took his morning meal and drank it after his morning meal. She said: The skin vessel was washed in the morning and in the evening. My father (Hayyan) said to her: Twice a day? She said: Yes.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 3714,
      "title": "Sunan Abi Dawud 3713",
      "narrator": "Ibn abbas said :",
      "english_text": "Raisins were steeped for the Prophet (ﷺ) and he would drink it in the morning and the night after, the following day and the night after. He then gave orders and it was given to servants to drinks or poured away.\n\n\nAbu Dawud said: That \"it was given to servants to drink\" means before it spoiled.\n\n\nAbu Dawud said: Abu 'Umar Yahya al-Bahrani.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 3715,
      "title": "Sunan Abi Dawud 3714",
      "narrator": "A’ishah said that the prophet (ﷺ) used to stay with Zainab, daughter of Jahsh, and drink honey. I and Hafsah counseled each other that if the Prophet (ﷺ) enters upon any of us, she must say :",
      "english_text": "I find the smell of gum (maghafir) from you. He then entered upon one of them; she said that to him. Thereupon he said : No, I drank honey at (the house of) Zainab daughter of jahsh, and I will not do it again. Then the following verse came down :’’O Prophet !why holdest thou to be forbidden that which Allah has made lawful to thee ? ‘’Thou seekest. . . If you two turn in repentance to Allah ‘’ refers to Hafsah and A’ishah , and the verse: ‘’When the Prophet disclosed a matter in confidence to one of his consorts’’ refers to the statements of the Prophet (ﷺ) disclosed a matter in confidence to one of his consorts’’ refers to the statement of the Prophet (ﷺ) :No, I drank honey.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 3716,
      "title": "Sunan Abi Dawud 3715",
      "narrator": "‘A’ishah said :",
      "english_text": "The Messenger of Allah(ﷺ) liked sweet meats and honey. The narrator then mentioned a part of the tradition mentioned above. The Messenger of Allah (ﷺ) felt it hard on him to find smell from him. In this tradition saudah said: but you ate gum ? He said : No, I drank honey. Hafsah gave it to me to drank. I said : Its bees ate ‘urfut.\n\n\nAbu Dawud said: Maghafir is a gum ; jarasat means ate; ’urfut is a bees ‘ plant.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 3717,
      "title": "Sunan Abi Dawud 3716",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "I knew that the Messenger of Allah (ﷺ) used to keep fast. I waited for the day when he did not fast to present him the drink (nabidh) which I made in a pumpkin. I then brought it to him while it fermented. He said: Throw it to this wall, for this is a drink of the one who does not believe in Allah and the Last Day.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 3718,
      "title": "Sunan Abi Dawud 3717",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Prophet (ﷺ) forbade that a man should drink while standing.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 3719,
      "title": "Sunan Abi Dawud 3718",
      "narrator": "Nazzal b. Samurah said :",
      "english_text": "‘Ali asked for water and he drank it while standing. He then said: some people disapprove of doing this (drinking while standing ), but I saw the Messenger of Allah (ﷺ) doing as I have done.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 3720,
      "title": "Sunan Abi Dawud 3719",
      "narrator": "Ibn Abbas said:",
      "english_text": "The apostle of allah (ﷺ) forbade drinking from the mouth of a water-skin, and riding the animal which feeds on filth and eating the animal which is killed in confinement.\n\n\nAbu Dawud said: Jallalah means an animal which eats filth and impurities.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 3721,
      "title": "Sunan Abi Dawud 3720",
      "narrator": "Abu Sa’id al-Khudri said :",
      "english_text": "The Messenger of Allah (ﷺ) prohibited drinking by inverting the heads of skin vessels.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 3722,
      "title": "Sunan Abi Dawud 3721",
      "narrator": "A man of the Ansar quoting from his father said that the Prophet (ﷺ) called for a skin-vessel on the day of the battle of Uhud. He then said:",
      "english_text": "Invert the head of the vessel and he drank from its mouth.",
      "grade": "Munkar (Al-Albani)  منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 3723,
      "title": "Sunan Abi Dawud 3722",
      "narrator": "Abu sa’id al-Khudri said:",
      "english_text": "The apostle of Allah (ﷺ) forbade drinking from the broken place (of a cup) and blowing into a drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 3724,
      "title": "Sunan Abi Dawud 3723",
      "narrator": "Ibn Abi Laila said:",
      "english_text": "Whan Hudhaifah was in al-Mada’in, he asked for water. A peasant brought him a silver vessel. He threw it away and said: I threw it away, for I prohibited (him) but he did not stop. The Messenger of Allah (ﷺ) forbade to wear silk or brocade, and to drink from gold and silver vessels. He said: Others have them in this world and you will have them in the next.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 3725,
      "title": "Sunan Abi Dawud 3724",
      "narrator": "Jabir b. ‘abd Allah said:",
      "english_text": "The Prophet (ﷺ) went to visit a man of the Ansar accompanied by one of his Companions who was watering his garden. The Messenger of Allah(ﷺ) said: If you have any water which has remained over night in a skin (we should like it), or shall sip (from a streamlet).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 3726,
      "title": "Sunan Abi Dawud 3725",
      "narrator": "Narrated Abdullah ibn AbuAwfa:",
      "english_text": "The Prophet (ﷺ) said: The supplier of the people is the last (man) to drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 3727,
      "title": "Sunan Abi Dawud 3726",
      "narrator": "Anas b. Malik said:",
      "english_text": "The Prophet (ﷺ) was brought milk that was mixed with water. A nomad Arab was on his right and Abu Bakr was on his left. He himself drank and gave it to the nomad Arab, and said: He who is on the right , then he who is on his right then he who is on his right.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 3728,
      "title": "Sunan Abi Dawud 3727",
      "narrator": "Anas b.Malik said :",
      "english_text": "when the prophet (ﷺ) drank, he used to breathe three times in the course of  a drink and say : It is more whole some ,thrist-quenching and healthier.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 3729,
      "title": "Sunan Abi Dawud 3728",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) forbade blowing or breathing into a vessel.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 3730,
      "title": "Sunan Abi Dawud 3729",
      "narrator": "’Abd Allah b. Busr from Banu Sulaim said:",
      "english_text": "The Messenger of Allah (ﷺ) came to my father and he was a guest with him. He offered food to him and brought hais. He then brought a drink which he drank and he gave it to the one on his right. He ate dried dates and began to put the kernels on the back of his ring finger and middle finger. When he got up, my father also got up, and held the rein of his mount. He said : Pray to Allah for me. He said : O Allah, bless them in what you provided them, and have mercy on them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 3731,
      "title": "Sunan Abi Dawud 3730",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "I was in the house of Maymunah. The Messenger of Allah (ﷺ) accompanied by Khalid ibn al-Walid entered. Two roasted long-tailed lizards (dabb) placed on the sticks were brought to him. The Messenger of Allah (ﷺ) spat. Khalid said: I think that you abominate it, Messenger of Allah. He said: Yes. Then the Messenger of Allah (ﷺ) was brought milk, and he drank (it). The Messenger of Allah  (ﷺ) then said: When one of you eats food, he should say: O Allah, bless us in it, and give us food (or nourishment) better than it. When he is given milk to drink he should say: O Allah! bless us in it and give us more of it, for no food or drink satisfies like milk.\n\n\n\nAbu Dawud said: This is the Musaddad's version.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 3732,
      "title": "Sunan Abi Dawud 3731",
      "narrator": "Jabir reported the Prophet (ﷺ) as saying:",
      "english_text": "Shut your door and make mention of Allah's name, for the devil does not open a door which has been shut; extinguish your lamp and make mention of Allah's name, cover up your vessel even by a piece of wood that you just put on it and make mention of Allah's name, and tie up your water-skin mentioning Allah's name.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 3733,
      "title": "Sunan Abi Dawud 3732",
      "narrator": "",
      "english_text": "Jabir b.’Abd Allah reported the Prophet (ﷺ)as saying this version is not complete ‘’for the devil does not open a shut door, or loosen a water-skin, or uncover a vessel, for a mouse sets a house on fire over its inhabitants’’.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 3734,
      "title": "Sunan Abi Dawud 3733",
      "narrator": "Jabir b.Abd Allah reported the Prophet (ﷺ) as saying:",
      "english_text": "Gather your children when darkness spreads, or in the evening (according to Musaddad), for the jinn are abroad and seize them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 3735,
      "title": "Sunan Abi Dawud 3734",
      "narrator": "Jabir said:",
      "english_text": "We were with Prophet (ﷺ) and he asked for something to drink. A man from the company  asked: Should we not give you nabidh (drink made from dates) to drink ? He replied : Yes . The man went quickly and bought a cup of nabidh. The Messenger of Allah (ﷺ) said: Why did you not cover it up even by putting a piece of wood on it ?\n\n\nAbu Dawud said: Al-Asma'i's version has: \"You put it on it...\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 3736,
      "title": "Sunan Abi Dawud 3735",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The water from as-Suqya' was considered sweetest by the Prophet (ﷺ). Qutaybah said: it was a well on two days' journey from Medina.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}