{
  "chapterNum": 33,
  "english_title": "Hot Baths (Kitab Al-Hammam)",
  "totalHadiths_inChapter": 11,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 4010,
      "title": "Sunan Abi Dawud 4009",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) forbade to enter the hot baths. He then permitted men to enter them in lower garments.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 4011,
      "title": "Sunan Abi Dawud 4010",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "AbulMalih said: Some women of Syria came to Aisha. She asked them: From whom are you? They replied: From the people of Syria. She said: Perhaps you belong to the place where women enter hot baths (for washing ). The said: Yes. She said: I heard the Messenger of Allah (ﷺ) say: If a woman puts off her clothes in a place other than her house, she tears the veil between her and Allah, the Exalted.\n\n\n\nAbu Dawud said: This is the tradition narrated by Jarir, and it is more perfect. Jarir did not mention Abu al-Malih. He said (on the authority of 'A'ishah) that the Messenger of Allah (ﷺ) said.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 4012,
      "title": "Sunan Abi Dawud 4011",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Prophet (ﷺ) said: After some time the lands of the non-Arabs will be conquered for you, and there you will find houses called hammamat (hot baths). so men should not enter them (to wash) except in lower garments, and forbid the women to enter them except a sick or one who is in a child-bed.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 4013,
      "title": "Sunan Abi Dawud 4012",
      "narrator": "Narrated Ya'la:",
      "english_text": "The Messenger of Allah (ﷺ) saw a man washing in a public place without a lower garment. So he mounted the pulpit, praised and extolled Allah and said: Allah is characterised by modesty and concealment. So when any of you washes, he should conceal himself.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 4014,
      "title": "Sunan Abi Dawud 4013",
      "narrator": "The tradition mentioned above has also been transmitted by Ya'la from the Prophet (ﷺ) through a different chain of narrators.\n\n\nAbu Dawud said:",
      "english_text": "The former is more perfect.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 4015,
      "title": "Sunan Abi Dawud 4014",
      "narrator": "Narrated Jarhad:",
      "english_text": "The Messenger of Allah (ﷺ) sat with us and my thigh was uncovered. He said: Do you not know that thigh is a private part ?",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 4016,
      "title": "Sunan Abi Dawud 4015",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "The Prophet (ﷺ) said: Do not uncover you thigh, and do not look at the thigh of the living and the dead.\n\n\n\nAbu Dawud said: This tradition disagrees with the generally reported traditions (nakarah).",
      "grade": "Da'if Jiddan (Al-Albani)  ضعيف جدا   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 4017,
      "title": "Sunan Abi Dawud 4016",
      "narrator": "Narrated Al-Miswar b. Makhramah:",
      "english_text": "I lifted a heavy stone. While I was walking my garment fell down. The Messenger of Allah (ﷺ) said to me: Take you garment upon you, and do not walk naked.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 4018,
      "title": "Sunan Abi Dawud 4017",
      "narrator": "Bahz b. Hakim said that his father told on the authority of his grandfather:",
      "english_text": "I said: Messenger of Allah, from whom should we conceal our private parts and to whom can we show? He replied: conceal your private parts except from your wife and from whom your right hands possess (slave-girls). \n\n\n\n\n\nI then asked: Messenger of Allah, (what should we do), if the people are assembled together? \n\n\n\n\n\nHe replied: If it is within your power that no one looks at it, then no one should look at it. \n\n\n\n\n\nI then asked: Messenger of Allah if one of us is alone, (what should he do)? \n\n\n\n\n\nHe replied: Allah is more entitled than people that bashfulness should be shown to him.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 4019,
      "title": "Sunan Abi Dawud 4018",
      "narrator": "Narrated AbuSa'id al-Khudri:",
      "english_text": "The Prophet (ﷺ) said: A man should not look at the private parts of another man, and a woman should not look at the private parts of another woman. A man should not lie with another man without wearing lower garment under one cover; and a woman should not be lie with another woman without wearing lower garment under one cover.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 4020,
      "title": "Sunan Abi Dawud 4019",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: A man should not lie with another man and a woman should not lie with another woman without covering their private parts except a child or a father. He also mentioned a third thing which I forgot.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    }
  ]
}