{
  "chapterNum": 19,
  "english_title": "Shares of Inheritance (Kitab Al-Fara'id)",
  "totalHadiths_inChapter": 43,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 2886,
      "title": "Sunan Abi Dawud 2885",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Prophet (ﷺ) said: Knowledge has three categories; anything else is extra; a precise verse, or an established sunnah (practice), or a firm obligatory duty.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 2887,
      "title": "Sunan Abi Dawud 2886",
      "narrator": "Narrated Jabir:",
      "english_text": "I fell ill, and the Prophet (ﷺ) and Abu Bakr came to me on foot to visit me. As I was unconscious, I could not speak to him. He performed ablution and sprinkled water on me ; so I became conscious. I said: Messenger of Allah, how should I do in my property, as I have sisters? Thereafter the verse about inheritance was revealed: \"They ask thee for legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 2888,
      "title": "Sunan Abi Dawud 2887",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "I fell ill, and I had seven sisters. The Messenger of Allah (ﷺ) came to me and blew on my face. So I became conscious. I said: Messenger of Allah, may I not bequeath one-third of my property to my sisters? He replied: Do good. I asked: Half? He replied: Do good. He then went out and left me, and said: I do not think, Jabir, you will die of this disease. Allah has revealed (verses) and described the share of your sisters. He appointed two-thirds for them. Jabir used to say: This verse was revealed about me: \"They ask thee for a legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 2889,
      "title": "Sunan Abi Dawud 2888",
      "narrator": "Narrated Al-Bara' bin 'Azib:",
      "english_text": "The last verse revealed about the decease who left no descendants or ascendants: \"They ask thee for the legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 2890,
      "title": "Sunan Abi Dawud 2889",
      "narrator": "Narrated Al-Bara' ibn Azib:",
      "english_text": "A man came to the Prophet (ﷺ) and said: Messenger of Allah, they ask thee for a legal decision about a kalalah. What is meant by kalalah? He replied: The verse revealed in summer is sufficient for you.  \n\n\n\n\n\nI asked AbuIshaq: Does it mean a person who dies and leaves neither children nor father? He said: This is so. The people think it is so.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 2891,
      "title": "Sunan Abi Dawud 2890",
      "narrator": "Narrated Huzail b. Shurahbil al-Awadi:",
      "english_text": "A man came to Abu Musa al-Ash'ari and Salman b. Rabi'ah, and asked about a case where there were a daughter, a son's daughter and full sister. They replied: The daughter gets half and the full gets half. The son's daughter gets nothing. Go to Ibn Mas'ud and you will find that he agrees with me. So the man came to him and informed him about their opinion. He said: I would then be in error and not be one of those who are rightly guided. But I decide concerning the matter as the Messenger of Allah (ﷺ) did: The daughter gets half, and the son's daughter gets a share which complete thirds (i.e. gets a sixth), and what remain to the full sister.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 2892,
      "title": "Sunan Abi Dawud 2891",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "We went out with the Messenger of Allah (ﷺ) and came to a woman of the Ansar in al-Aswaf. The woman brought her two daughters, and said: Messenger of Allah, these are the daughters of Thabit ibn Qays who was killed as a martyr when he was with you at the battle of Uhud, their paternal uncle has taken all their property and inheritance, and he has not left anything for them. What do you think, Messenger of Allah? They cannot be married unless they have some property. The Messenger of Allah (ﷺ) said: Allah will decide regarding the matter. Then the verse of Surat an-Nisa was revealed: \"Allah (thus) directs you as regards your children's (inheritance).\" Messenger of Allah (ﷺ) said: Call to me the woman and her husband's brother. He then said to their paternal uncle: Give them two-thirds and their mother an eighth, and what remains is yours.\n\n\nAbu Dawud said: The narrator Bishr made a mistake. They were the daughters of Sa'd b. al-Rabi' for Thabit b. Qais was killed in the battle of Yamamah.",
      "grade": "حسن لكن ذكر ثابت بن قيس فيه خطأ والمحفوظ أنه سعد بن الربيع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 2893,
      "title": "Sunan Abi Dawud 2892",
      "narrator": "Narrated Jabir bin ‘Abdullah :",
      "english_text": "The wife of Sa'd b. al-Rabi said: Messenger of Allah, Sa'd died and left two daughters. He then narrated the rest of the tradition in a similar way.\n\n\nAbu Dawud said: This is the most correct tradition.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 2894,
      "title": "Sunan Abi Dawud 2893",
      "narrator": "Narrated Al-Aswad b. Yazid:",
      "english_text": "Mu'adh b. Jabal gave shares of inheritance to a sister and a daughter. He gave each of them half. He was at Yemen while the Prophet (ﷺ) was alive.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 2895,
      "title": "Sunan Abi Dawud 2894",
      "narrator": "Narrated Qabisah ibn Dhuwayb:",
      "english_text": "A grandmother came to AbuBakr asking him for her share of inheritance. He said: There is nothing prescribed for you in Allah's Book, nor do I know anything for you in the Sunnah of the Prophet of Allah (ﷺ) Go home till I question the people. He then questioned the people, and al-Mughirah ibn Shu'bah said: I had been present with the Messenger of Allah  (ﷺ) when he gave grandmother a sixth. AbuBakr said: Is there anyone with you? Muhammad ibn Maslamah stood and said the same as al-Mughirah ibn Shu'bah had said. So AbuBakr made it apply to her. Another grandmother came to Umar ibn al-Khattab asking him for her share of inheritance. He said: Nothing has been prescribed for you in Allah's Book. The decision made before you was made for a grandmother other than you. I am not going to add in the shares of inheritance; but it is that sixth. If there are two of you, it is shared between you, but whichever of you is the only one left gets it all.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 2896,
      "title": "Sunan Abi Dawud 2895",
      "narrator": "Narrated Buraydah:",
      "english_text": "The Prophet (ﷺ) appointed a sixth to a grandmother if no mother is left to inherit before her.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 2897,
      "title": "Sunan Abi Dawud 2896",
      "narrator": "Narrated Imran ibn Husayn:",
      "english_text": "A man came to the Prophet (ﷺ) and said: My son has died; what do I receive from his estate? He replied: You receive a sixth. When he turned away he called him and said: You receive another sixth. When he turned away, he called him and said: The other sixth is an allowance (beyond what is due). \n\n\n\n\n\nQatadah said: They (the Companions) did not know the heirs with whom he was given (a sixth). Qatadah said: The minimum share given to the grandfather was a sixth.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 2898,
      "title": "Sunan Abi Dawud 2897",
      "narrator": "Al-Hasan reported that Umar asked:",
      "english_text": "Which of your knows what share the Messenger of Allah (ﷺ) had given to the grandfather from the estate? Ma'qil ibn Yasar said: The Messenger of Allah (ﷺ) gave him a sixth. He asked: Along with whom? He replied: I do not know. He said: You do not know; what is the use then?",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 2899,
      "title": "Sunan Abi Dawud 2898",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: Divide the property among those whose share have been prescribed in the Book of Allah, and what remains from the prescribed shares goes to the nearest male heirs.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 2900,
      "title": "Sunan Abi Dawud 2899",
      "narrator": "Narrated Al-Miqdam al-Kindi:",
      "english_text": "The Prophet (ﷺ) said: If anyone leaves a debt or a  helpless family I shall be responsible-and sometimes the narrator said: Allah and His Apostle  will be responsible-but if anyone leaves property, it goes to his heirs. I am the heirs of him who has none, paying blood-wit for him and inheriting from him; and a maternal uncle is the heir of him who has none, paying blood-wit for him and inheriting from him.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 2901,
      "title": "Sunan Abi Dawud 2900",
      "narrator": "Narrated Al-Miqdam al-Kindi:",
      "english_text": "The Prophet (ﷺ) said: I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family, I shall be responsible, but if anyone leaves property, it goes to his heirs. I am patron of him who has none, inheriting his property and freeing him from his liabilities. A maternal uncle is patron of him who has none, inheriting his property and freeing him from his liabilities.\n\n\nAbu Dawud said: da'iah means dependants or helpless family.\n\n\nAbu Dawud said: This tradition has been transmitted by al-Zubaidi from Rashid b. Sa'd from Ibn 'A'idh on the authority of al-Miqdam. It has also been transmitted by Mu'awiyah b. Salih from Rashid who said: I heard al-Miqdam (say).",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 2902,
      "title": "Sunan Abi Dawud 2901",
      "narrator": "Narrated Al-Miqdam:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: I am the heirs of Him who has none, freeing him from his liabilities, and inheriting what he possesses. A maternal uncle is the heir of Him who has none, freeing him from his liabilities, and inheriting his property.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 2903,
      "title": "Sunan Abi Dawud 2902",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "A client of the Prophet (ﷺ) died and left some property, but he left no child or relative. The Messenger of Allah (ﷺ) said: Give what he has left to a man belonging to his village.\n\n\nAbu Dawud said: The tradition of Sufyan is more perfect. Musaddad said: Thereupon the Prophet (ﷺ) said: Is there anyone belonging to his land ? They replied: Yes. He said: Then give him what he has left.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 2904,
      "title": "Sunan Abi Dawud 2903",
      "narrator": "Narrated Buraydah ibn al-Hasib:",
      "english_text": "A man came to the Messenger of Allah (ﷺ) and said: I have property left by a man of Azd. I do not find any man of Azd to give it to him. He said: Go and look for man of Azd for a year. He then came to him after one year and said: Messenger of Allah, I did not find any man of Azd to give it to him. He said: Look for a man of Khuza'ah whom you meet first and give it to him. When he turned away, he said; Call the man to me. When he came to him, he said: Look for the leading man of Khuza'ah and give it to him.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 2905,
      "title": "Sunan Abi Dawud 2904",
      "narrator": "Narrated Buraydah ibn al-Hasib:",
      "english_text": "A man of Khuza'ah died and his estate was brought to the Prophet (ﷺ). He said: Look for his heir or some relative. But they found neither heir nor relative. The Messenger of Allah (ﷺ) said: Give it to the leading man of Khuza'ah. The narrator Yahya said: Sometimes I heard him (al-Husayn ibn Aswad) say in this tradition: Look for the greatest man of Khuza'ah.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 2906,
      "title": "Sunan Abi Dawud 2905",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "A man died leaving no heir but a slave whom he had emancipated. The Messenger of Allah (ﷺ) asked: Has he any heir? They replied: No, except a slave whom he had emancipated. The Messenger of Allah (ﷺ) assigned his estate to him (the emancipated slave).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 2907,
      "title": "Sunan Abi Dawud 2906",
      "narrator": "Narrated Wathilah ibn al-Asqa':",
      "english_text": "The Prophet (ﷺ) said: A woman gets inheritance from the three following: one she has set free, a foundling, and her child about whom she has invoked a curse on herself if she was untrue in declaring he was not born out of wedlock.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 2908,
      "title": "Sunan Abi Dawud 2907",
      "narrator": "Narrated Makhul:",
      "english_text": "The Messenger of Allah (ﷺ) assigned the estate of a child of a woman about whom she had invoked a curse to her mother, and to her heirs after her.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 2909,
      "title": "Sunan Abi Dawud 2908",
      "narrator": "Narrated 'Amr bin Shu'aib:",
      "english_text": "On his father's authority, said that his grandfather reported from the Prophet (ﷺ) something similar.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 2910,
      "title": "Sunan Abi Dawud 2909",
      "narrator": "Narrated Usamah b. Zaid:",
      "english_text": "The Prophet (ﷺ) as saying: A Muslim may not inherit from an infidel nor an infidel from a Muslim.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 2911,
      "title": "Sunan Abi Dawud 2910",
      "narrator": "Narrated Usamah b. Zaid:",
      "english_text": "I said: Messenger of Allah, where will you stay tomorrow ? This (happened) during his Hajj. He replied: Has 'Aqil left any house for us ? He then said: We shall stay at the valley of Banu Kinarah where the Quraish took an oath on unbelief. This refers to al-Muhassab. The reason is that Banu Kinarah made an alliance with the Quraish against Banu Hashim that they would have no marital connections with them, nor will have commercial transactions with them, not will give them any refuge.\n\n\nAl-Zuhri said: Khalf means valley.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 2912,
      "title": "Sunan Abi Dawud 2911",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Prophet (ﷺ) said: people of two different religions would not inherit from one another.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 2913,
      "title": "Sunan Abi Dawud 2912",
      "narrator": "Narrated Mu'adh ibn Jabal:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: Islam increases and does not diminish. He, therefore, appointed a Muslim heir (of a non-Muslim).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 2914,
      "title": "Sunan Abi Dawud 2913",
      "narrator": "Narrated Abu Al-Aswad al-Dili:",
      "english_text": "Mu'adh bought the property of a Jew whose heir was a Muslim. He then narrated from the Prophet (ﷺ) to the same effect.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 2915,
      "title": "Sunan Abi Dawud 2914",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: An estate which was divided in pre-Islamic period may follow the division in force then, but any estate in Islamic times must follow the division laid down by Islam.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 2916,
      "title": "Sunan Abi Dawud 2915",
      "narrator": "Narrated Ibn 'Umar:",
      "english_text": "'Aishah, mother of believers (ra), intended to buy a slave-girl to set her free. Her people said: We shall sell her to you on one condition that we shall inherit from her. 'Aishah mentioned it to the Messenger of Allah (ﷺ). He said: That should not prevent you, for the right of inheritance belongs to the one who has set a person free.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 2917,
      "title": "Sunan Abi Dawud 2916",
      "narrator": "Narrated 'Aishah:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: The right of inheritance belongs to only to the one who paid the price (of the slave) and patronised him by doing an act of gratitude.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 2918,
      "title": "Sunan Abi Dawud 2917",
      "narrator": "Narrated 'Amr b. Suh'aib:",
      "english_text": "On his father's authority, said that his grandfather reported: Rabab ibn Hudhayfah married a woman and three sons were born to him from her. Their mother then died. They inherited her houses and had the right of inheritance of her freed slaves. \n\n\n\n\n\nAmr ibn al-'As was the agnate of her sons. He sent them to Syria where they died. Amr ibn al-'As then came. A freed slave of hers died and left some property. Her brothers disputed with him and brought the case to Umar ibn al-Khattab.  \n\n\n\n\n\nUmar reported the Messenger of Allah (ﷺ) as saying: Whatever property a son or a father receives as an heir will go to his agnates, whoever they may be. He then wrote a document for him, witnessed by AbdurRahman ibn Awf, Zayd ibn Thabit and one other person. When AbdulMalik became caliph, they presented the case to Hisham ibn Isma'il or Isma'il ibn Hisham (the narrator is doubtful).  \n\n\n\n\n\nHe sent them to 'Abd al-Malik who said: This is the decision which I have already seen.  \n\n\n\n\n\nThe narrator said: So he ('Abd al-Malik) made the decision on the basis of the document of Umar ibn al-Khattab, and that is still with us till this moment.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 2919,
      "title": "Sunan Abi Dawud 2918",
      "narrator": "Narrated Tamim ad-Dari:",
      "english_text": "Tamim asked: Messenger of Allah), what is the sunnah about a man who accepts Islam by advice and persuasion of a Muslim? He replied: He is the nearest to him in life and in death.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 2920,
      "title": "Sunan Abi Dawud 2919",
      "narrator": "Narrated Ibn 'Umar:",
      "english_text": "The Messenger of Allah (ﷺ) forbade selling or giving away the right to inheritance by a manumitted slave.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 2921,
      "title": "Sunan Abi Dawud 2920",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: When an infant has raised its voice (and then dies), it will be treated as an heir.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 2922,
      "title": "Sunan Abi Dawud 2921",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "To those also, to whom your right hand was pledged, give their due portion. A man made an agreement with another man (in early days of Islam), and there was no relationship between the ; one of them inherited from the other. The following verse of Surat Al-Anfal abrogated it: \"But kindred by blood have prior right against each other.\"",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 2923,
      "title": "Sunan Abi Dawud 2922",
      "narrator": "Ibn 'Abbas explained the following Qur'anic verse :",
      "english_text": "\"To those also, to whom your right hand was pledged, give your portion.\" When the Emigrants came to Medina. they inherited from the Helpers without any blood-relationship with them for the brotherhood which the Messenger of Allah (ﷺ) established between them. When the following verse was revealed: \"To (benefit) everyone we have appointed shares and heirs to property left by parent and relatives.\" it abrogated the verse: \"To those also, to whom your right hand was pledged, give their due portion.\" This alliance was made for help, well wishing and cooperation. Now a legacy can be made for him. (The right to)inheritance was abolished.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 2924,
      "title": "Sunan Abi Dawud 2923",
      "narrator": "Narrated Dawud b. al-Husain:",
      "english_text": "I used to learn the reading of the Qur'an from Umm Sa'd, daughter of al-Rabi'. She was an orphan in the guardianship of Abu Bakr. I read the Qur'anic verse \"To those also to whom your right hand was pledged.\" She said: Do not read the verse; \"To those also to whom your right hand was pledged.\" This was revealed about Abu Bakr and his son 'Abd al-Rahman when he refused to accept Islam. Abu Bakr took an oath that he would not give him a share from inheritance. When he embraced Islam Allah Most High commanded His Prophet (ﷺ) to give him the share.\n\n\nThe narrator 'Abd al-Aziz added: He did not accept Islam until he was urged on Islam by sword.\n\n\nAbu Dawud said: He who narrated the word 'aqadat means a pact ; and he who narrated the word 'aaqadat means the party who made a pact. The correct is the tradition of Talhah ('aaqadat).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 2925,
      "title": "Sunan Abi Dawud 2924",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "Referring to the verse: \"Those who believed and adopted exile... As to those who believed but came not into exile\": A bedouin (who did not migrate to Medina) did not inherit from an emigrant, and an emigrant did no inherit from him. It was abrogated by the verse: \"But kindred by blood have prior rights against each other.\"",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 2926,
      "title": "Sunan Abi Dawud 2925",
      "narrator": "Narrated Jubair b. Mu'tim:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: There is no alliance in Islam, and Islam strengthened the alliance made during pre-Islamic days.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 2927,
      "title": "Sunan Abi Dawud 2926",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The Messenger of Allah (ﷺ) established an alliance (of brotherhood) between the Emigrants and the Helpers in our house. He was asked: Did not the Messenger of Allah (ﷺ) say: There is no alliance in Islam ? He replied: The Messenger of Allah (ﷺ) established an alliance between the Emigrants and the Helpers in our house. This he said twice or thrice.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 2928,
      "title": "Sunan Abi Dawud 2927",
      "narrator": "Narrated Umar ibn al-Khattab:",
      "english_text": "Sa'id said: Umar ibn al-Khattab said: Blood-money is meant for the clan of the slain, and she will not inherit from the blood-money of her husband. Ad-Dahhak ibn Sufyan said: The Messenger of Allah (ﷺ) wrote to me that I should give a share to the wife of Ashyam ad-Dubabi from the blood-money of her husband. So Umar withdrew his opinion. \n\n\n\n\n\nAhmad ibn Salih said: AbdurRazzaq transmitted this tradition to us from Ma'mar, from az-Zuhri on the authority of Sa'id. In this version he said: The Prophet (ﷺ) made him governor over the bedouins.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}