{
  "chapterNum": 26,
  "english_title": "Knowledge (Kitab Al-Ilm)",
  "totalHadiths_inChapter": 28,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 3642,
      "title": "Sunan Abi Dawud 3641",
      "narrator": "Narrated Kathir ibn Qays:",
      "english_text": "Kathir ibn Qays said: I was sitting with AbudDarda' in the mosque of Damascus.  \n\n\n\n\n\nA man came to him and said: AbudDarda, I have come to you from the town of the Messenger of Allah (ﷺ) for a tradition that I have heard you relate from the Messenger of Allah (ﷺ). I have come for no other purpose.  \n\n\n\n\n\nHe said: I heard the Messenger of Allah (ﷺ) say: If anyone travels on a road in search of knowledge, Allah will cause him to travel on one of the roads of Paradise. The angels will lower their wings in their great pleasure with one who seeks knowledge, the inhabitants of the heavens and the Earth and the fish in the deep waters will ask forgiveness for the learned man. The superiority of the learned man over the devout is like that of the moon, on the night when it is full, over the rest of the stars. The learned are the heirs of the Prophets, and the Prophets leave neither dinar nor dirham, leaving only knowledge, and he who takes it takes an abundant portion.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 3643,
      "title": "Sunan Abi Dawud 3642",
      "narrator": "",
      "english_text": "The tradition mentioned above has also been transmitted by Abu al-Darda through a different chain of narrators to the same effect from the Holy Prophet (ﷺ)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 3644,
      "title": "Sunan Abi Dawud 3643",
      "narrator": "Abu Hurairah reported the Prophet (ﷺ) as saying:",
      "english_text": "If anyone pursues a path in search of knowledge, Allah will thereby make easy for him a path to paradise; and he who is made slow by his actions will not be speeded by his genealogy.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 3645,
      "title": "Sunan Abi Dawud 3644",
      "narrator": "Narrated AbuNamlah al-Ansari:",
      "english_text": "When he was sitting with the Messenger of Allah (ﷺ) and a Jew was also with him, a funeral passed by him. He (the Jew) asked (Him): Muhammad, does this funeral speak? The Prophet (ﷺ) said: Allah has more knowledge. The Jew said: It speaks. \n\n\n\n\n\nThe Messenger of Allah (ﷺ) said: Whatever the people of the Book tell you, do not verify them, nor falsify them, but say: We believe in Allah and His Apostle. If it is false, do not confirm it, and if it is right, do not falsify it.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 3646,
      "title": "Sunan Abi Dawud 3645",
      "narrator": "Narrated Zayd ibn Thabit:",
      "english_text": "The Messenger of Allah (ﷺ) ordered me (to learn the writing of the Jews), so I learnt for him the writing of the Jews. He said: I swear by Allah, I do not trust Jews in respect of writing for me. So I learnt it, and only a fortnight passed before I mastered it. I would write for him when he wrote (to them), and read to him when something was written to him.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 3647,
      "title": "Sunan Abi Dawud 3646",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "I used to write everything which I heard from the Messenger of Allah (ﷺ). I intended (by it) to memorise it. The Quraysh prohibited me saying: Do you write everything  that you hear from him while the Messenger of Allah (ﷺ) is a human being: he speaks in anger and pleasure? So I stopped writing, and mentioned it to the Messenger of Allah (ﷺ). He signalled with his finger to him mouth and said: Write, by Him in Whose hand my soul lies, only right comes out from it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 3648,
      "title": "Sunan Abi Dawud 3647",
      "narrator": "Narrated Al-Muttalib bin 'Abd Allah bin Hantab:",
      "english_text": "Al-Muttalib ibn Abdullah ibn Hantab said: Zayd ibn Thabit entered upon Mu'awiyah and asked him about a tradition. He ordered a man to write it. Zayd said: The Messenger of Allah (ﷺ) ordered us not to write any of his traditions. So he erased it.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 3649,
      "title": "Sunan Abi Dawud 3649",
      "narrator": "Abu Hurairah said :",
      "english_text": "When Mecca was conquered, the Holy Prophet (peace be upon him) stood up. He (Abu Hurairah) then mentioned the sermon of the Holy Prophet (ﷺ). He said: A man of the Yemen, who was called Abu Shah, got up and said: Messenger of Allah! Write it for me. He said: Write it for Abu Shah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 3650,
      "title": "Sunan Abi Dawud 3648",
      "narrator": "It was narrated that Abu Saeed Al-Khudri said:",
      "english_text": "\"We used not to write anything but the Tasha-hud and the Qur'an.\"",
      "grade": "Shadh (Al-Albani)  شاذ   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 3651,
      "title": "Sunan Abi Dawud 3650",
      "narrator": "Al-Walid said :",
      "english_text": "I asked Abu `Amr: What are they writing? He said: The sermon which he heard that day.",
      "grade": "Sahih Maqtu' (Al-Albani)  صحيح مقطوع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 3652,
      "title": "Sunan Abi Dawud 3651",
      "narrator": "`Abd Allah bin al-Zubair said on the authority of the father :",
      "english_text": "I asked al-Zubair : What prevents you from narrating traditions from the Messenger of Allah (ﷺ) as his Companions narrate from him? He said: By Allah I was very close to him. But I heard him (ﷺ) say: He who lies about me deliberately will certainly come to his abode in Hell.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 3653,
      "title": "Sunan Abi Dawud 3652",
      "narrator": "Narrated Jundub:",
      "english_text": "The Prophet (ﷺ) said: If anyone interprets the Book of Allah in the light of his opinion even if he is right, he has erred.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 3654,
      "title": "Sunan Abi Dawud 3653",
      "narrator": "",
      "english_text": "AbuSallam said on the authority of a man who served the Holy Prophet (ﷺ) that whenever he talked, he repeated it three times.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 3655,
      "title": "Sunan Abi Dawud 3654",
      "narrator": "`Urwah said:",
      "english_text": "Abu Hurairah sat beside the apartment of `A’ishah while she was praying. He then began to say: Listen, O lady of the apartment, saying it twice (in quick succession). When she finished her prayer, she said: Are you not surprised at him and the way he narrates traditions from the Apostle of the Allah (ﷺ). When the Apostle of the Allah (ﷺ) gave a talk, a man could count his words if he wished to count.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 3656,
      "title": "Sunan Abi Dawud 3655",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Are you not surprised at AbuHurayrah? He came and sat beside my apartment, and began to narrate traditions from the Messenger of Allah (ﷺ) making me hear them. I was saying supererogatory prayer. He got up (and went away) before I finished my prayer. Had I found him, I would have replied to him. The Messenger of Allah (ﷺ) did not narrate traditions quickly one after another as you narrate quickly.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 3657,
      "title": "Sunan Abi Dawud 3656",
      "narrator": "Narrated Mu'awiyah:",
      "english_text": "The Holy Prophet (ﷺ) forbade the discussion of thorny  questions.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 3658,
      "title": "Sunan Abi Dawud 3657",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone is given a legal decision ignorantly, the sin rests on the one who gave it. Sulayman al-Mahri added in his version: If anyone advises his brother, knowing that guidance lies in another direction, he has deceived him. These are the wordings of Sulayman.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 3659,
      "title": "Sunan Abi Dawud 3658",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: He who is asked something he knows and conceals it will have a bridle of fire put on him on the Day of Resurrection.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 3660,
      "title": "Sunan Abi Dawud 3659",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: You hear (from me), and others will hear from you; and people will hear from them who heard from you.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 3661,
      "title": "Sunan Abi Dawud 3660",
      "narrator": "Narrated Zayd ibn Thabit:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: May Allah brighten a man who hears a tradition from us, gets it by heart and passes it on to others. Many a bearer of knowledge conveys it to one who is more versed than he is; and many a bearer of knowledge is not versed in it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 3662,
      "title": "Sunan Abi Dawud 3661",
      "narrator": "Sahl b. Sa’d reported the prophet (ﷺ) as saying:",
      "english_text": "I swear on Allah, it will be better for you that Allah should give guidance to one man through your agency than that you should acquire the red ones among the camels.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 3663,
      "title": "Sunan Abi Dawud 3662",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: relate traditions from the children of Isra'il; there is no harm.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 3664,
      "title": "Sunan Abi Dawud 3663",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Prophet (ﷺ) used to relate to us traditions from the children of Isra'il till morning came; he would not get up except for obligatory prayer.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 3665,
      "title": "Sunan Abi Dawud 3664",
      "narrator": "Narrated Abu Hurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone acquires knowledge that should be sought seeking the Face of Allah, but he acquires it only to get some worldly advantage, he will not experience the arf, i.e. the fragrance, of Paradise.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 3666,
      "title": "Sunan Abi Dawud 3665",
      "narrator": "Narrated Awf ibn Malik al-Ashja'i:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: Only a ruler, or one put in charge, or one who is presumptuous, gives instructions.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 3667,
      "title": "Sunan Abi Dawud 3666",
      "narrator": "Narrated AbuSa'id al-Khudri:",
      "english_text": "I was sitting in the company of the poor members of the emigrants. Some of them were sitting together because of lack of clothing while a reader was reciting to us. All of a sudden the Messenger of Allah (ﷺ) came along and stood beside us. When the Messenger of Allah (ﷺ) stood, the reader stopped and greeted him.  \n\n\n\n\n\nHe asked: What were you doing?  We said: Messenger of Allah! We had a reader who was reciting to us and we were listening to the Book of Allah, the Exalted.  \n\n\n\n\n\nThe Messenger of Allah (ﷺ) then said: Praise be to Allah Who has put among my people those with whom I have been ordered to stay. The Messenger of Allah (ﷺ) then sat among us so as to be like one of us, and when he had made a sign with his hand they sat in a circle with their faces turned towards him.  \n\n\n\n\n\nThe narrator said: I think that the Messenger of Allah (ﷺ) did not recognize any of them except me.  \n\n\n\n\n\nThe Messenger of Allah (ﷺ) then said: Rejoice, you group of poor emigrants, in the announcement that you will have perfect light on the Day of Resurrection. You will enter Paradise half a day before the rich, and that is five hundred years.",
      "grade": "ضعيف إلا جملة دخول الجنة فصحيحة   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 3668,
      "title": "Sunan Abi Dawud 3667",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Prophet (ﷺ) said: That I sit in the company of the people who remember Allah the Exalted from morning prayer till the sun rises is dearer to me than that I emancipate four slaves from the children of Isma`il, and that I sit with the people who remember Allah from afternoon prayer till the sun sets is dearer to me than that I emancipate four slaves.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 3669,
      "title": "Sunan Abi Dawud 3668",
      "narrator": "`Abd  Allah (b. Mas`ud) said:",
      "english_text": "The Messenger of Allah (ﷺ) said to me: recite Surat al-Nisa’. I asked: Shall I recite to you  what was sent down to you? He replied: I like to here it from someone else. So I recited (it) until I reached this verse “How then shall it be when We bring from every people a witness?”. Then I raised my head and saw tears falling from his eyes.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}