{
  "chapterNum": 17,
  "english_title": "Game (Kitab Al-Said)",
  "totalHadiths_inChapter": 18,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 2845,
      "title": "Sunan Abi Dawud 2844",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Prophet (ﷺ) as saying: If anyone gets a dog, except a sheeping or hunting or a farm dog, a qirat of his reward will be deducted daily.",
      "grade": "صحيح ق وليس عند خ أو صيد إلا معلقا   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 2846,
      "title": "Sunan Abi Dawud 2845",
      "narrator": "Narrated Abdullah ibn Mughaffal:",
      "english_text": "The Prophet (ﷺ) said: Were dogs not a species of creature I should command that they all be killed; but kill every pure black one.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 2847,
      "title": "Sunan Abi Dawud 2846",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Prophet of Allah (ﷺ) ordered to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards he forbade to kill them, saying: Confine yourselves to the type which is black.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 2848,
      "title": "Sunan Abi Dawud 2847",
      "narrator": "Narrated 'Abi b. Hatim:",
      "english_text": "I asked the Prophet (ﷺ) ,and said: I set off my trained dogs, and they catch (something) for me: may I eat (it)? He said: When you set off trained dogs and mention Allah's name, eat what they catch for you. I said: Even if they killed (the game)? He said: Even if they killed (the game) as long as another dog does not join it. I said: I shoot with a featherless arrow, and it strikes the target, may I eat (it) ? He said: If you shoot with a featherless arrow and mention Allah's name, and it strikes the aim, and pierce it, eat it ; and if it strikes with its middle, do not eat (it).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 2849,
      "title": "Sunan Abi Dawud 2848",
      "narrator": "Narrated 'Adi b. Hatim:",
      "english_text": "I asked the Messenger of Allah. I said: We hunt with these dogs. He replied: When you set off your dog and mention Allah's name over it, eat what it catches for you, even if it kills it, except that the dog has eaten (any of it); if the dog has eaten (any of it), do not eat, for Im afraid it has caught it only for itself.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 2850,
      "title": "Sunan Abi Dawud 2849",
      "narrator": "Narrated 'Adi b. Hatim:",
      "english_text": "The Prophet (ﷺ) as saying: When you shoot your arrow and mention Allah's name, and you find it (the game) after a day, and you do not find it in water, and you find in it only the mark of you arrow, eat (it). But if another dog joins your dogs, do not eat it, for you do not know maybe the one which was not yours has killed it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 2851,
      "title": "Sunan Abi Dawud 2850",
      "narrator": "Narrated 'Adi b. Hatim:",
      "english_text": "The Prophet (ﷺ) as saying: When the animal at which you shot falls in water, is drowned, and dies, do not eat.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 2852,
      "title": "Sunan Abi Dawud 2851",
      "narrator": "Narrated Adi ibn Hatim:",
      "english_text": "The Prophet (ﷺ) said: Eat what ever is caught for you by a dog or a hawk you have trained and set off when you have mentioned Allah's name. I said: (Does this apply) if it killed (the animal)? He said: When it kills it without eating any of it, for it caught it only for you.\n\n\nAbu Dawud said: If a hawk eats any of it, there is no harm (in eating it). If a dog eats it, it is disapproved (to eat the meat). If it drinks blood, there is no harm (in eating it).",
      "grade": "صحيح إلا قوله أو باز فإنه منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 2853,
      "title": "Sunan Abi Dawud 2852",
      "narrator": "Narrated AbuTha'labah al-Khushani:",
      "english_text": "The Messenger of Allah (ﷺ) said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it),  even if it eats any of it; and eat what your hands return you.",
      "grade": "Munkar (Al-Albani)  منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 2854,
      "title": "Sunan Abi Dawud 2853",
      "narrator": "Narrated Adi ibn Hatim:",
      "english_text": "Messenger of Allah, one of us shoots at the game, and follows its mark for two or three days, and then finds it dead, and there is his arrow (pierced) in it, may he eat it? He said: Yes, if he wishes, or he said: he may eat if he wishes.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 2855,
      "title": "Sunan Abi Dawud 2854",
      "narrator": "Narrated 'Adi b. Hatim:",
      "english_text": "I asked Prophet (ﷺ) about featherless arrow. He said: If it strikes with its end, eat, and if it strikes with the middle part of it, do not eat, for it died by a violent blow. I said: I set off my dog? He replies: If you mention Allah's name, eat, otherwise do not eat. If it eats any of it, do not eat, for it caught for itself. He asked: I set off my dog, and I find with it another dog ? He replied: Do not eat, because you mentioned Allah's name on your dog.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 2856,
      "title": "Sunan Abi Dawud 2855",
      "narrator": "Narrated Abu Taa'labat b. al-Khushani:",
      "english_text": "I said: Messenger of Allah, I hunt with my trained dog, and with my untrained dog? He said: 'What you hunt with your trained dog, mention Allah's names (on it) and eat; and what you hunt with your untrained dog, and you find in a position that you slaughter it, then eat.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 2857,
      "title": "Sunan Abi Dawud 2856",
      "narrator": "Narrated AbuTha'labah al-Khushani:",
      "english_text": "The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  \n\n\n\n\n\nIbn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 2858,
      "title": "Sunan Abi Dawud 2857",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "There was a bedouin called AbuTha'labah. He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet (ﷺ) said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i.e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. \n\n\n\n\n\nHe asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.",
      "grade": "حسن لكن قوله وإن أكل منه منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 2859,
      "title": "Sunan Abi Dawud 2858",
      "narrator": "Narrated AbuWaqid:",
      "english_text": "The Prophet (ﷺ) said: Whatever is cut off of an animal when it is alive is dead.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 2860,
      "title": "Sunan Abi Dawud 2859",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: (the narrator Sufyan said: I do not know but that it [the tradition] has been transmitted from the Prophet (ﷺ): He who lives in the desert will become rude; he who pursues the game will be negligent, and he who visits a king will be perverted.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 2861,
      "title": "Sunan Abi Dawud 2860",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: He said: He who sticks to a king is perverted. This version adds: The nearer a servant (of Allah) goes to a king, the farther he keeps away from Allah.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 2862,
      "title": "Sunan Abi Dawud 2861",
      "narrator": "Narrated AbuTha'labah al-Khushani:",
      "english_text": "The Prophet (ﷺ) said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}