{
  "chapterNum": 36,
  "english_title": "Signet-Rings (Kitab Al-Khatam)",
  "totalHadiths_inChapter": 26,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 4215,
      "title": "Sunan Abi Dawud 4214",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The Messenger of Allah (ﷺ) wanted to write to some persian rulers. He was told that they would not read a letter without a seal in the form of a silver ring on which he engraved \"Muhammad the Messenger of Allah.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 4216,
      "title": "Sunan Abi Dawud 4215",
      "narrator": "The tradition mentioned above has also been transmitted by Anas through a different chain of narrators. This version as transmitted by 'Isa b. Yunus adds:",
      "english_text": "It remained in his hand until he died, in the hand of 'Abu Bakr until he died, in the hand of 'Umar until he died, and in the hand of 'Uthman. When he was near a well, it fell down in it. He ordered to take it out, but it could not be found.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 4217,
      "title": "Sunan Abi Dawud 4216",
      "narrator": "Narrated Anas:",
      "english_text": "The signet-ring of the Prophet (ﷺ) was of silver with an Abyssinian stone.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 4218,
      "title": "Sunan Abi Dawud 4217",
      "narrator": "Narrated Anas:",
      "english_text": "The signet-ring of the Prophet (ﷺ) was all of silver as was also its stone.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 4219,
      "title": "Sunan Abi Dawud 4218",
      "narrator": "Narrated Ibn 'Umar:",
      "english_text": "The Messenger of Allah (ﷺ) took a signet-ring of gold, and put the stone next the palm of his hand. He engraved on it \"Muhammad, the Messenger of Allah\". The people then took signet-rings of gold. When he saw that they had taken them (like his ring) he threw it away and said: I shall never wear it. He then fashioned a silver ring and engraved on it \"Muhammad, the Messenger of Allah\". Then Abu Bakr wore it after him, then 'Umar wore it after Abu Bakr, and the 'Uthman wore it after 'Umar till it fell down in a well called Aris.\n\n\nAbu Dawud said: The people did not disagree on 'Uthman till the signet-rin fell down from his hand.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 4220,
      "title": "Sunan Abi Dawud 4219",
      "narrator": "The tradition mentioned above has also been transmitted by Ibn 'Umar through a different chain of narrators from the Prophet (ﷺ). This version adds:",
      "english_text": "He engraved on it \"Muhammad, the Messenger of Allah.\" and said: \"No one must engrave anything in the manner of this signet-ring of mine. He then transmitted the rest of the tradition.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 4221,
      "title": "Sunan Abi Dawud 4220",
      "narrator": "The tradition mentioned above has also been transmitted by Ibn 'Umar through different chain of narrators from the Prophet (ﷺ). This version adds:",
      "english_text": "They searched for it but could not find it. 'Uthman then fashioned a signet-ring and engraved on it \"Muhammad, the Messenger of Allah\". He used to wear it or stamp with it.",
      "grade": "ضعيف الإسناد منكر المتن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 4222,
      "title": "Sunan Abi Dawud 4221",
      "narrator": "Anas b. Malik said that he saw a silver signet-ring on the hand of the Prophet (ﷺ) only for a day. The people then fashioned and wore (rings). The Prophet (ﷺ) then threw it away and the people also threw (them.)\n\n\nAbu Dawud said:",
      "english_text": "Ziyad b. Sa'd, Shu'aib and Ibn Musafir transmitted it from al-Zuhri. 'Ali said in their versions: \"of silver\".",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 4223,
      "title": "Sunan Abi Dawud 4222",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "The Prophet of Allah (ﷺ) disliked ten things: Yellow colouring, meaning khaluq, dyeing grey hair, trailing the lower garment, wearing a gold signet-ring, a woman decking herself before people who are not within the prohibited degrees, throwing dice, using spells except with the Mu'awwidhatan, wearing amulets, withdrawing the penis before the semen is discharged, in the case of a woman who is wife or not a wife, and having intercourse with a woman who is suckling a child; but he did not declare them to be prohibited.\n\n\nAbu Dawud said: Only the transmitters of Basrah have transmitted this tradition.",
      "grade": "Munkar (Al-Albani)  منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 4224,
      "title": "Sunan Abi Dawud 4223",
      "narrator": "Narrated Buraydah ibn al-Hasib:",
      "english_text": "A man came to the Prophet (ﷺ) and he was wearing a signet-ring of yellow copper. He said to him: How is it that I notice the odour of idols in you? So he threw it away, and came wearing an iron signet ring. He (the Prophet) said: What is it that I see you wearing the adornment of the inhabitants of Hell? So he threw it away. He asked: Messenger of Allah, what material I must use? He said: Make it of silver, but do not weigh it as much as a mithqal,\n\n\nThe narrator Muhammad did not say: \" 'Abd Allah b. Muslim,\" and al-Hasan did not say: \"al-Sulami al-Marwazi.\"",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 4225,
      "title": "Sunan Abi Dawud 4224",
      "narrator": "Iyas b. al-Harith b. al-Mu'aiqib quoting his grandfather said and his grandfather from his mother's side was Abu Dhubab:",
      "english_text": "The signet-ring of the Prophet (ﷺ) was of iron polished with silver. Sometimes it remained in my possession. Al-Mu'ayqib was in charge of the signet-ring of the Prophet (ﷺ).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 4226,
      "title": "Sunan Abi Dawud 4225",
      "narrator": "Narrated Ali:",
      "english_text": "The Messenger of Allah (ﷺ) said to me: Say: O Allah, guide me, and set me right. Remember by guidance (hidayah) the showing of the straight path, and remember by setting right (sadad) the setting right of an arrow. Then pointing to the middle finger and the one next to it, he said: He forbade me to wear a signet-ring on this finger of mine or on this (Asim was doubtful). He forbade me to wear qassiyyah (qasi garments) and mitharah. Abu Burdah said: We asked 'Ali: What is qasiyyah ? He said: These are garments imported to us from Syria or Egypt. They are stripped and marked like citrons. And mitharah was a thing made by women for their husbands.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 4227,
      "title": "Sunan Abi Dawud 4226",
      "narrator": "Narrated Ali ibn AbuTalib:",
      "english_text": "The Prophet (ﷺ) used to wear the signet-ring on his right hand.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 4228,
      "title": "Sunan Abi Dawud 4227",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) used to wear the signet-ring on his left hand, and put its stone next the palm of his hand.\n\n\n\nAbu Dawud said: Ibn Ishaq and Usamah b. Zaid transmitted from Nafi': \"On his right hand\".",
      "grade": "شاذ والمحفوظ في يمينه   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 4229,
      "title": "Sunan Abi Dawud 4228",
      "narrator": "",
      "english_text": "Nafi' said that Ibn 'Umar used to wear his signet-ring on his left hand.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 4230,
      "title": "Sunan Abi Dawud 4229",
      "narrator": "Muhammad ibn Ishaq said:",
      "english_text": "I saw as-Salt ibn Abdullah ibn Nawfal ibn AbdulMuttalib wearing the signet-ring on his right small finger. I asked: What is this? He replied: I saw Ibn Abbas wearing his ring in this manner. He put its stone towards the upper part of his palm. Ibn Abbas also mentioned that the Messenger of Allah (ﷺ) used to wear his signet-ring in his manner.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 4231,
      "title": "Sunan Abi Dawud 4230",
      "narrator": "Ibn az-Zubayr told that a woman client of theirs took az-Zubayr's daughter to Umar ibn al-Khattab wearing bells on her legs. Umar cut them off and said that he had heard the Messenger of Allah (ﷺ) say:",
      "english_text": "There is a devil along with each bell.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 4232,
      "title": "Sunan Abi Dawud 4231",
      "narrator": "Bunanah, female client of 'Abd al-Rahman b. Hayyan al-Ansari told that when she was with 'Aishah a girl wearing little tinkling bells was brought in to her. She ordered that they were not to bring her in where she was unless they cut off her little bells. She said:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: The angels do not enter a house in which there is a bell.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 4233,
      "title": "Sunan Abi Dawud 4232",
      "narrator": "",
      "english_text": "AbdurRahman ibn Tarafah said that his grandfather Arfajah ibn As'ad who had his nose cut off at the battle of al-Kilab got a silver nose, but it developed a stench, so the Prophet (ﷺ) ordered him to get a gold nose.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 4234,
      "title": "Sunan Abi Dawud 4233",
      "narrator": "The tradition mentioned above (No. 4220) has also been transmitted by Arfajah ibn As'ad through a different chain to the same effect. \n\n\n\n\n\nYazid said:",
      "english_text": "I asked AbulAshhab: Did AbdurRahman ibn Tarafah meet his grandfather Arfajah? He replied: Yes.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 4235,
      "title": "Sunan Abi Dawud 4234",
      "narrator": "",
      "english_text": "The tradition mentioned above has also been transmitted by 'Arfajah through a different chain of narrators to the same effect.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 4236,
      "title": "Sunan Abi Dawud 4235",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Prophet (ﷺ) got some ornaments presented by Negus as a gift to him. They contained a gold ring with an Abyssinian stone. The Messenger of Allah (ﷺ) turning his attention from it took it by means of a stick or his finger, then called Umamah, daughter of Abul'As and daughter of his daughter Zaynab, and said: Wear it, my dear daughter.",
      "grade": "Hasan in chain (Al-Albani)  حسن الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 4237,
      "title": "Sunan Abi Dawud 4236",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone wants to put a ring of fire on one he loves, let him put a gold ring on him: if anyone wants to put a necklace of fire on one he loves, let him put a gold necklace on him, and if anyone wants to put a bracelet of fire on one he loves let him put a gold bracelet on him. Keep to silver and amuse yourselves with it.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 4238,
      "title": "Sunan Abi Dawud 4237",
      "narrator": "Narrated A sister of Hudhayfah:",
      "english_text": "The Prophet (ﷺ) as saying : You women folk, have in silver something with which you adorn yourselves. I assure you that any woman of you who adorns herself with gold which she displays will be punished for it.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 4239,
      "title": "Sunan Abi Dawud 4238",
      "narrator": "Narrated Asma' daughter of Yazid:",
      "english_text": "The Prophet (ﷺ) as saying: Any woman who wears a gold necklace will have a similar one of fire put on her neck on the Day of Resurrection, and any woman who puts a gold earring in her ear will have a similar one of fire put in her ear on the Day of Resurrection.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 4240,
      "title": "Sunan Abi Dawud 4239",
      "narrator": "Narrated Mu'awiyah ibn AbuSufyan:",
      "english_text": "The Messenger of Allah (ﷺ) forbade to ride on panther skins and to wear gold except a little.\n\n\n\nAbu Dawud said: The narrator Abu Qilabah did not meet Mu'awiyah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}