{
  "chapterNum": 14,
  "english_title": "Fasting (Kitab Al-Siyam)",
  "totalHadiths_inChapter": 164,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 2314,
      "title": "Sunan Abi Dawud 2313",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "Ibn Abbas explained the following Qur'anic verse: \"O ye who believe! fasting is prescribed for you as it was prescribed for those before you\" During the lifetime of the Prophet (ﷺ), when the people offered night prayer, they were asked to abstain from food and drink and (intercourse with) women, they kept fast till the next night. A man betrayed himself and had intercourse with his wife after he had offered the night prayer, and he did not break his fast. So Allah, the Exalted, intended to make it (fasting) easy for those who survived,  thus providing a concession and utility. Allah, the Glorified, said: \"Allah knoweth what ye used to do secretly among yourselves.\" By this Allah benefited the people and provided concession and ease to them.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 2315,
      "title": "Sunan Abi Dawud 2314",
      "narrator": "",
      "english_text": "Al Bara’ (bin Azib) said “When a man fasted and slept, he could not eat till (another nigh) like it.” Sarmah bin Qais Al Ansari came to his wife while he was fasting and asked her Do you have something (to eat)? She replied “No”. Let me go and seek something for you. So, she went out and sleep overcame him. She came (back) and said (to him) .You are deprived (of food). He fainted before noon. He used to work all day long at his land. This was mentioned to the Prophet (ﷺ). So the following verse was revealed. “Permitted to you on the nights of the fasts, is the approach to your wives. They are your garments and ye are their garments. Allah knoweth what yes used to do secretly amongst yourselves. But he turned to you and forgave you. So now associate with them and seek what Allaah hath ordained for you. And eat and drink until the white thread of dawn appears to you. He recited up to the words “of dawn”.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 2316,
      "title": "Sunan Abi Dawud 2315",
      "narrator": "",
      "english_text": "Salamah bin Al Akwa said “After the revelation of the verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent, is one of us intended to leave fast and pay ransom, he could do so.” until the verse following it was revealed and abrogated the (previous) verse.”",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 2317,
      "title": "Sunan Abi Dawud 2316",
      "narrator": "",
      "english_text": "Ibn ‘Abbas explain the Qur’anic verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent” said “If one of them wished to pay ransom by providing food to an indigent person he could pay ransom.. Thus, his fast was complete. Allaah, the Exalted pronounced “But he that will give more of his own free will, it is better for him”. Again he pronounced “So every one of you who is present (at his home) during that month should spend it in fasting.” But, if anyone is ill or on a journey the prescribed period (should be made up) by days later.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 2318,
      "title": "Sunan Abi Dawud 2317",
      "narrator": "",
      "english_text": "Ibn ‘Abbas said “The verse concerning the payment of ransom stands valid for pregnant and sucking woman.”",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 2319,
      "title": "Sunan Abi Dawud 2318",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "Explaining the verse; \"For those who can do it (with hard-ship) is a ransom, the feeding of one, that is indigent,\" he said: This was a concession granted to the aged man and woman who were able to keep fast; they were allowed to leave the fast and instead feed an indigent person for each fast; (and a concession) to pregnant and suckling woman when they apprehended harm (to themselves).",
      "grade": "Shadh (Al-Albani)  شاذ   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 2320,
      "title": "Sunan Abi Dawud 2319",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The Prophet (ﷺ) said: The month consists of twenty-nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha'ban came, Ibn Umar would send someone (who tried) to sight the moon for him. If it was sighted, then well and good; in case it was not sighted, and there was no cloud and dust before him (on the horizon), he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn Umar would end his fasting alone with the people, and did not follow this calculation.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 2321,
      "title": "Sunan Abi Dawud 2320",
      "narrator": "",
      "english_text": "Ibn ‘Umar reported the Apostle of Allaah(ﷺ) as saying “The month consists of twenty nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha’ban came, Ibn ‘Umar would send someone (who tried) to sight the moon for him. If it was sighted then well and good, in case it was not sighted and there was no cloud and dust before him (on the horizon) he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn ‘Umar would end his fasting alone with the people and did not follow this calculation.”",
      "grade": "صحيح قد دون قوله فكان ابن عمر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 2322,
      "title": "Sunan Abi Dawud 2321",
      "narrator": "Narrated Ayyub :",
      "english_text": "'Umar b. 'Abd al-'Aziz wrote (a letter) to the people of Basrah: It has reached us from the Messenger of Allah (ﷺ), like the tradition narrated by Ibn 'Umar from the Prophet (ﷺ). This version adds: The best calculation is that when we sight the moon of Sha'ban on such-and-such date, fasting will being on such-and-such dates, Allah willing, except they they sight the moon before that (date).",
      "grade": "Sahih Maqtu' (Al-Albani)  صحيح مقطوع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 2323,
      "title": "Sunan Abi Dawud 2322",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "We kept fast for twenty-nine days along with the Prophet (ﷺ) more often than we kept fast for thirty days.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 2324,
      "title": "Sunan Abi Dawud 2323",
      "narrator": "Narrated Abu Bakrah:",
      "english_text": "The Prophet (ﷺ) as saying: The two months of 'Id (festival), Ramadan and Dhu al-Hijjah, are not defective.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 2325,
      "title": "Sunan Abi Dawud 2324",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: The end of Ramadan is on the day when you end it, and the 'Id (festival) of sacrifice is on the day when you sacrifice. The whole of Arafah is the place of staying, and the whole of Mina is the place of sacrifice, and all the roads of Mecca are the place of sacrifice, and the whole of Muzdalifah is the place of staying.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 2326,
      "title": "Sunan Abi Dawud 2325",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) used to count the days in Sha'ban in a manner he did not count any other month; then he fasted when he sighted the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 2327,
      "title": "Sunan Abi Dawud 2326",
      "narrator": "Narrated Hudhayfah:",
      "english_text": "The Prophet (ﷺ) said: Do not fast (for Ramadan) before the coming of the month until you sight the moon or complete the number (of thirty days); then fast until you sight the moon or complete the number (of thirty days).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 2328,
      "title": "Sunan Abi Dawud 2327",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: Do not fast one day or two days just before Ramadan except in the case of a man who has been in the habit or observing a fast (on that day); and do not fast until you sight it (the moon). Then fast until you sight it. If a cloud appears on that day (i.e. 29th of Ramadan) then complete the number thirty (days) and then end the fasting: a month consists of twenty-nine days.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 2329,
      "title": "Sunan Abi Dawud 2328",
      "narrator": "Narrated 'Imran bin Husain:",
      "english_text": "The Messenger of Allah (ﷺ) asked a man: Did you fast the last day of Sha'ban ? He replied: No. He said: If you did not observe a fast, you must fast for a day. One of the two narrators said: For two days.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 2330,
      "title": "Sunan Abi Dawud 2329",
      "narrator": "Narrated Mu'awiyah:",
      "english_text": "AbulAzhar al-Mughirah ibn Farwah said: Mu'awiyah stood among the people at Dayr Mustahill lying at the gate of Hims. He said: O people, we sighted the moon on such-and-such day. We shall fast in advance. Anyone who likes to do so may do it. Malik ibn Hubayrah as-Saba'i stood up and asked: Mu'awiyah, did you hear the Messenger of Allah (ﷺ) say something (about this matter), or is this something on the basis of your opinion? He replied: I heard the Messenger of Allah (ﷺ) as saying: Fast the month (in the beginning) and in the last.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 2331,
      "title": "Sunan Abi Dawud 2330",
      "narrator": "Sulaiman b. 'Abd al-Rahman al-Dimashqi said about this tradition that al-Walid said:",
      "english_text": "I heard Abu 'Amr al-Auza'i say: The word sirrahu means beginning of the month.",
      "grade": "Shadh Maqtu' (Al-Albani)  شاذ مقطوع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 2332,
      "title": "Sunan Abi Dawud 2331",
      "narrator": "Narrated Ahmad b. 'Abd al-Wahid:",
      "english_text": "On the authority of Abu Mushir. He said: Sa'id, that is, Ibn 'Abd al-'Aziz said: The meaning of the word sirraha is \"in the beginning of it (the month)\"",
      "grade": "Shadh (Al-Albani)  شاذ   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 2333,
      "title": "Sunan Abi Dawud 2332",
      "narrator": "Narrated Kuraib:",
      "english_text": "That Umm al-Fadl, daughter of al-Harith, sent him to Mu'aqiyah in Syria. He said: I came to syria and performed her work. The moon of Ramadan appeared while I was in Syria. We sighted the moon on the night of Friday. When I came to Median towards the end of the month (of Ramadan), Ibn 'Abbas asked me about the moon. He said: When did you sight the moon ? I said: I sighted it on the night of Friday. He asked: Did you sight it yourself ? I said: Yes, and the people sighted it. They fasted and Mu'awiyah also fasted. He said: But we sighted it on the night of saturday. Since then we have been fasting until we complete thirty days or we sight it. Then I said: Are the sighting of the moon by Mu'awiyah and his fasts not sufficient for us? He replied: No. The Messenger of Allah (ﷺ) commanded us to do so.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 2334,
      "title": "Sunan Abi Dawud 2333",
      "narrator": "Al-Hasan said about a person who was in a certain city. He fasted on Monday, and twp persons bore witness that they had sighted the moon on the night of sunday. He said:",
      "english_text": "That man and the people of his city should not fast as an atonement except that they know (for certain) that the people of a certain city of Muslims had fasted on Sunday. In that case they should keep fast as an atonement.",
      "grade": "Sahih Maqtu' (Al-Albani)  صحيح مقطوع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 2335,
      "title": "Sunan Abi Dawud 2334",
      "narrator": "Narrated Ammar:",
      "english_text": "AbuIshaq reported on the authority of Silah: We were with Ammar on the day when the appearance of the moon was doubtful. (The meat of) goat was brought to him. Some people kept aloof from (eating) it. Ammar said: He who keeps fast on this day disobeys AbulQasim (i.e. the Prophet) (ﷺ).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 2336,
      "title": "Sunan Abi Dawud 2335",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: Do not fast one day or two days just before Ramadan, except in the case of a man who has been in the habit of observing the particular fast, for he may fast on that day.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 2337,
      "title": "Sunan Abi Dawud 2336",
      "narrator": "Narrated Umm Salamah, Ummul Mu'minin:",
      "english_text": "She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 2338,
      "title": "Sunan Abi Dawud 2337",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "AbdulAziz ibn  Muhammad said: Abbad ibn Kathir came to Medina and went to the assembly of al-Ala'. He caught hold of his hand and made him stand and said: O Allah, he narrates a tradition from his father on the authority of AbuHurayrah who reported the Messenger of Allah (ﷺ) as saying: When the middle of Sha'ban comes, do not fast. Al-Ala' said: O Allah, my father narrated this tradition on the authority of AbuHurayrah from the Prophet (ﷺ)",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 2339,
      "title": "Sunan Abi Dawud 2338",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "Husayn ibn al-Harith al-Jadli from the tribe of Jadilah Qays said: The governor of Mecca delivered a speech and said: The Messenger of Allah (ﷺ) took a pledge from us that we should perform the rites of hajj after sighting the moon. If we do not sight it and two reliable persons bear witness, we should perform the rites of hajj on the basis of their witness.  \n\n\n\n\n\nI then asked al-Husayn ibn al-Harith: Who was the governor of Mecca?  He replied: I do not know. He then met me later on and told me: He was al-Harith ibn Hatib, brother of Muhammad ibn Hatib. The governor then said: There is among you a man who is more acquainted with Allah and His Apostle than I. He witnessed this from the Messenger of Allah (ﷺ). He then pointed with his hand to a man. Al-Husayn said: I asked an old man beside me: Who is that man to whom the governor has alluded?  \n\n\n\n\n\nHe said: \"This is Abdullah ibn Umar, and he spoke the truth. He was more acquainted with Allah than he. He (Abdullah ibn Umar) said: For this is what the Messenger of Allah (ﷺ) commanded us (to do).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 2340,
      "title": "Sunan Abi Dawud 2339",
      "narrator": "Narrated Rib'i b. Hirash:",
      "english_text": "On the authority of a man from the Companions of the Prophet (ﷺ): People differed among themselves on the last day of Ramadan (about the appearance of the moon of Shawwal). Then two bedouins came and witnessed before the Prophet (ﷺ) swearing by Allah that they had sighted moon the previous evening. So the Messenger of Allah (ﷺ) commanded the people to break the fast. The narrator Khalaf has added in his version: \"and that they should proceed to the place of prayer (for 'Id)\".",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 2341,
      "title": "Sunan Abi Dawud 2340",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 2342,
      "title": "Sunan Abi Dawud 2341",
      "narrator": "Narrated Ikrimah:",
      "english_text": "Once the people doubted the appearance of the moon of Ramadan, and intended neither to offer the tarawih prayer nor to keep fast. A bedouin came from al-Harrah and testified that he had sighted the moon. He was brought to the Prophet (ﷺ). He asked: Do you testify that there is no god but Allah, and that I am the Messenger of Allah? He said: Yes; and he testified that he had sighted the moon. He commanded Bilal who announced to the people to offer the tarawih prayer and to keep fast.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 2343,
      "title": "Sunan Abi Dawud 2342",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The people looked for the moon, so I informed the Messenger of Allah (ﷺ) that I had sighted it. He fasted and commanded the people to fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 2344,
      "title": "Sunan Abi Dawud 2343",
      "narrator": "Narrated 'Amr b. al-'As:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 2345,
      "title": "Sunan Abi Dawud 2344",
      "narrator": "Narrated Al-Irbad ibn Sariyyah:",
      "english_text": "The Messenger of Allah (ﷺ) invited me to a meal shortly before dawn in Ramadan saying: Come to the blessed morning meal.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 2346,
      "title": "Sunan Abi Dawud 2345",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Prophet (ﷺ) as saying: How good is the believers meal of dates shortly before dawn.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 2347,
      "title": "Sunan Abi Dawud 2346",
      "narrator": "Addressing (the people) Samurah b. Jundub reported the Messenger of Allah (ﷺ) as saying:",
      "english_text": "The adhan (call to prayer) of Bilal should not prevent you from taking a meal shortly before dawn, not does the whiteness of horizon (before dawn) in this way (vertically) until it spreads out horizontally.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 2348,
      "title": "Sunan Abi Dawud 2347",
      "narrator": "Narrated 'Abd Allah b. Mas'ud:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: The summons (adhan) of Bilal should not restrain one of you from taking a meal shortly before dawn, for he utters adhan or calls (for prayer) so that the man at prayer may return, and the man asleep may get up. Dawn is not (the whiteness) which indicates thus (in perpendicular) - the narrator Musaddad said: Yahya joined his palms (indicating the spread of whiteness vertically - until it indicates thus - and Yahya spread out two ring-fingers of his (demonstrating the spread of whiteness horizontally)l",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 2349,
      "title": "Sunan Abi Dawud 2348",
      "narrator": "Narrated Talq ibn Ali al-Yamami:",
      "english_text": "The Messenger of Allah (ﷺ) said: Eat and drink; let not the white and ascending light prevent you from (eating and drinking); so eat and drink until the red light spreads horizontally.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 2350,
      "title": "Sunan Abi Dawud 2349",
      "narrator": "Narrated 'Adi b. Hatim:",
      "english_text": "When the verse \"Until the white thread of dawn appear to you distinct from its black thread\" was revealed, I took a white rope and a black rope, and placed them beneath my pillow ; and then I looked at them, byt they were not clear to me. So I mentioned it to the Messenger of Allah (ﷺ). He laughed and said: Your pillow is so broad and lengthy ; that is (i.e. means) night and day. The version of the narrator 'Uthman has: That is the blackness of night and whiteness of day.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 2351,
      "title": "Sunan Abi Dawud 2350",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: When any of you hears the summons to prayer while he has a vessel in his hand, he should not lay it down till he fulfils his need.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 2352,
      "title": "Sunan Abi Dawud 2351",
      "narrator": "Narrated 'Umar:",
      "english_text": "The Prophet (ﷺ) as saying: When the night approaches from this side and the day retreats on that side, and the sun sets  - according to the version of Musaddad - he who fasts has reached the time to break it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 2353,
      "title": "Sunan Abi Dawud 2352",
      "narrator": "Narrated 'Abd Allah b. Abi Awfa:",
      "english_text": "We went along with the Messenger of Allah (ﷺ) while he was fasting. When the sun set, he said to Bilal: Bilal, come down and prepare barley beverage for us. He said: Messenger of Allah, would  that you waited for the evening. He said: Come down and prepare barley beverage for us. He said: Messenger of Allah, the say still remains on you (i.e. there remains the brightness of the day). He said: Come down and prepare barley drink for us. So he came down and prepared barley drink. The Messenger of Allah (ﷺ) drank it and said: When you see that the night approaches from this side, he who fasts has reached the time to break it ; and he pointed to the east with his finger.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 2354,
      "title": "Sunan Abi Dawud 2353",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: Religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 2355,
      "title": "Sunan Abi Dawud 2354",
      "narrator": "Narrated Abu 'Atiyyah:",
      "english_text": "I and Masruq entered upon 'Aishah and we said: Mother of believers, there are two persons from the Companions of the Muhammad (ﷺ). One of them hastens to break the fast and hastens to pray while the other delays to break the fast and delays praying. She asked: Which of them hastens to break the fast and hasten to pray ? We replied: 'Abd Allah (b. Mas'ud). She said: Thus did the Messenger of Allah (ﷺ) do.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 2356,
      "title": "Sunan Abi Dawud 2355",
      "narrator": "Narrated Salman ibn Amir:",
      "english_text": "The Prophet (ﷺ) said: When one of you is fasting, he should break his fast with dates; but if he cannot get any, then (he should break his fast) with water, for water is purifying.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 2357,
      "title": "Sunan Abi Dawud 2356",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Messenger of Allah (ﷺ) used to break his fast before praying with some fresh dates; but if there were no fresh dates, he had a few dry dates, and if there were no dry dates, he took some mouthfuls of water.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 2358,
      "title": "Sunan Abi Dawud 2357",
      "narrator": "Marwan ibn Salim al-Muqaffa' said:",
      "english_text": "I saw Ibn Umar holding his beard with his hand and cutting what exceeded the handful of it. He (Ibn Umar) said that the Prophet (ﷺ) said when he broke his fast: Thirst has gone, the arteries are moist, and the reward is sure, if Allah wills.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 2359,
      "title": "Sunan Abi Dawud 2358",
      "narrator": "Narrated Mu'adh ibn Zuhrah:",
      "english_text": "The Prophet of Allah (ﷺ) used to say when he broke his fast: O Allah, for Thee I have fasted, and with Thy provision I have broken my fast.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 2360,
      "title": "Sunan Abi Dawud 2359",
      "narrator": "Narrated Asma' daughter of Abu Bakr :",
      "english_text": "We broke the fast one during Ramadan when it was cloudy in the lifetime of the Messenger of Allah (ﷺ) ; then the sun rose. Abu Usamah said: I said to Hisham: Were they commanded to atone for it ? He replied: That was inevitable.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 2361,
      "title": "Sunan Abi Dawud 2360",
      "narrator": "Narrated Ibn 'Umar:",
      "english_text": "The Messenger of Allah (ﷺ) prohibited perpetual fasting. They (the people) said: You keep perpetual fasting, Messenger of Allah. He said: My position is not like that you yours. I am provided with food and drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 2362,
      "title": "Sunan Abi Dawud 2361",
      "narrator": "Narrated Abu Sa'id al-Khudri:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: Do not observe perpetual fasting. If any of you wants to observe perpetual fast, he should observe it until the dawn. They (the people) asked: You observe perpetual fast ? He replied: My position is not like that of yours. There is One Who gives me to eat, and there is One who gives me to drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 2363,
      "title": "Sunan Abi Dawud 2362",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: If anyone does not abandon falsehood and action is accordance with it, Allah has no need that he should abandon his food and drink.\n\n\nThe narrator Ahmad (b. Yunus) said: I learnt the chain of narrators from Ibn Abi Dhi'b, and a man by his side made me understand the tradition. I think he was his cousin.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 2364,
      "title": "Sunan Abi Dawud 2363",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Prophet (ﷺ) as saying: Fast is a shield ; when one of you is fasting, he should neither behave in an obscene manner nor foolishly. If a man fights or abuses him, he should say: I am fasting, I am fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 2365,
      "title": "Sunan Abi Dawud 2364",
      "narrator": "Narrated Amir ibn Rabi'ah:",
      "english_text": "I have seen the Messenger of Allah (ﷺ) using a tooth-stick while he was fasting. Musaddad added in his version: \"more often than I could count.\"",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 2366,
      "title": "Sunan Abi Dawud 2365",
      "narrator": "Narrated A Companion of the Prophet:",
      "english_text": "AbuBakr ibn AbdurRahman reported on the authority of a Companion of the Prophet (ﷺ): I saw the Prophet (ﷺ) commanding the people while he was travelling on the occasion of the conquest of Mecca not to observe fast. He said: Be strong for your enemy. The Messenger of Allah (ﷺ) fasted himself.\n\n\n\n\n\n\nNarrated AbuBakr:\n\n\n\n\n\n\nA man who narrated his tradition to me said: I have seen the Messenger of Allah (ﷺ) in al-Arj pouring water over his head while he was fasting, either because of thirst or because of heat.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 2367,
      "title": "Sunan Abi Dawud 2366",
      "narrator": "Narrated Laqit ibn Saburah:",
      "english_text": "The Prophet (ﷺ) said: Snuff up water freely unless you are fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 2368,
      "title": "Sunan Abi Dawud 2367",
      "narrator": "Narrated Thawban:",
      "english_text": "The Prophet (ﷺ) said: A man who cupped and a man  who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 2369,
      "title": "Sunan Abi Dawud 2368",
      "narrator": "Narrated Shaddad ibn Aws:",
      "english_text": "The tradition mentioned above (No. 2361) has also been transmitted by Shaddad ibn Aws through a different chain of narrators. \n\n\n\n\n\nThis version adds: While Shaddad ibn Aws was walking along with the Prophet (ﷺ)....The narrator then transmitted the rest of the tradition to the same effect.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 2370,
      "title": "Sunan Abi Dawud 2369",
      "narrator": "Narrated Shaddad b. Aws:",
      "english_text": "The Messenger of Allah (ﷺ) came to a man at al-Baqi' while he was cupping on the 18th of Ramadan ; he (the Prophet) was holding my hand. Thereupon he said: A man who cups and a man who gets himself cupped break their fast.\n\n\nAbu Dawud said: The narrator Khalid al-Hadhdha' transmitted a similar tradition from Abu Qilabah through a different chain of narrators mentioned by the narrator Ayyub.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 2371,
      "title": "Sunan Abi Dawud 2370",
      "narrator": "Narrated Thawban, the client of the Prophet (ﷺ):",
      "english_text": "The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 2372,
      "title": "Sunan Abi Dawud 2371",
      "narrator": "Narrated Thawban:",
      "english_text": "The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.\n\n\nAbu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 2373,
      "title": "Sunan Abi Dawud 2372",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) had himself cupped when he was fasting.\n\n\nAbu Dawud said: Wuhaib b. Khalid narrated a similar tradition from Ayyub through a different chain of narrators. Ja'far b. Rabi'ah and Hisham, that is, Ibn Hassan, narrated a similar tradition from 'Ikrimah on the authority of Ibn 'Abbas.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 2374,
      "title": "Sunan Abi Dawud 2373",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) had himself cupped when he was fasting and wearing ihram (pilgrim garb).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 2375,
      "title": "Sunan Abi Dawud 2374",
      "narrator": "Narrated 'Abd al-Rahman b. Abi Laila:",
      "english_text": "A man from the Companions of the Prophet (ﷺ) told me that the Messenger of Allah (ﷺ) prohibited cupping and perpetual fasting, but he had not made them unlawful showing mercy on his Companions. Thereupon he was asked: Messenger of Allah, you observe perpetual fast till dawn. He replied: I observe perpetual fast till dawn (for) my Lord gives me food and drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 2376,
      "title": "Sunan Abi Dawud 2375",
      "narrator": "Narrated Anas:",
      "english_text": "We would not allow a man who was fasting to get himself cupped due to abomination of hardship.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 2377,
      "title": "Sunan Abi Dawud 2376",
      "narrator": "Narrated A man from the Companions:",
      "english_text": "The Messenger of Allah (ﷺ) said: Neither vomiting, nor emission, nor cupping breaks the fast of the one who is fasting.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 2378,
      "title": "Sunan Abi Dawud 2377",
      "narrator": "Narrated Ma'bad b. Hudhah:",
      "english_text": "The Prophet (ﷺ) commanded to apply collyrium mixed with musk at the time of sleep. He said: A man who is fasting should abstain from it.\n\n\nAbu Dawud said: Yahya b. Ma'in said to me: This tradition about the use of collyrium is munkar (i.e. contradicts the sound traditions on the subject).",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 2379,
      "title": "Sunan Abi Dawud 2378",
      "narrator": "",
      "english_text": "'Ubaid Allah b. Abu Bakr b. Anas reported on the authority of Anas b. Malik that he used to apply collyrium when he was fasting.",
      "grade": "Hasan Mauquf (Al-Albani)  حسن موقوف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 2380,
      "title": "Sunan Abi Dawud 2379",
      "narrator": "Al-A'mash said:",
      "english_text": "I did not see any of our companions who abominated the use of collyrium by a man who fasting. Ibrahim would permit the man who was fasting to apply collyrium with aloes.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 2381,
      "title": "Sunan Abi Dawud 2380",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: if one has a sudden attack of vomiting while one is fasting, no atonement is required of him, but if he vomits intentionally he must make atonement.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 2382,
      "title": "Sunan Abi Dawud 2381",
      "narrator": "Narrated Ma'dan b. Talhah:",
      "english_text": "That Abu ad-Darda' narrated to him: The Messenger of Allah (ﷺ) vomited and broke his fast. Then I met Thawban, the client of the Messenger of Allah (ﷺ), in the mosque in Damascus, I said (to him): Abu al-Darda has told me that the Messenger of Allah (ﷺ) vomited and broke his fast. He said: He spoke the truth ; and I poured out water for his ablution (ﷺ).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 2383,
      "title": "Sunan Abi Dawud 2382",
      "narrator": "Narrated 'Aishah:",
      "english_text": "The Messenger of Allah (ﷺ) used to kiss and embrace while he was fasting, but he was the one of you who had most control over his desire.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 2384,
      "title": "Sunan Abi Dawud 2383",
      "narrator": "Narrated 'Aishah:",
      "english_text": "The Prophet (ﷺ) used to kiss (me) during the month of fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 2385,
      "title": "Sunan Abi Dawud 2384",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) used to kiss me when he was fasting and when I was fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 2386,
      "title": "Sunan Abi Dawud 2385",
      "narrator": "Narrated Umar ibn al-Khattab:",
      "english_text": "I got excited, so I kissed while I was fasting, I then said: Messenger of Allah, I have done a big deed; I kissed while I was fasting. He said: What do you think if you rinse your mouth with water while you are fasting. The narrator Isa ibn Hammad said in his version: I said to him: There is no harm in it. Then both of them agreed on the version: He said: Then what?",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 2387,
      "title": "Sunan Abi Dawud 2386",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The Prophet (ﷺ) used to kiss her and suck her tongue when he was fasting.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 2388,
      "title": "Sunan Abi Dawud 2387",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "A man  asked the Prophet (ﷺ) whether one who was fasting could embrace (his wife) and he gave him permission; but when another man came to him, and asked him, he forbade him. The one to whom he gave permission was an old man and the one whom he forbade was a youth.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 2389,
      "title": "Sunan Abi Dawud 2388",
      "narrator": "Narrated 'Aishah and Umm Salamah, wives of the Prophet (ﷺ):",
      "english_text": "The Messenger of Allah (ﷺ) would be overtaken by the dawn when he was in a state of sexual defilement. The narrator 'Abd Allah al-Adhrami said in his version: During Ramadan, due to sexual intercourse and no owing to a dream (i.e. nocturnal emission), and would fast.\n\n\nAbu Dawud said: How brief is this sentence uttered by the narrator, this is, \"he was overtaken by daw when he was in the state of sexual defilement\"? The tradition says: The Prophet (ﷺ) was overtaken by dawn in the state of sexual defilement when he was fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 2390,
      "title": "Sunan Abi Dawud 2389",
      "narrator": "Narrated 'Aishah, wife of Prophet (ﷺ):",
      "english_text": "A man said to Messenger of Allah (ﷺ): Messenger of Allah, I was overtaken by dawn while I was sexually defiled, and I want to keep fast. The Messenger of Allah (ﷺ) said: I am also overtaken by dawn while I am in the state of sexual defilement ; I also want to keep fast. I take a bath and I keep fast. The man said: Messenger of Allah, you are not like us ; Allah has forgiven you your past and future sins. The Messenger of Allah (ﷺ) became angry and said: I swear by Allah, I hope I shall be the most fearful of you of Allah, and most familiar of you with what I follow.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 2391,
      "title": "Sunan Abi Dawud 2390",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "A man came to the Prophet (ﷺ) and said: I am undone. He asked him: What has happened to you ? He said: I had intercourse with my wife in Ramadan (while I was fasting). He asked: Can you set a slave free ? He said: No. He again asked: Can you fast for two consecutive months ? He said: No. He asked: Can you provide food for sixty poor people ? He said: No. He said: Sit down. Then a huge basket containing dates ('araq) was brought to the Prophet (ﷺ). He then said to him: Give it as sadaqah (i.e. alms). He said: Messenger of Allah, there is no poorer family than mine between the two lave plains of it (Medina). The Messenger of Allah (ﷺ) laughed so that his eye-teeth became visible, and said: Give it to your family to eat. Musaddad said in another place: \"his canine teeth\".",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 2392,
      "title": "Sunan Abi Dawud 2391",
      "narrator": "This tradition has also been transmitted by al-Zuhri through a different chain of narrators to the same effect. Al-Zuhri added in his version:",
      "english_text": "This was a special concession for him. If a man commits this act today, the expiation is necessary for him.\n\n\nAbu Dawud said: Al-Laith b. Sa'd, al-Awza'i, Mansur b. al-Mu'tamir and 'Irak b. Malik have narrated this tradition like the one narrated by Ibn 'Uyainah. Al-Awza'i narrated in his version the words: Beg pardon of Allah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 2393,
      "title": "Sunan Abi Dawud 2392",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "(A man broke his fast intentionally) during Ramadan. The Messenger of Allah (ﷺ) commanded him to emancipate a slave, or fast for two months, or feed sixty poor men. He said: I cannot provide. The Messenger of Allah (ﷺ) said: Sit down. Thereafter a huge basket of dates ('araq) was brought to the Messenger of Allah (ﷺ). He said: Take this and give it as sadaqah (alms). He said: Messenger of Allah, there is no poorer than I. The Messenger of Allah (ﷺ) thereupon laughed so that his canine teeth became visible and said: Eat it yourself.\n\n\nAbu Dawud said: Ibn Juraij narrated it from al-Zuhri in the wordings of the narrator Malik that a man broke his fast. This version says: You should either free a slave, or fast for two months, or provide food for sixty poor men.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 2394,
      "title": "Sunan Abi Dawud 2393",
      "narrator": "Abu Hurairah said:",
      "english_text": "A man came to the Prophet (ﷺ). He broke his fast during Ramadan. He then narrated the rest of this tradition adding: Then a huge basket containing fifteen sa's of dates was brought to him. He said: Eat it yourself and your family and keep one fast and beg pardon of Allah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 2395,
      "title": "Sunan Abi Dawud 2394",
      "narrator": "Narrated 'Aishah, wife of Prophet (ﷺ):",
      "english_text": "A man came to the Prophet (ﷺ) during Ramadan in the mosque. He said: Messenger of Allah, I am burnt. The Prophet (ﷺ) asked him what happened to him. He said: I had sexual intercourse with my wife. He said: Give sadaqah (alms). He said: I swear by Allah, I possess nothing with me, and I cannot do this. He said: Sit down. He sat down. While he was waiting, a man came forward driving his donkey loaded with food. The Messenger of Allah (ﷺ) said: Where is the man who was burnt just now ? Thereupon the man stood up. The Messenger of Allah (ﷺ) said: Give it as sadaqah (alms). He asked: Messenger of Allah, to others than us ? By Allah. we are hungry, we have nothing (to eat). He said: Eat it yourselves.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 2396,
      "title": "Sunan Abi Dawud 2395",
      "narrator": "The tradition mentioned above has also been transmitted by 'Aishah through a different chain of narrators. This version adds:",
      "english_text": "A huge basket containing twenty sa's (of dates) was brought.",
      "grade": "Munkar (Al-Albani)  منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 2397,
      "title": "Sunan Abi Dawud 2396",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone breaks his fast one day in Ramadan without a concession granted to him by Allah, a perpetual fast will not atone for it.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 2398,
      "title": "Sunan Abi Dawud 2397",
      "narrator": "The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators similar to the tradition narrated by Ibn Kathir and Sulaiman.\n\n\nAbu Dawud said:",
      "english_text": "Sufyan and Shu'bah differed among themselves on the name of the narrator Ibn al-Mutawwas and Abu al-Mutawwas.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 2399,
      "title": "Sunan Abi Dawud 2398",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "A man came to the Prophet (ﷺ) and said: Messenger of Allah, I ate and drank in forgetfulness when I was fasting. Hie said: Allah had fed you and given you drink.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 2400,
      "title": "Sunan Abi Dawud 2399",
      "narrator": "Narrated 'Aishah:",
      "english_text": "If I had some part of the fast of Ramadan to make up, I would not be able to atone for it except in Sha'ban.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 2401,
      "title": "Sunan Abi Dawud 2400",
      "narrator": "Narrated 'Aishah:",
      "english_text": "The Prophet (ﷺ) as saying: If anyone dies when some fast is due from him (i.e. which he could not keep) his heir must fast on his behalf.\n\n\nAbu Dawud said: This applies to the fast which a man vows ; and this is the opinion of Ahmad b. Hanbal.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 2402,
      "title": "Sunan Abi Dawud 2401",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "If a man falls ill during Ramadan and he dies, while he could not keep the fast, food will be provided (for the poor men) on his behalf ; there is no atonement (for his fasts) due from him. If there is some vow which he could not fulfill, his heir must atone on his behalf.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 2403,
      "title": "Sunan Abi Dawud 2402",
      "narrator": "Narrated 'Aishah:",
      "english_text": "Hamzat al-Aslami asked the Prophet (ﷺ): Messenger of Allah, I am a man who keeps perpetual fast, may I fast while on a journey? He replied: Fast if you like, or break your fast if you like.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 2404,
      "title": "Sunan Abi Dawud 2403",
      "narrator": "Narrated Hamzat al-Aslami:",
      "english_text": "I said: Messenger of Allah. I am a master of mounts and I use them ! I myself travel on them and I rent them. This month, that is, Ramadan, happend to come to me (while I am on a journey), and I find myself strong enough (to fast) as I am young, and I find that it is easier for me to fast than to postpone it, and i becomes debt due from me. Does it bring me more reward, Messenger of Allah, if I fast, or if I break ? He replied: Whichever you like, Hamzah.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 2405,
      "title": "Sunan Abi Dawud 2404",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "The Prophet (ﷺ) left Medina for Mecca till he reached 'Usfan, He then called for a vessel (of water). It was raised to his mouth to show it to the people, and that was in Ramadan. Ibn 'Abbas used to say: The Prophet (ﷺ) fasted and he broke his fast. He who likes may fast and he who likes may break.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 2406,
      "title": "Sunan Abi Dawud 2405",
      "narrator": "Narrated Anas :",
      "english_text": "We travelled along with the Prophet (ﷺ) during Ramadan. Some of us were fasting and other broke their fast. Those who fasted did not find fault with those who broke, and those who broke their fast did not find fault with those who fasted.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 2407,
      "title": "Sunan Abi Dawud 2406",
      "narrator": "Narrated Qaza'ah:",
      "english_text": "I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). \n\n\nAbu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 2408,
      "title": "Sunan Abi Dawud 2407",
      "narrator": "Narrated Jabir b. 'Abd Allah :",
      "english_text": "The Prophet (ﷺ) saw a man who had been put in the shade and saw a crowd of people around him (in the course of a journey). He said: Fasting while on journey is not part of righteousness.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 2409,
      "title": "Sunan Abi Dawud 2408",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "A man from Banu Abdullah ibn Ka'b brethren of Banu Qushayr (not Anas ibn Malik, the well-known Companion), said: A contingent from the cavalry of the Messenger of Allah (ﷺ) raided us. I reached (for he said went) to the Messenger of Allah (ﷺ) who was taking his meals. He said: Sit down, and take some from this meal of ours. I said: I am fasting, he said: Sit down, I shall tell you about prayer and fasting. Allah has remitted half the prayer to a traveller, and fasting to the traveller, the woman who is suckling an infant and the woman who is pregnant, I swear by Allah, he mentioned both (i.e. suckling and pregnant women) or one of them. I was grieved for not taking the food of the Messenger of Allah (ﷺ).",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 2410,
      "title": "Sunan Abi Dawud 2409",
      "narrator": "Narrated Abu al-Darda:",
      "english_text": "We went out along with the Messenger of Allah (ﷺ) for some battle in intense heat, so much so that one of us placed his hand on his head, or placed his palm on his head, due to intense heat, No one of us fasted except the Messenger of Allah (ﷺ) and 'Abd Allah b. Rawahah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 2411,
      "title": "Sunan Abi Dawud 2410",
      "narrator": "Narrated Salamah ibn al-Muhabbaq al-Hudhali:",
      "english_text": "The Messenger of Allah (ﷺ) said: If anyone has a riding beast which carries him to where he can get sufficient food, he should keep the fast of Ramadan wherever he is when it comes.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 2412,
      "title": "Sunan Abi Dawud 2411",
      "narrator": "Narrated Salamah b. al-Muhabbaq:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: If anyone is on a journey and Ramadan comes... He then narrated the rest of the tradition to the same effect.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 2413,
      "title": "Sunan Abi Dawud 2412",
      "narrator": "Narrated AbuBusrah al-Ghifari,:",
      "english_text": "Ja'far ibn Jubayr said: I accompanied AbuBusrah al-Ghifari, a Companion of the Messenger of Allah (ﷺ), in a boat proceeding from al-Fustat (Cairo) during Ramadan. He was lifted (to the boat), then his meal was brought to him. The narrator Ja'far said in his version: He did not go beyond the houses (of the city) but he called for the dining sheet. He said (to me): Come near. I said: Do you not see the houses? AbuBusrah said: Do you detest the sunnah (practice) of the Messenger of Allah (ﷺ)? The narrator Ja'far said in his version: He then ate (it).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 2414,
      "title": "Sunan Abi Dawud 2413",
      "narrator": "Narrated Dihyah:",
      "english_text": "Mansur al-Kalbi said: Dihyah ibn Khalifah once went out from a village of Damascus at as much distance as it measures between Aqabah and al-Fustat during Ramadan; and that is three miles. He then broke his fast and the people broke their fast along with him. But some of them disliked to break their fast. When he came back to his village, he said: I swear by Allah, today I witnessed a thing of which I could not even think to see. The people detested the way of the Messenger of Allah (ﷺ) and his Companions. He said this to those who fasted. At this moment he said: O Allah, make me die.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 2415,
      "title": "Sunan Abi Dawud 2414",
      "narrator": "Nafi' said:",
      "english_text": "Ibn 'Umar used to go out to al-Ghabah (jungle), but he neither broke his fast, nor shortened his prayer.",
      "grade": "Sahih Mauquf (Al-Albani)  صحيح موقوف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 2416,
      "title": "Sunan Abi Dawud 2415",
      "narrator": "Narrated AbuBakrah:",
      "english_text": "The Prophet (ﷺ) said: One of you should not say: I fasted the whole of Ramadan, and I prayed during the night in the whole of Ramadan. I do not know whether he disliked the purification; or he (the narrator) said: He must have slept a little and taken rest.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 2417,
      "title": "Sunan Abi Dawud 2416",
      "narrator": "Narrated Abu 'Ubaid:",
      "english_text": "I attended the 'Id (prayer) along with 'Umar. He offered prayer before the sermon. He then said: The Messenger of Allah (ﷺ) prohibited fasting on these two days. As regards Id al-Adha, you eat the meat of your sacrificial animals. As for 'Id al-Fitr, you break (i.e. end) your fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 2418,
      "title": "Sunan Abi Dawud 2417",
      "narrator": "Narrated Abu Sa’id Al Khudri :",
      "english_text": "The Messenger of Allah (ﷺ) forbade fasting on two days, al-Fitr (breaking the fast of Ramadan) and al-Adha (the day of sacrifice), and wearing a tight single garment the raising of which discloses private parts, and sitting with one's legs drawn up and wrapped in one's garment, and forbade praying at two hours, after the Fajr prayer and after the Asr prayer.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 2419,
      "title": "Sunan Abi Dawud 2418",
      "narrator": "Abu Murrah, the client of Umm Hani, entered along with 'Abd Allah b. 'Amr upon his father 'Amr b. 'As and he brought food for him. He said:",
      "english_text": "Eat. He said: I am fasting. 'Amr said: Eat, these are the days on which the Messenger of Allah (ﷺ) used to command us to break fast, and forbid us to keep fast. The narrator Malik said: These are the day of al-tashriq (i.e. 11th, 12th, and 13th of Dhu al-Hijjah).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 2420,
      "title": "Sunan Abi Dawud 2419",
      "narrator": "Narrated Uqbah ibn Amir:",
      "english_text": "The Prophet (ﷺ) said: The day of Arafah, the day of sacrifice, the days of tashriq are (the days of) our festival, O people of Islam. These are the days of eating and drinking.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 2421,
      "title": "Sunan Abi Dawud 2420",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: None of you must fast on Friday unless he fasts the day before or the day after.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 2422,
      "title": "Sunan Abi Dawud 2421",
      "narrator": "Narrated As-Samma' sister of Abdullah ibn Busr:",
      "english_text": "The Prophet (ﷺ) said: Do not fast on Saturday except what has been made obligatory on you; and if one of you can get nothing but a grape skin or a piece of wood from a tree, he should chew it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 2423,
      "title": "Sunan Abi Dawud 2422",
      "narrator": "Narrated Juwairiyah, daughter of al-Harith:",
      "english_text": "That the Prophet (ﷺ) entered upon her on Friday while she was fasting. He asked: Did you fast yesterday ? She said: No. He again asked: Do you intend to fast tomorrow ? She said: No. He said: So break your fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 2424,
      "title": "Sunan Abi Dawud 2423",
      "narrator": "Narrated Al-Laith:",
      "english_text": "When it was mentioned to Ibn Shihab (al-Zuhri) that fasting on Saturday had been prohibited, he would say: This is a Himsi tradition.",
      "grade": "مقطوع مرفوض   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 2425,
      "title": "Sunan Abi Dawud 2424",
      "narrator": "Al-Auza'i said:",
      "english_text": "I always concealed it, but I found that it became known widely, that is, the tradition on Ibn Busr about fasting on Saturday.\n\n\nAbu Dawud said: Malik said: This is a false (tradition).",
      "grade": "Sahih Maqtu' (Al-Albani)  صحيح مقطوع   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 2426,
      "title": "Sunan Abi Dawud 2425",
      "narrator": "Narrated AbuQatadah:",
      "english_text": "A man came to the Prophet (ﷺ) and said: How do you fast, Messenger of Allah? The Messenger of Allah (ﷺ) became angry at what he said.  \n\n\n\n\n\nWhen Umar observed this (his anger), he said: We are satisfied with Allah as Lord, with Islam as religion, and with Muhammad as Prophet. We seek refuge in Allah from the anger of Allah, and from the anger of His Apostle. Umar continued to repeat these words till his anger cooled down. He then asked: Messenger of Allah, what is the position of one who observes a perpetual fast?  \n\n\n\n\n\nHe replied: May he not fast or break his fast.  Musaddad said in his version: He has neither fasted nor broken his fast. The narrator, Ghaylan, doubted the actual wordings.  \n\n\n\n\n\nHe asked: What is the position of one who fasts two days and does not fast one day?  \n\n\n\n\n\nHe said: Is anyone able to do that?  He asked: What is the position of one who fasts every second day (i.e. fasts one day and does not fasts the next day)?  \n\n\n\n\n\nHe (the Prophet) said: This is the fast that David observed.  \n\n\n\n\n\nHe asked: Messenger of Allah, what is the position of one who fasts one day and breaks it for two days?  He replied: I wish I were given the power to observe that. Then the Messenger of Allah (ﷺ) said: The observance of three days' fast every month and of one Ramadan to the other (i.e. the fast of Ramadan every year) is (equivalent to) a perpetual fast. I seek from Allah that fasting on the day of Arafah may atone for the sins of the preceding and the coming year, and I seek from Allah that fasting on the day of Ashura' may atone for the sins of the preceding year.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 2427,
      "title": "Sunan Abi Dawud 2426",
      "narrator": "The tradition mentioned above has also been transmitted by Abu Qatadah through a different chain of narrators. This version add:",
      "english_text": "He said: Messenger of Allah, tell me about keeping fast on Monday and Thursday. He said: On it I was born, and on it the Qur'an was first revealed to me.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 2428,
      "title": "Sunan Abi Dawud 2427",
      "narrator": "Narrated 'Abd Allah b. 'Amr b. al-'As:",
      "english_text": "The Messenger of Allah (ﷺ) met me and said: Have I not been informed that you told: I shall stand at prayer all the night, and I shall fast during the day ? He said: I think so. Yes, Messenger of Allah, I have said this. He said: Get up and pray at night and sleep ; fast and break your fast ; fast three days every month: that is equivalent to keeping perpetual fast. I said: Messenger of Allah, I have more power than that. He said: Then fast one day and break your fast one day. That is the most moderate fast ; that is the fast of Dawud (David). He said: I have more power than that. The Messenger of Allah (ﷺ) said: There is no fast more excellent that it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 2429,
      "title": "Sunan Abi Dawud 2428",
      "narrator": "Narrated Abdullah ibn al-Harith ; or Uncle of Mujibah al-Bahiliyyah:",
      "english_text": "The father or Uncle of Mujibah al-Bahiliyyah visited the Messenger of Allah (ﷺ). He then went away and came to him (again) after one year when his condition and appearance had changed.  \n\n\n\n\n\nHe said: Messenger of Allah, do you not recognize me?  He asked: Who are you?  He replied: I am al-Bahili who came to you last year.  He said: What has changed you? You were looking well, then you were good in appearance?  He said: I have only food at night since I departed from you.  \n\n\n\n\n\nThereupon the Messenger of Allah (ﷺ) said: Why did you torment yourself? Fast during Ramadan (the month of patience) and fast for one day every month.  He said: Increase it for me, for I have (more) strength.  He said: Fast two days.  He again said: Increase it for me.  He said: Fast three days.  He again said: Increase it for me. He said: Fast during the inviolable months and then stop; fast during the inviolable months and then stop; fast during the inviolable months and then stop. He indicated by his three fingers, and joined them and then opened them.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 2430,
      "title": "Sunan Abi Dawud 2429",
      "narrator": "Narrated Abu Hurairah:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: The most excellent fast after Ramadan is Allah's month al-Muharram, and the most excellent prayer after the prescribed prayer is the prayer during night.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 2431,
      "title": "Sunan Abi Dawud 2430",
      "narrator": "Narrated 'Uthman b. Hakim:",
      "english_text": "I asked Sa'id b. Jubair about fasting during Rajab. He said: Ibn 'Abbas told me that the Messenger of Allah (ﷺ) used to fast to such an extent that we thought that he would never break his fast; and he would go without fasting to such an extent that we thought he would never fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 2432,
      "title": "Sunan Abi Dawud 2431",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The month most liked by the Messenger of Allah (ﷺ) for fasting was Sha'ban. He then joined it with Ramadan.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 2433,
      "title": "Sunan Abi Dawud 2432",
      "narrator": "Narrated Muslim al-Qurashi:",
      "english_text": "I asked or someone asked the Prophet (ﷺ) about perpetual fasting. He replied: You have a duty to your family. Fast during Ramadan and the following month, and every Wednesday and Thursday. You will then have observed a perpetual fast.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 2434,
      "title": "Sunan Abi Dawud 2433",
      "narrator": "Narrated Abu Ayyub:",
      "english_text": "The Prophet (ﷺ) as saying: If anyone fasts during Ramadan, then follows it with six days in Shawwal, it will be like a perpetual fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 2435,
      "title": "Sunan Abi Dawud 2434",
      "narrator": "Narrated 'Aishah, wife of Prophet (ﷺ):",
      "english_text": "The Messenger of Allah (ﷺ) used to fast to such an extent that we thought that he would never break his fast, and he would go without fasting to such an extent that we thought he would never fast. I never saw the Messenger of Allah (ﷺ) fast a complete month except in Ramadan, and I never saw his fast more in any month than in Sha'ban.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 2436,
      "title": "Sunan Abi Dawud 2435",
      "narrator": "The tradition mentioned above has alos been transmitted by Abu Hurairah through a different chain of narrators to the same effect. This version adds:",
      "english_text": "He would fast all but a little of Sha'ban, rather he used to fast the whole of Sha'ban.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 2437,
      "title": "Sunan Abi Dawud 2436",
      "narrator": "Narrated Usamah ibn Zayd:",
      "english_text": "The client of Usamah ibn Zayd said that he went along with Usamah to Wadi al-Qura in pursuit of his camels. He would fast on Monday and Thursday. His client said to him: Why do you fast on Monday and Thursday, while you are an old man? He said: The Prophet of Allah (ﷺ) used to fast on Monday and Thursday. When he was asked about it, he said: The works of the servants (of Allah) are presented (to Allah) on Monday and Thursday.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 2438,
      "title": "Sunan Abi Dawud 2437",
      "narrator": "Narrated One of the wives of the Prophet:",
      "english_text": "Hunaydah ibn Khalid narrated from his wife on the authority of one of the wives of the Prophet (ﷺ) who said: The Messenger of Allah (ﷺ) used to fast the first nine days of Dhul-Hijjah, Ashura' and three days of every month, that is, the first Monday (of the month) and Thursday.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 2439,
      "title": "Sunan Abi Dawud 2438",
      "narrator": "Narrated Ibn 'Abbas:",
      "english_text": "The Messenger of Allah (ﷺ) as saying: There is no virtue more to the liking of Allah in any day than in these days, that is, the first ten days of Dhu al-Hijjah. They (the Companions) asked: Messenger of Allah, not even the struggle in the path of Allah (Jihad) ? He said: (Yes), not even the struggle in the path of Allah, except a man who goes out (in the path of Allah) with his life and property, and does not return with any of them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 2440,
      "title": "Sunan Abi Dawud 2439",
      "narrator": "'Aishah said:",
      "english_text": "I never saw the Messenger of Allah (ﷺ) fasting during the first ten days of Dhu al-Hijjah.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 2441,
      "title": "Sunan Abi Dawud 2440",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "Ikrimah said: We were with AbuHurayrah in his house when he narrated to us: The Messenger of Allah (ﷺ) prohibited fasting on the day of Arafah at Arafah.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 2442,
      "title": "Sunan Abi Dawud 2441",
      "narrator": "Umm al-Fadl, daughter of al-Harith, said:",
      "english_text": "On the day of 'Arafah some people near her argued whether the Messenger of Allah (ﷺ) was fasting, some saying that he was, and others saying that he was not. I, therefore, sent him a cup of milk while he was observing the halt at 'Arafah on his camel, and he drank it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 2443,
      "title": "Sunan Abi Dawud 2442",
      "narrator": "'Aishah said:",
      "english_text": "The Quraish used to fast on the day of 'Ashurah in pre Islamic days. The Messenger of Allah (ﷺ) would fast on it in pre-Islamic period. When the Messenger of Allah (ﷺ) came to Medina, he fasted on it and commanded to fast on it. When the fast of Ramadan was prescribed, that became obligatory, and (fasting on) 'Ashurah was abandoned. He who wishes may fast on it and he who wishes may leave it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 2444,
      "title": "Sunan Abi Dawud 2443",
      "narrator": "Ibn 'Umar said:",
      "english_text": "'Ashurah was a day on which we used to fast in pre-Islamic days. When (fasting of) Ramadan was prescribed, the Messenger of Allah (ﷺ) said: This is one of the days of Allah ; he who wishes may fast on it.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 2445,
      "title": "Sunan Abi Dawud 2444",
      "narrator": "Ibn 'Abbas said:",
      "english_text": "When the Prophet (ﷺ) came to Medina, he found the Jews observing fast on the day of 'Ashurah; so they were asked about it (by the Prophet). They said: This is a day on which Allah gave Moses domination over Pharaoh. We fast on it out of reverence to him. The Messenger of Allah (ﷺ) said: We have a closer connection with Moses than you have. He then gave orders that it should be observed.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 2446,
      "title": "Sunan Abi Dawud 2445",
      "narrator": "Ibn 'Abbas said:",
      "english_text": "When the Prophet (ﷺ) on the day of 'Ashurah and commanded us to fast on it, they  (i.e. Companions) said: Messenger of Allah, this is a day which is considered great by Jews and Christians ? The Messenger of Allah (ﷺ) said: When the next year comes, we shall fast on the 9th of Muharram. But the next year the Messenger of Allah (ﷺ) breathed his last.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 2447,
      "title": "Sunan Abi Dawud 2446",
      "narrator": "Al-Hakam b. al-A'raj said:",
      "english_text": "I came to Ibn 'Abbas who was leaning against his sheet of cloth in the Sacred Mosque (al-Masjid al-Haram). I asked him about fasting on the day of 'Ashurah. He said: When you sight the moon of al-Muharram, count (the days). When the 9th of Muharram comes, fast from the morning. I said: Would Muhammad (ﷺ) observe this fast ? He replied: Thus Muhammad (ﷺ) used to fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 2448,
      "title": "Sunan Abi Dawud 2447",
      "narrator": "Narrated AbdurRahman ibn Maslamah:",
      "english_text": "AbdurRahman reported on the authority of his uncle that the people of the tribe Aslam came to the Prophet (ﷺ). He said (to them): Did you fast on this day? They replied: No. He said: Complete the rest of your day, and make atonement for it.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 2449,
      "title": "Sunan Abi Dawud 2448",
      "narrator": "'Abd Allah b. 'And (b. al-'As) said:",
      "english_text": "The Messenger of Allah (ﷺ) said to me: The fast most liked by Allah is the one observed by Dawud (David), and the prayer dearer to Allah is the one offered by Dawud (David): he would sleep half the night, and stand (in prayer) one-third of it, and sleep one-sixth of it. He would go without fasting one day, and fast the other day.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 2450,
      "title": "Sunan Abi Dawud 2449",
      "narrator": "Narrated Qatadah Ibn Malhan al-Qaysi:",
      "english_text": "The Messenger of Allah (ﷺ) used to command us to fast the days of the white (nights): thirteenth, fourteenth and fifteenth of the month. He said: This is like keeping perpetual fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 2451,
      "title": "Sunan Abi Dawud 2450",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "The Messenger of Allah (ﷺ) used to fast three days every month.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 2452,
      "title": "Sunan Abi Dawud 2451",
      "narrator": "Narrated Hafsah, Ummul Mu'minin:",
      "english_text": "The apostle of Allah (ﷺ) used to fast three days every month: Monday, Thursday and Monday in the next week.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 2453,
      "title": "Sunan Abi Dawud 2452",
      "narrator": "Narrated Umm Salamah, Ummul Mu'minin:",
      "english_text": "Hunaydah al-Khuza'i reported on the authority of her mother who said: I entered upon Umm Salamah and asked her about fasting. She said: The Messenger of Allah (ﷺ) used to command me to fast three days every month beginning with Monday or Thursday.",
      "grade": "Munkar (Al-Albani)  منكر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 2454,
      "title": "Sunan Abi Dawud 2453",
      "narrator": "Mu'adhah (al-'Adawiyyah) said:",
      "english_text": "I asked 'Aishah: Would the Messenger of Allah (ﷺ) fast three days every month ? She replied: Yes. I asked: Which days in the month he used to fast ? She replied: He did not care which days of the month he fasted.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 2455,
      "title": "Sunan Abi Dawud 2454",
      "narrator": "Narrated Hafsah, Ummul Mu'minin:",
      "english_text": "The Messenger of Allah (ﷺ) said: He who does not determine to fast before dawn does not fast.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 2456,
      "title": "Sunan Abi Dawud 2455",
      "narrator": "'Aishah said:",
      "english_text": "When the Prophet (ﷺ) entered upon me, he would ask: Do you have food ? When we said: No, he would say: I am fasting. Waki' added in his version: Another day when he entered upon us, we said: Messenger of Allah, some pudding (hair) has been presented to us and we have retained it for you. He said: Bring it to me. Talhah said: He fasted in the morning, but broke his fast (that day).",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 2457,
      "title": "Sunan Abi Dawud 2456",
      "narrator": "Narrated Umm Hani:",
      "english_text": "On the days of the  conquest of Mecca, when Mecca was captured, Fatimah came and sat on the left side of the Messenger of Allah (ﷺ), and Umm Hani was on his right side. A slave-girl brought a vessel which contained some drink; she gave it to him and he drank of it. He then gave it to Umm Hani who drank of it. She said: Messenger of Allah, I have broken my fast; I was fasting. He said to her: Were you making atonement for something? She replied: No. He said: Then it does not harm you if it was voluntary (fast).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 2458,
      "title": "Sunan Abi Dawud 2457",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "Some food was presented to me and Hafsah. We were fasting, but broke our fast. Then the Messenger of Allah (ﷺ) entered upon us. We said to him: A gift was presented to us; we coveted it and we broke our fast. The Messenger of Allah (ﷺ) said: There is no harm to you; keep a fast another day in lieu of it.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 2459,
      "title": "Sunan Abi Dawud 2458",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:",
      "english_text": "It is not allowable for a woman to keep (voluntary) fast when her husband is present without his permission, and she may not allow anyone to enter his house without his permission.",
      "grade": "صحيح ق دون ذكر رمضان   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 2460,
      "title": "Sunan Abi Dawud 2459",
      "narrator": "Narrated AbuSa'id al-Khudri:",
      "english_text": "A woman came to the Prophet (ﷺ) while we were with him.  \n\n\n\n\n\nShe said: Messenger of Allah, my husband, Safwan ibn al-Mu'attal, beats me when I pray, and makes me break my fast when I keep a fast, and he does not offer the dawn prayer until the sun rises. \n\n\n\n\n\nHe asked Safwan, who was present, about what she had said.  He replied: Messenger of Allah, as for her statement \"he beats me when I pray\", she recites two surahs (during prayer) and I have prohibited her (to do so).  \n\n\n\n\n\nHe (the Prophet) said: If one surah is recited (during prayer), that is sufficient for the people.  \n\n\n\n\n\n(Safwan continued:) As regards her saying \"he makes me break my fast,\" she dotes on fasting; I am a young man, I cannot restrain myself.  \n\n\n\n\n\nThe Messenger of Allah (ﷺ) said on that day: A woman should not fast except with the permission of her husband.  \n\n\n\n\n\n(Safwan said:) As for her statement that I do not pray until the sun rises, we are a people belonging to a class, and that (our profession of supplying water) is already known about us. We do not awake until the sun rises.  He said: When you awake, offer your prayer.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 2461,
      "title": "Sunan Abi Dawud 2460",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:",
      "english_text": "When one of you receives an invitation (for a meal), he should accept it. If he isn to fasting, he should eat, and if he is fasten, he should pray. Hisham said: The word salat means to pray (for him to Allah).\n\n\nAbu Dawud said: This tradition has also been narrated by Hafs b. Ghiyath from Hisham.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 2462,
      "title": "Sunan Abi Dawud 2461",
      "narrator": "Abu Hurairah reported Messenger of Allah (ﷺ) as saying:",
      "english_text": "When one of you is invited (to a meal), and he is fasting, he should say that he is fasting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 2463,
      "title": "Sunan Abi Dawud 2462",
      "narrator": "'Aishah said:",
      "english_text": "The Prophet (ﷺ) used to observe retirement (i'tikaf) to the mosque during the last ten days of Ramadan till Allah took him, and then his wives observed retirement to the mosque after his death.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 2464,
      "title": "Sunan Abi Dawud 2463",
      "narrator": "Narrated Ubayy ibn Ka'b:",
      "english_text": "The Prophet (ﷺ) used to observe i'tikaf during the last ten days of Ramadan. One year he did not observe i'tikaf. When the next year came, he observed i'tikaf for twenty nights (i.e. days).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 2465,
      "title": "Sunan Abi Dawud 2464",
      "narrator": "'Aishah said:",
      "english_text": "When the Messenger of Allah (ﷺ) intended to observe I'tikaf, he prayed the fajr prayer and then entered his place of seclusion. Once he intended to observe I'tikaf during the last ten days of Ramadan. She said: He ordered to pitch a tent for him, and it was pitched. She said: The other wives of the Prophet (ﷺ) also ordered to pitch tents for them and they were pitched. When he offered the fajr prayer, he saw the tents, and said: What is this ? Did you intend to do an act of virtue ? She said: He then ordered to demolish his tent, and it was demolished. Then his wives also ordered to demolish their tents and they were demolished. He then postponed I'tikaf till the first ten days, that is of Shawwal.\n\n\nAbu Dawud said: This tradition has been transmitted by Ibn Ishaq and al-Auza'i from Yahya b. Sa'id in a similar manner, and Malik narrated it from Yahya b. Sa'id, saying: He observed I'tikaf during twenty days of Shawwal.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 2466,
      "title": "Sunan Abi Dawud 2465",
      "narrator": "Ibn 'Umar said:",
      "english_text": "The Prophet (ﷺ) used to observe I'tikaf during the last ten days of Ramadan. Nafi' said: 'Abd Allah (b. 'Umar) showed me the place in the mosque where Messenger of Allah (ﷺ) used to observe I'tikaf.",
      "grade": "صحيح م خ دون قول نافع وقد ...   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 2467,
      "title": "Sunan Abi Dawud 2466",
      "narrator": "Abu Hurairah said:",
      "english_text": "The Prophet (ﷺ) used to observe I'tikaf during ten days of Ramadan every year. But when the year in which he died, he observed I'tikaf for twenty days.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 2468,
      "title": "Sunan Abi Dawud 2467",
      "narrator": "'Aishah said:",
      "english_text": "When the Messenger of Allah (ﷺ) observed I'tikaf, he would put his head near me, and I would comb it.  and he entered the house only to fulfill human needs (i.e. to urinate or to relieve himself).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 2469,
      "title": "Sunan Abi Dawud 2468",
      "narrator": "A similar tradition has been transmitted by 'Aishah from the Prophet (ﷺ) through a different chain of narrators.\n\n\nAbu Dawud said:",
      "english_text": "And Yunus also narrated in a similar way from al-Zuhri, and no one supported Malik in his narration from 'Urwah from 'Umrah ; and Ma'mar, Ziyad b. Sad and others have also narrated it from al-Zuhri from 'Urwah on the authority of 'Aishah.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 2470,
      "title": "Sunan Abi Dawud 2469",
      "narrator": "'Aishah said:",
      "english_text": "The Messenger of Allah (ﷺ) used to observe I'tikaf in the mosque and put his head near me through the opening of the apartment, and I would wash his head. Musaddad said: \"And I would comb it while I was menstruating.\"",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 2471,
      "title": "Sunan Abi Dawud 2470",
      "narrator": "Safiyyah said:",
      "english_text": "When the Messenger of Allah (ﷺ) was observing I'tikaf (in the mosque), I would come to him to visit him. I had a talk with him and then stood up. I then returned and he (the Prophet) also stood up to accompany me (to my house). Her dwelling place was in the house of Usamah b. Zaid. Two men from the Ansar (helpers) passed (by him at the moment). When they saw the Prophet (ﷺ), they walked quickly. The Prophet (ﷺ) said: Be at ease, she is Safiyyah daughter of Huyayy. They said: Be glory to Allah, Messenger of Allah! He said: Satan runs in man like blood. I feared he might inspire something in your mind, or he said: evil (the narrator doubted).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 159,
      "hadithNum_inBook": 2472,
      "title": "Sunan Abi Dawud 2471",
      "narrator": "",
      "english_text": "The tradition mentioned above has also been transmitted by Al Zuhri through a different chain of narrators. In this version she said “When he was at the gate of the mosque which was near the gate of Umm Salamah, two men passed them. The narrator then transmitted the tradition to the same effect.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 160,
      "hadithNum_inBook": 2473,
      "title": "Sunan Abi Dawud 2472",
      "narrator": "",
      "english_text": "According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”\n\n\nAccording to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 161,
      "hadithNum_inBook": 2474,
      "title": "Sunan Abi Dawud 2473",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The sunnah for one who is observing i'tikaf (in a mosque) is not to visit a patient, or to attend a funeral, or touch or embrace one's wife, or go out for anything but necessary purposes. There is no i'tikaf without fasting, and there is no i'tikaf except in a congregational mosque.",
      "grade": "Hasan Sahih (Al-Albani)  حسن صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 162,
      "hadithNum_inBook": 2475,
      "title": "Sunan Abi Dawud 2474",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "Umar (may Allah be pleased with him) took a vow in the pre-Islamic days to spend a night or a day in devotion near the Ka'bah (in the sacred mosque). He asked the Prophet (ﷺ) about it. He said: Observe i'tikaf (i.e. spend a night or a day near the Ka'bah) and fast.",
      "grade": "صحيح دون قوله أو يوما وقوله وصم ق   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 163,
      "hadithNum_inBook": 2476,
      "title": "Sunan Abi Dawud 2475",
      "narrator": "Narrated Abdullah ibn Umar:",
      "english_text": "The tradition mentioned above (No. 2468) has also been transmitted by Abdullah ibn Budayl through a different chain of narrators in a similar way. \n\n\n\n\n\nThis version adds: While he (Umar) was observing i'tikaf (in the sacred mosque), the people uttered (loudly):  \"Allah is most great.\" He said: What is this, Abdullah?  He said: These are the captives of the Hawazin whom the Messenger of Allah (ﷺ) has set free. He said: This slave-girl too? He sent her along with them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 164,
      "hadithNum_inBook": 2477,
      "title": "Sunan Abi Dawud 2476",
      "narrator": "",
      "english_text": "A’ishah(may Allaah be pleased with her) said “One of the wives of the Apostle of Allaah(ﷺ) observed I’tikaf along with him (in the mosque). She would see yellowness and redness. Sometimes we would place a washbasin while she prayed.”",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}