{
  "chapterNum": 29,
  "english_title": "Medicine (Kitab Al-Tibb)",
  "totalHadiths_inChapter": 49,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 3856,
      "title": "Sunan Abi Dawud 3855",
      "narrator": "Narrated Usamah ibn Sharik:",
      "english_text": "I came to the Prophet (ﷺ) and his Companions were sitting as if they had birds on their heads. I saluted and sat down. The desert Arabs then came from here and there. They asked: Messenger of Allah, should we make use of medical treatment? He replied: Make use of medical treatment, for Allah has not made a disease without appointing a remedy for it, with the exception of one disease, namely old age.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 3857,
      "title": "Sunan Abi Dawud 3856",
      "narrator": "Narrated Umm al-Mundhar bint Qays al-Ansariyyah:",
      "english_text": "The Messenger of Allah (ﷺ) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (ﷺ) got up and began to eat from them.  \n\n\n\n\n\nAli also got up to eat, but the Messenger of Allah (ﷺ) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.  \n\n\n\n\n\nShe said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (ﷺ) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said: al-Adawiyyah (i.e. Umm al-Mundhar).",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 3858,
      "title": "Sunan Abi Dawud 3857",
      "narrator": "Narrated Abu Hurayrah:",
      "english_text": "The Prophet (ﷺ) said: The best medical treatment you apply is cupping.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 3859,
      "title": "Sunan Abi Dawud 3858",
      "narrator": "Narrated Salmah:",
      "english_text": "the maid-servant of the Messenger of Allah (ﷺ), said: No one complained to the Messenger of Allah (ﷺ) of a headache but he told him to get himself cupped, or of a pain in his legs but he told him to dye them with henna.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 3860,
      "title": "Sunan Abi Dawud 3859",
      "narrator": "Narrated Abu Kabshah al-Ansari:",
      "english_text": "The Messenger of Allah (ﷺ) used to have himself cupped on the top of his head and between his shoulders, and that he used to say: If anyone pours out any of his blood, he will not suffer if he applies no medical treatment for anything.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 3861,
      "title": "Sunan Abi Dawud 3860",
      "narrator": "Narrated Anas ibn Malik:",
      "english_text": "The Prophet (ﷺ) had himself cupped three times in the veins at the sides of the neck and on the shoulder. Ma'mar said: I got myself cupped, and I lost my memory so much so that I was instructed Surat al-Fatihah by others in my prayer. He had himself cupped at the top of his head.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 3862,
      "title": "Sunan Abi Dawud 3861",
      "narrator": "Narrated Abu Hurayrah:",
      "english_text": "The Prophet (ﷺ) said: If anyone has himself cupped on the 17th, 19th and 21st it will be a remedy for every disease.",
      "grade": "Hasan (Al-Albani)  حسن   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 3863,
      "title": "Sunan Abi Dawud 3862",
      "narrator": "Narrated Kabshah daughter of AbuBakrah:",
      "english_text": "(the narrator other than Musa said that Kayyisah daughter of AbuBakrah) She  said that her father used to forbid his family to have themselves cupped on a Tuesday, and used to assert on the authority of the Messenger of Allah (ﷺ) that Tuesday is the day of blood in which there is an hour when it does not stop.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 3864,
      "title": "Sunan Abi Dawud 3863",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Messenger of Allah (ﷺ) had himself cupped above the thigh for a contusion from which he suffered.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 3865,
      "title": "Sunan Abi Dawud 3864",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Prophet (ﷺ) sent a physician to Ubayy (ibn Ka'b), and he cut his vein.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 3866,
      "title": "Sunan Abi Dawud 3865",
      "narrator": "Narrated Imran ibn Husayn:",
      "english_text": "The Prophet (ﷺ) forbade to cauterise; we cauterised but they (cauterisation) did not benefit us, nor proved useful for us.\n\n\n\nAbu Dawud said: He used to hear the salutation of the angels: When he cauterized, it stopped. When he abandoned, it returned to him.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 3867,
      "title": "Sunan Abi Dawud 3866",
      "narrator": "Jabir said:",
      "english_text": "The Prophet (ﷺ) cauterized Sa’d b. Mu’adh from the wound of an arrow.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 3868,
      "title": "Sunan Abi Dawud 3867",
      "narrator": "Ibn’Abbas said:",
      "english_text": "The Messenger of Allah (ﷺ) snuffed medicine.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 3869,
      "title": "Sunan Abi Dawud 3868",
      "narrator": "Narrated Jabir ibn Abdullah:",
      "english_text": "The Messenger of Allah (ﷺ) was asked about a charm for one who is possessed (nashrah). He replied: It pertains to the work of the devil.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 3870,
      "title": "Sunan Abi Dawud 3869",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: If I drink an antidote, or tie an amulet, or compose poetry, I am the type who does not care what he does.\n\n\nAbu Dawud said: THis was peculiar to the Prophet (ﷺ), but some people have allowed to use it, i.e. antidote.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 3871,
      "title": "Sunan Abi Dawud 3870",
      "narrator": "Narrated Abu Hurayrah:",
      "english_text": "The Messenger of Allah (ﷺ) prohibited unclean medicine.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 3872,
      "title": "Sunan Abi Dawud 3871",
      "narrator": "Narrated AbdurRahman ibn Uthman:",
      "english_text": "When a physician consulted the Prophet (ﷺ) about putting frogs in medicine, he forbade him to kill them.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 3873,
      "title": "Sunan Abi Dawud 3872",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:",
      "english_text": "If anyone drinks poison, the poison will be in his hand (on the Day of Judgement) and he will drink it in Hell-fire and he will live in it eternally.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 3874,
      "title": "Sunan Abi Dawud 3873",
      "narrator": "Narrated Tariq ibn Suwayd or Suwayd ibn Tariq:",
      "english_text": "Wa'il said: Tariq ibn Suwayd or Suwayd ibn Tariq asked the Prophet (ﷺ) about wine, but he forbade it. He again asked him, but he forbade him. He said to him: Prophet of Allah, it is a medicine. The Prophet (ﷺ) said: No it is a disease.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 3875,
      "title": "Sunan Abi Dawud 3874",
      "narrator": "Narrated Abu al-Darda:",
      "english_text": "The Prophet (ﷺ) said: Allah has sent down both the disease and the cure, and He has appointed a cure for every disease, so treat yourselves medically, but use nothing unlawful.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 3876,
      "title": "Sunan Abi Dawud 3875",
      "narrator": "Narrated Sa'd:",
      "english_text": "I suffered from an illness. The Messenger of Allah (ﷺ) came to pay a visit to me. He put his hands between my nipples and I felt its coolness at my heart. He said: You are a man suffering from heart sickness. Go to al-Harith ibn Kaladah, brother of Thaqif. He is a man who gives medical treatment. He should take seven ajwah dates of Medina and grind them with their kernels, and then put them into your mouth.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 3877,
      "title": "Sunan Abi Dawud 3876",
      "narrator": "Sa’d b. Abl Waqqas reported the prophet (ﷺ) as saying:",
      "english_text": "He who has a morning meal of seven ‘Ajwah dates will not suffer from any harm that day through poison or magic.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 3878,
      "title": "Sunan Abi Dawud 3877",
      "narrator": "Umm Qasis, daughter of Mihsan said :",
      "english_text": "I brought my son to the Messenger of Allah (ﷺ) while I had compressed his uvula for its swelling. He said : Why do you afflict your children by squeezing for a swelling in the Uvula ? Apply this Indian aloes wood, for it contain seven types of remedies, among them being a remedy for pleurisy. It is applied through the nose for a swelling of the uvula poured into the side of the mouth for pleurisy.\n\n\nAbu Dawud said : By aloes wood he meant costus.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 3879,
      "title": "Sunan Abi Dawud 3878",
      "narrator": "Narrated Abdullah ibn Abbas:",
      "english_text": "The Prophet (ﷺ) said: Wear your white garments, for they are among your best garments, and shroud your dead in them. Among the best types of collyrium you use is antimony (ithmid): it clears the vision and makes the hair sprout.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 3880,
      "title": "Sunan Abi Dawud 3879",
      "narrator": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying :",
      "english_text": "The evil is genuine.",
      "grade": "Sahih Mutawatir (Al-Albani)  صحيح متواتر   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 3881,
      "title": "Sunan Abi Dawud 3880",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "The man casting evil would be commanded to perform ablution, and then the man affected was washed with it.",
      "grade": "Sahih in chain (Al-Albani)  صحيح الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 3882,
      "title": "Sunan Abi Dawud 3881",
      "narrator": "Narrated Asma', daughter of Yazid ibn as-Sakan,:",
      "english_text": "I heard the Messenger of Allah (ﷺ) as saying: Do not kill your children secretly, for the milk, with which a child is suckled while his mother is pregnant, overtakes the horseman and throws him from his horse.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 3883,
      "title": "Sunan Abi Dawud 3882",
      "narrator": "Judamat al-Asadiyyah said that she heard the Messenger of Allah (May peace be upon him) Say:",
      "english_text": "I intended to prohibit suckling during pregnancy (ghailah), but I considered the Greeks and the Persians and saw that they practiced it, without any injury being caused to their children thereby. Malik said : Ghailah means that a man has intercourse with a women while she is suckling a child.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 3884,
      "title": "Sunan Abi Dawud 3883",
      "narrator": "Narrated Abdullah ibn Mas'ud:",
      "english_text": "Zaynab, the wife of Abdullah ibn Mas'ud, told that Abdullah said: I heard the Messenger of Allah (ﷺ) saying: spells, charms and love-potions are polytheism.  \n\n\n\n\n\nI asked: Why do you say this? I swear by Allah, when my eye was discharging I used to go to so-and-so, the Jew, who applied a spell to me. When he applied the spell to me, it calmed down. Abdullah said:  \n\n\n\n\n\nThat was just the work of the Devil who was picking it with his hand, and when he uttered the spell on it, he desisted. All you need to do is to say as the Messenger of Allah (ﷺ) used to say: Remove the harm, O Lord of men, and heal. Thou art the Healer. There is no remedy but Thine which leaves no disease behind.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 3885,
      "title": "Sunan Abi Dawud 3884",
      "narrator": "Narrated Imran ibn Husayn:",
      "english_text": "The Prophet (ﷺ) said: No spell is to be used except for the evil eye or a scorpion sting.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 3886,
      "title": "Sunan Abi Dawud 3885",
      "narrator": "Narrated Thabit ibn Qays ibn Shammas:",
      "english_text": "The Messenger of Allah (ﷺ) entered upon Thabit ibn Qays. The version of Ahmad (ibn Salih) has: When he was ill He (the Prophet) said: Remove the harm, O Lord of men, from Thabit ibn Qays ibn Shammas. He then took some dust of Bathan, and put it in a bowel, and then mixed it with water and blew in it, and poured it on him.\n\n\nAbu Dawud said: Ibn al-Sarh said: Yusuf bin Muhammad is correct (and not Muhammad bin Yusuf)",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 3887,
      "title": "Sunan Abi Dawud 3886",
      "narrator": "‘Awf b. Malik said :",
      "english_text": "In the pre-Islamic period we used to apply spells and we asked: Messenger of Allah ! how do you look upon it ? He replied : Submit your spells to me. There is no harm in spells so long as they involve no polytheism.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 3888,
      "title": "Sunan Abi Dawud 3887",
      "narrator": "Narrated Ash-Shifa', daughter of Abdullah,:",
      "english_text": "The Messenger of Allah (ﷺ) entered when I was with Hafsah, and he said to me: Why do you not teach this one the spell for skin eruptions as you taught her writing.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 3889,
      "title": "Sunan Abi Dawud 3888",
      "narrator": "Narrated Sahl ibn Hunayf:",
      "english_text": "I passed by a river. I entered it and took a bath in it. When I came out, I had fever. The Messenger of Allah (ﷺ) was informed about it. He said: Ask AbuThabit to seek refuge in Allah from that I asked: O my Lord, will the spell be useful? He replied: No, the spell is to be used except for the evil eye or a snake bite or a scorpion sting.\n\n\nAbu Dawud said: Humah means the biting of snakes and sting of the poisonous insects.",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 3890,
      "title": "Sunan Abi Dawud 3889",
      "narrator": "Anas reported the Prophet (ﷺ) as saying :",
      "english_text": "No spell is to be used except for the evil eye, or sting of  poisonous insects, or bleeding. The narrator al-‘Abhas did mention the words “evil eye”. The is the version of Sulaiman b. Dawud.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 3891,
      "title": "Sunan Abi Dawud 3890",
      "narrator": "Anas said to Thabit :",
      "english_text": "Should I not use the spell of the Messenger of Allah (ﷺ) for you ? He said : Yes. He then said : O Allah, Lord of men, Remover of the harm, heal, Thou art the healer. There is no healer but Thou; given him a remedy which leaves no disease behind.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 3892,
      "title": "Sunan Abi Dawud 3891",
      "narrator": "‘Uthman b. Abl al-As said that he came to the Messenger of Allah (ﷺ). ‘Uthman said :",
      "english_text": "I had a pain which was about to destroy me. So the Prophet (ﷺ) said : Wipe it with your right hand seven times and say : “I seek refuge in the dominance of Allah, and His might from the evil of  what I find.” Then I did it. Allah removed (the pain) that I had, and I kept on suggesting it to my family and to others.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 3893,
      "title": "Sunan Abi Dawud 3892",
      "narrator": "Narrated AbudDarda':",
      "english_text": "I heard the Messenger of Allah (ﷺ) say: If any of you is suffering from anything or his brother is suffering, he should say: Our Lord is Allah Who is in the heaven, holy is Thy name, Thy command reigns supreme in the heaven and the earth, as Thy mercy in the heaven, make Thy mercy  in the earth; forgive us our sins, and our errors; Thou art the Lord of good men; send down mercy from Thy mercy, and remedy, and remedy from Thy remedy on this pain so that it is healed up.",
      "grade": "Da'if (Al-Albani)  ضعيف   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 3894,
      "title": "Sunan Abi Dawud 3893",
      "narrator": "Narrated Abdullah ibn Amr ibn al-'As:",
      "english_text": "The Messenger of Allah (ﷺ) sued to teach them the following words in the case of alarm: I seek refuge in Allah's perfect words from His anger, the evil of His servants, the evil suggestions of the devils and their presence. Abdullah ibn Amr used to teach them to those of his children who had reached puberty, and he wrote them down (on some material) and hung on the child who had not reached puberty.",
      "grade": "حسن دون قوله وكان عبدالله   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 3895,
      "title": "Sunan Abi Dawud 3894",
      "narrator": "Yazid b. Abi ‘Ubaid said :",
      "english_text": "I saw a sign of injury in the shin of Salamah. I asked : What is this ? He replied : I was afflicted. I was afflicted by it on the day of Khaibar. The people said : Salamah has been afflicted. I was then brought to the Prophet (ﷺ). He blew on me three times. I did not feel any pain up till now.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 3896,
      "title": "Sunan Abi Dawud 3895",
      "narrator": "‘A’ishah said :",
      "english_text": "When a man complained of pain the Prophet (ﷺ) said to him pointing to his saliva and mixing it with dust :(This is) the dust of our earth, mixed with saliva of us, so that our sick is remedied with the permission of our lord.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 3897,
      "title": "Sunan Abi Dawud 3896",
      "narrator": "Narrated Alaqah ibn Sahar at-Tamimi:",
      "english_text": "Alaqah came to the Messenger of Allah (ﷺ) and embraced Islam. He then came back from him and passed some people who had a lunatic fettered in chains.  \n\n\n\n\n\nHis people said: We are told that your companion has brought some good. Have you something with which you can cure him? I then recited Surat al-Fatihah and he was cured. They gave me one hundred sheep. I then came to the Messenger of Allah (ﷺ) and informed him of it.  \n\n\n\n\n\nHe asked: Is it only this? The narrator, Musaddad, said in his other version: Did you say anything other than this?  I said: No.  He said: Take it, for by my life, some accept if for a worthless chain, but you have done so for a genuine one.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 3898,
      "title": "Sunan Abi Dawud 3897",
      "narrator": "Kharijah b. al-Salt quoted his parental uncle as saying that he passed (some people) :",
      "english_text": "He recited Surat al-Fatihah over him for three days morning and evening. Whenever he finished it, he collected some of his saliva and spat it out, and he seemed as if he were set free from a bond. They gave him something as payment. He then came to the Prophet (ﷺ). He then transmitted the rest of the tradition to the same effect as Musaddad narrated.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 3899,
      "title": "Sunan Abi Dawud 3898",
      "narrator": "Narrated AbuSalih Zakwan as-Samman:",
      "english_text": "A man from Aslam tribe said: I was sitting with the Messenger of Allah (ﷺ). A man from among his Companions came and said: Messenger of Allah! I have been stung last night, and I could not sleep till morning. He asked: What was that? He replied: A scorpion. \n\n\n\n\n\nHe said: Oh, had you said in the evening: \"I take refuge in the perfect words of Allah from the evil of what He created,\" nothing would have harmed you, Allah willing.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 3900,
      "title": "Sunan Abi Dawud 3899",
      "narrator": "Narrated AbuHurayrah:",
      "english_text": "A man who was stung by a scorpion was brought to the Prophet (ﷺ). He said: Had he said the word: \"I seek refuge in the perfect words of Allah from the evil of what He created, \"he would not have been stung, or he said, \"It would not have harmed him.\"",
      "grade": "Da'if in chain (Al-Albani)  ضعيف الإسناد   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 3901,
      "title": "Sunan Abi Dawud 3900",
      "narrator": "Abu Sa’d al-KHudri said :",
      "english_text": "Some of the Companions of the Prophet (ﷺ) went on a journey. They alighted with a certain clan of the Arabs. Someone of them said : Our chief has been stung by a scorpion or bitten by a snake. Has any of you something which gives relief to our chief? A man of the people said : Yes, I swear by Allah. I shall apply charm ; but we asked you for hospitality and you denied it to us. I shall not apply charm until you give me some payment. So they promised to give some sheep to him. He came to him and recited Surat al-Fatihah over him and spat till he was cured, and ha seemed as if he were set free from a bond. So they gave him the payment that was agreed between them. They said : Apportion them. The man who applied charm said : Do not do it until we approach the Apostle of allah (ﷺ) said: From where did you learn that it was a charm ? you have done right. Apportion them, and give me a share along with you.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 3902,
      "title": "Sunan Abi Dawud 3901",
      "narrator": "Narrated Alaqah ibn Sahar at-Tamimi:",
      "english_text": "We proceeded from the Messenger of Allah (ﷺ) and came to a clan of the Arabs.  \n\n\n\n\n\nThey said: We have been told that you have brought what is good from this man. Have you any medicine or a charm, for we have a lunatic in chains?  \n\n\n\n\n\nWe said: Yes. Then they brought a lunatic in chains.  He said: I recited Surat al-Fatihah over him for three days, morning and evening. Whenever I finished it, I would collect my saliva and spit it out, and he seemed as if he were set free from a bond. He said: They gave me some payment, but I said: No, not until I ask the Messenger of Allah (ﷺ).  \n\n\n\n\n\nHe (the Prophet) said: Accept it, for, by my life, some accept it for a worthless charm, but you have done so for a genuine one.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 3903,
      "title": "Sunan Abi Dawud 3902",
      "narrator": "Narrated A'ishah:",
      "english_text": "the wife of Prophet (ﷺ) said: When the Messenger of Allah (ﷺ) suffered from some pain, he recited mu'awwadhat in his heart and blew (them over him). When the pain became severe, I recited (them) over him and wiped him with his hand in the hope of its blessing.",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 3904,
      "title": "Sunan Abi Dawud 3903",
      "narrator": "Narrated Aisha, Ummul Mu'minin:",
      "english_text": "My mother intended to make me gain weight to send me to the (house of) the Messenger of Allah (ﷺ). But nothing which she desired benefited me till she gave me cucumber with fresh dates to eat. Then I gained as much weight (as she desired).",
      "grade": "Sahih (Al-Albani)  صحيح   (الألباني) حكم"
    }
  ]
}