{
  "chapterNum": 77,
  "english_title": "Dress",
  "totalHadiths_inChapter": 185,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 5557,
      "title": "Sahih al-Bukhari 5783",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, 'Allah will not look at the person who drags his garment (behind him) out of \nconceit.''",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 5558,
      "title": "Sahih al-Bukhari 5784",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "The Prophet (ﷺ) said Allah will not look, on the Day of Resurrection at the person who drags his garment \n(behind him) out of conceit. On that Abu Bakr said, \"O Allah's Messenger (ﷺ)! One side of my Izar hangs \nlow if I do not take care of it.\" The Prophet (ﷺ) said, 'You are not one of those who do that out of conceit.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 5559,
      "title": "Sahih al-Bukhari 5785",
      "narrator": "Narrated Abu Bakra:",
      "english_text": "The solar eclipse occurred while we were sitting with the Prophet (ﷺ) He got up dragging his garment (on \nthe ground) hurriedly till he reached the mosque The people turned (to the mosque) and he offered a \ntwo-rak`at prayer whereupon the eclipse was over and he traced us and said, \"The sun and the moon \nare two signs among the signs of Allah, so if you see a thing like this (eclipse) then offer the prayer \nand invoke Allah till He remove that state.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 5560,
      "title": "Sahih al-Bukhari 5786",
      "narrator": "Narrated Abu Juhaifa:",
      "english_text": "I saw Bilal bringing a short spear (or stick) and fixing it in the ground, and then he proclaimed the \nIqama of the prayer, and I saw Allah's Messenger (ﷺ) coming out, wearing a cloak with its sleeves rolled up. \nHe then offered a two-rak`at prayer while facing the stick, and I saw the people and animals passing in \nfront of him beyond the stick.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 5561,
      "title": "Sahih al-Bukhari 5787",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) said, \"The part of an Izar which hangs below the ankles is in the Fire.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 5562,
      "title": "Sahih al-Bukhari 5788",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ), \"Allah will not look, on the Day of Resurrection, at a person who drags his Izar \n(behind him) out of pride and arrogance.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 5563,
      "title": "Sahih al-Bukhari 5789",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (or 'Abul Qasim) said, \"While a man was walking, clad in a two-piece garment and proud \nof himself with his hair well-combed, suddenly Allah made him sink into the earth and he will go on \nsinking into it till the Day of Resurrection.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 5564,
      "title": "Sahih al-Bukhari 5790",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"While a man was dragging his Izar on the ground (behind him), suddenly Allah \nmade him sink into the earth and he will go on sinking into it till the Day of Resurrection.\"\nNarrated Abu Huraira:\n\nthat he heard the Prophet (narrating as above No. 680).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 5565,
      "title": "Sahih al-Bukhari 5791",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Whoever drags his clothes (on the ground) out of pride and arrogance, Allah \nwill not look at him on the Day of Resurrection.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 5566,
      "title": "Sahih al-Bukhari 5792",
      "narrator": "Narrated `Aisha:",
      "english_text": "(the wife of the Prophet) \nThe wife of Rifa`a Al-Qurazi came to Allah's Messenger (ﷺ) while I was sitting, and Abu Bakr was also \nthere. She said, 'O Allah s Apostle! I was the wife of Rifa`a and he divorced me irrevocably. Then I \nmarried `AbdurRahman bin Az-Zubair who, by Allah, O Allah's Messenger (ﷺ), has only something like a \nfringe of a garment, Showing the fringe of her veil. Khalid bin Sa`id, who was standing at the door, \nfor he had not been admitted, heard her statement and said, \"O Abu Bakr! Why do you not stop this \nlady from saying such things openly before Allah's Messenger (ﷺ)?\" No, by Allah, Allah's Messenger (ﷺ) did \nnothing but smiled. Then he said to the lady, \"Perhaps you want to return to Rifa`a? That is impossible \nunless `Abdur-Rahman consummates his marriage with you.\" That became the tradition after him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 5567,
      "title": "Sahih al-Bukhari 5793",
      "narrator": "Narrated `Ali:",
      "english_text": "The Prophet (ﷺ) asked for his Rida, put it on and set out walking. Zaid bin Haritha and I followed him till \nhe reached the house where Harnza (bin `Abdul Muttalib) was present and asked for permission to \nenter, and they gave us permission.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 5568,
      "title": "Sahih al-Bukhari 5794",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "A man asked, \"O Allah s Apostle What kind of clothes should a Muhrim wear?\" The Prophet, said, \"A \nMuhrim should not wear a shirt, trousers a hooded cloak, or Khuffs (socks made from thick fabric or \nleather) unless he cannot get sandals, in which case he should cut the part (of the Khuff) that covers \nthe ankles.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 5569,
      "title": "Sahih al-Bukhari 5795",
      "narrator": "Narrated Jabir bin `Abdullah:",
      "english_text": "The Prophet (ﷺ) came to visit `Abdullah bin Ubai (bin Salul) after he had been put in his grave. The Prophet (ﷺ) ordered that `Abdullah be taken out. He was taken out and was placed on the knees of the Prophet, who blew his (blessed) breath on him and dressed the body with his own shirt. And Allah knows better.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 5570,
      "title": "Sahih al-Bukhari 5796",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "When `Abdullah bin Ubdi (bin Salul) died, his son came to Allah's Messenger (ﷺ) and said ' O Allah's \nApostle, give me your shirt so that I may shroud my fathers body in it. And please offer a funeral \nprayer for him and invoke Allah for his forgiveness.\" The Prophet (ﷺ) gave him his shirt and said to him \n'Inform us when you finish (and the funeral procession is ready) call us. When he had finished he told \nthe Prophet (ﷺ) and the Prophet (ﷺ) proceeded to order his funeral prayers but `Umar stopped him and said, \n\"Didn't Allah forbid you to offer the funeral prayer for the hypocrites when He said: \"Whether you (O \nMuhammad) ask forgiveness for them or ask not forgiveness for them: (and even) if you ask \nforgiveness for them seventy times. Allah will not forgive them.\" (9.80) Then there was revealed: \n\"And never (O Muhammad) pray for any of them that dies, nor stand at his grave.\" (9.34) Thenceforth \nthe Prophet (ﷺ) did not offer funeral prayers for the hypocrites.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 5571,
      "title": "Sahih al-Bukhari 5797",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) has set forth an example for a miser and a charitable person by comparing them to two \nmen wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the \ncharitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will \ncover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, \nhis cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira added; I saw \nAllah's Messenger (ﷺ) putting his finger in the (chest) pocket of his shirt like that If you but saw him trying \nto widen (the opening of his shirt) but it did not widen.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 5572,
      "title": "Sahih al-Bukhari 5798",
      "narrator": "Narrated Al-Mughira bin Shu`ba:",
      "english_text": "The Prophet (ﷺ) went to answer the call of nature, and when he returned, I met him with water and he \nperformed the ablution while he was wearing a Sham, cloak. He rinsed his mouth, put the water in his \nnose and blew it out, washed his face and tried to take his hands out of his sleeves, but they were too \nnarrow, so he took out his hands from under his chest and washed them and then passed his wet hands \nover his head and Khuffs (socks made from thick fabric or leather).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 5573,
      "title": "Sahih al-Bukhari 5799",
      "narrator": "Narrated Al-Mughira:",
      "english_text": "One night I was with the Prophet (ﷺ) on a journey. He asked (me), \"Have you got water with you?\" I \nreplied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness \nof the night. Then he came back and I poured water for him from the pot (for the ablution). He washed \nhis face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he \ncould not take his arms out of it. So he took them out from underneath the cloak. Then he washed his \nforearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from \nthick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them \non.\" And so he passed his wet hands over them.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 5574,
      "title": "Sahih al-Bukhari 5800",
      "narrator": "Narrated Al-Miswar bin Makhrama:",
      "english_text": "Allah's Messenger (ﷺ) distributed some Qaba's but he did not give anything to Makhrama. Makhrama said \n(to me), \"O my son! Let us go to Allah's Messenger (ﷺ).\" So I proceeded with him and he said, \"Go in and \ncall him 'or me.\" So I called the Prophet (ﷺ) for him The Prophet (ﷺ) came out to him, wearing one of those \nQaba's and said, (to Makhrama), \"I have kept this for you \" Makhrama looked at it and said, \n\"Makhrama is satisfied now.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 5575,
      "title": "Sahih al-Bukhari 5801",
      "narrator": "Narrated `Uqba bin 'Amir:",
      "english_text": "A silken Farruj was presented to Allah's Messenger (ﷺ) and he put it on and offered the prayer in it. When he \nfinished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit \nthose who fear Allah!\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 5576,
      "title": "Sahih al-Bukhari 5802",
      "narrator": "Narrated Mu'tamir:",
      "english_text": "I heard my father saying, \"I saw Anas wearing a yellow hooded cloak of Khazz.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 5577,
      "title": "Sahih al-Bukhari 5803",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "A man said, \"O Allah's Messenger (ﷺ). What type of clothes should a Muhrim wear Allah's Messenger (ﷺ) replied, \n'Do not wear shirts, turbans trousers hooded cloaks or Khuffs (socks made from thick fabric or \nleather); but if someone cannot get sandals, then he can wear Khuffs after cutting them short below \nthe ankles. Do not wear clothes touched by saffon or wars (two kinds of perfumes).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 5578,
      "title": "Sahih al-Bukhari 5804",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) said, \"Whoever cannot get an Izar, can wear trousers, and whoever cannot wear sandals \ncan wear Khuffs (socks made from thick fabric or leather).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 5579,
      "title": "Sahih al-Bukhari 5805",
      "narrator": "Narrated `Abdullah:",
      "english_text": "A man got up and said, O Allah's Messenger (ﷺ)! What do you order us to wear when we assume the state of \nIhram?\" The Prophet (ﷺ) replied, \"Do not wear shirts, trousers, turbans, hooded cloaks or Khuffs (socks \nmade from thick fabric or leather), but if a man has no sandals, he can wear Khuffs after cutting them \nshort below the ankles; and do not wear clothes touched with (perfumes) of saffron or wars.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 5580,
      "title": "Sahih al-Bukhari 5806",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "The Prophet (ﷺ) said, \"A Muhrim should not wear a shirt, a turban, trousers, hooded cloaks, a garment \ntouched with (perfumes) of saffron or wars, or Khuffs (socks made from thick fabric or leather) except \nif one has no sandals in which case he should cut short the Khuffs below the ankles.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 5581,
      "title": "Sahih al-Bukhari 5807",
      "narrator": "Narrated `Aisha:",
      "english_text": "Some Muslim men emigrated to Ethiopia whereupon Abu Bakr also prepared himself for the \nemigration, but the Prophet (ﷺ) said (to him), \"Wait, for I hope that Allah will allow me also to emigrate.\" \nAbu Bakr said, \"Let my father and mother be sacrificed for you. Do you hope that (emigration)?\" The \nProphet said, 'Yes.\" So Abu Bakr waited to accompany the Prophet (ﷺ) and fed two she-camels he had on \nthe leaves of As-Samur tree regularly for four months One day while we were sitting in our house at \nmidday, someone said to Abu Bakr, \"Here is Allah's Messenger (ﷺ), coming with his head and a part of his \nface covered with a cloth-covering at an hour he never used to come to us.\" \nAbu Bakr said, \"Let my father and mother be sacrificed for you, (O Prophet)! An urgent matter must \nhave brought you here at this hour.\" The Prophet (ﷺ) came and asked the permission to enter, and he was \nallowed. The Prophet (ﷺ) entered and said to Abu Bakr, \"Let those who are with you, go out.\" Abu Bakr \nreplied, \"(There is no stranger); they are your family. Let my father be sacrificed for you, O Allah's \nApostle!\" \nThe Prophet (ﷺ) said, \"I have been allowed to leave (Mecca).\" Abu Bakr said, \" I shall accompany you, O \nAllah's Messenger (ﷺ), Let my father be sacrificed for you!\" \nThe Prophet (ﷺ) said, \"Yes,\" \nAbu Bakr said, 'O Allah's Messenger (ﷺ)s! Let my father be sacrificed for you. Take one of these two shecamels \nof mine\" The Prophet (ﷺ) said. I will take it only after paying its price.\" \nSo we prepared their baggage and put their journey food In a leather bag. And Asma' bint Abu Bakr \ncut a piece of her girdle and tied the mouth of the leather bag with it. That is why she was called Dhatan- \nNitaqaln. Then the Prophet (ﷺ) and Abu Bakr went to a cave in a mountain called Thour and remained \nthere for three nights. `Abdullah bin Abu Bakr. who was a young intelligent man. used to stay with \nthem at night and leave before dawn so that in the morning, he would he with the Quraish at Mecca as \nif he had spent the night among them. If he heard of any plot contrived by the Quraish against the \nProphet and Abu Bakr, he would understand it and (return to) inform them of it when it became dark. \n'Amir bin Fuhaira, the freed slave of Abu Bakr used to graze a flock of milch sheep for them and he \nused to take those sheep to them when an hour had passed after the `Isha prayer. They would sleep \nsoundly till 'Amir bin Fuhaira awakened them when it was still dark. He used to do that in each of \nthose three nights.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 5582,
      "title": "Sahih al-Bukhari 5808",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "In the year of the conquest of Mecca the Prophet (ﷺ) entered Mecca, wearing a helmet on his head.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 5583,
      "title": "Sahih al-Bukhari 5809",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Once I was walking with Allah's Messenger (ﷺ) and he was wearing a Najram Burd with thick margin. A \nbedouin followed him and pulled his Burd so violently that I noticed the side of the shoulder of \nAllah's Messenger (ﷺ) affected by the margin of the Burd because of that violent pull. The Bedouin said, \"O \nMuhammad! Give me some of Allah's wealth which is with you.\" Allah's Messenger (ﷺ) turned and looked \nat him, and smiling, 'he ordered that he be given something.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 5584,
      "title": "Sahih al-Bukhari 5810",
      "narrator": "Narrated Abu Hazim:",
      "english_text": "Shahl bin Sa`d said, \"A lady came with a Burda. Sahl then asked (the people), \"Do you know what \nBurda is?\" Somebody said, \"Yes. it is a Shamla with a woven border.\" Sahl added, \"The lady said, 'O \nAllah's Messenger (ﷺ)! I have knitted this (Burda) with my own hands for you to wear it.\" Allah's Messenger (ﷺ) \ntook it and he was in need of it. Allah's Messenger (ﷺ) came out to us and he was wearing it as an Izar. A \nman from the people felt it and said, 'O Allah's Messenger (ﷺ)! Give it to me to wear.' The Prophet (ﷺ) s said, \n'Yes.' Then he sat there for some time (and when he went to his house), he folded it and sent it to him. \nThe people said to that man, 'You have not done a right thing. You asked him for it, though you know \nthat he does not put down anybody's request.' The man said, 'By Allah! I have only asked him so that \nit may be my shroud when I die.\" Sahl added, \"Late it was his shroud.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 5585,
      "title": "Sahih al-Bukhari 5811",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "I heard Allah's Messenger (ﷺ) saying \"From among my followers, a group (o 70,000) will enter Paradise \nwithout being asked for their accounts, Their faces will be shining like the moon.\" 'Ukasha bin \nMuhsin Al-Asadi got up, lifting his covering sheet and said, \"O Allah's Messenger (ﷺ) Invoke Allah for me \nthat He may include me with them.\" The Prophet (ﷺ) said! \"O Allah! Make him from them.\" Then another \nman from Al-Ansar got up and said, \"O Allah's Messenger (ﷺ)! Invoke Allah for me that He may include me \nwith them.\" On that Allah's Messenger (ﷺ) said, \"'Ukasha has anticipated you.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 5586,
      "title": "Sahih al-Bukhari 5812",
      "narrator": "Narrated Qatada:",
      "english_text": "I asked Anas, \"What kind of clothes was most beloved to the Prophet?\" He replied, \"The Hibra (a kind \nof Yemenese cloth).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 5587,
      "title": "Sahih al-Bukhari 5813",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The most beloved garment to the Prophet (ﷺ) to wear was the Hibra (a kind of Yemenese cloth).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 5588,
      "title": "Sahih al-Bukhari 5814",
      "narrator": "Narrated `Aisha:",
      "english_text": "(the wife of the Prophet) When Allah's Messenger (ﷺ) died, he was covered with a Hibra Burd (green square \ndecorated garment).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 5589,
      "title": "Sahih al-Bukhari 5815, 5816",
      "narrator": "Narrated `Aisha and `Abdullah bin `Abbas:",
      "english_text": "When the disease of Allah's Messenger (ﷺ) got aggravated, he covered his face with a Khamisa, but when he \nbecame short of breath, he would remove it from his face and say, \"It is like that! May Allah curse the \nJews Christians because they took the graves of their prophets as places of worship.\" By that he \nwarned his follower of imitating them, by doing that which they did.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 5590,
      "title": "Sahih al-Bukhari 5817",
      "narrator": "Narrated Aisha:",
      "english_text": "Allah's Messenger (ﷺ) offered prayer while he was wearing a Khamisa of his that had printed marks. He \nlooked at its marks and when he finished prayer, he said, \"Take this Khamisa of mine to Abu Jahm, \nfor it has just now diverted my attention from my prayer, and bring to me the Anbijania (a plain thick \nsheet) of Abu Jahm bin Hudhaifa bin Ghanim who belonged to Bani Adi bin Ka`b.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 5591,
      "title": "Sahih al-Bukhari 5818",
      "narrator": "Narrated Abu Burda:",
      "english_text": "Aisha brought out to us a Kisa and an Izar and said, \"The Prophet (ﷺ) died while wearing these two.\" \n(Kisa, a square black piece of woolen cloth. Izar, a sheet cloth garment covering the lower half of the \nbody).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 5592,
      "title": "Sahih al-Bukhari 5819",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) had forbidden: (A) the Mulamasa and Munabadha (bargains), (B) the offering of two \nprayers, one after the morning compulsory prayer till the sun rises, and the others, after the `Asr \nprayer till the sun sets (C) He also forbade that one should sit wearing one garment, nothing of which \ncovers his private parts (D) and prevent them from exposure to the sky; (E) he also forbade Ishtimalas- \nSamma'.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 5593,
      "title": "Sahih al-Bukhari 5820",
      "narrator": "Narrated Abu Sa`id Al-Khudri:",
      "english_text": "Allah's Messenger (ﷺ) forbade two ways of wearing clothes and two kinds of dealings. (A) He forbade the \ndealings of the Mulamasa and the Munabadha. In the Mulamasa transaction the buyer just touches the \ngarment he wants to buy at night or by daytime, and that touch would oblige him to buy it. In the \nMunabadha, one man throws his garment at another and the latter throws his at the former and the \nbarter is complete and valid without examining the two objects or being satisfied with them (B) The \ntwo ways of wearing clothes were Ishtimal-as-Samma, i e., to cover one's shoulder with one's garment \nand leave the other bare: and the other way was to wrap oneself with a garment while one was sitting \nin such a way that nothing of that garment would cover one's private part.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 5594,
      "title": "Sahih al-Bukhari 5821",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) forbade two types of dresses: (A) To sit in an Ihtiba' posture in one garment nothing of \nwhich covers his private parts. (B) to cover one side of his body with one garment and leave the other \nside bare The Prophet (ﷺ) also forbade the Mulamasa and Munabadha.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 5595,
      "title": "Sahih al-Bukhari 5822",
      "narrator": "Narrated Abu Sa`id Al-Khudri:",
      "english_text": "The Prophet (ﷺ) forbade Ishtimal-as-Samma' and that a man should sit in an Ihtiba' posture in one \ngarment, nothing of which covers his private parts.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 5596,
      "title": "Sahih al-Bukhari 5823",
      "narrator": "Narrated Um Khalid bint Khalid:",
      "english_text": "The Prophet (ﷺ) was given some clothes including a black Khamisa. The Prophet (ﷺ) said, \"To whom shall \nwe give this to wear?\" The people kept silent whereupon the Prophet (ﷺ) said, \"Fetch Um Khalid for me.\" \nI (Um Khalid) was brought carried (as I was small girl at that time). The Prophet (ﷺ) took the Khamisa in \nhis hands and made me wear it and said, \"May you live so long that your dress will wear out and you \nwill mend it many times.\" On the Khamisa there were some green or pale designs (The Prophet (ﷺ) saw \nthese designs) and said, \"O Um Khalid! This is Sanah.\" (Sanah in a Ethiopian word meaning \nbeautiful).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 5597,
      "title": "Sahih al-Bukhari 5824",
      "narrator": "Narrated Anas:",
      "english_text": "When Um Sulaim gave birth to a child. she said to me, \"O Anas! Watch this boy carefully and do not \ngive him anything to eat or drink until you have taken him to the Prophet (ﷺ) tomorrow morning for the \nTahnik.\" So the next morning I took the child to the Prophet (ﷺ) who was sitting in a garden and was \nwearing a Huraithiya Khamisa and was branding the she-camel on which he had come during the \nConquest of Mecca.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 5598,
      "title": "Sahih al-Bukhari 5825",
      "narrator": "Narrated `Ikrima:",
      "english_text": "Rifa`a divorced his wife whereupon `AbdurRahman bin Az-Zubair Al-Qurazi married her. `Aisha said \nthat the lady (came), wearing a green veil (and complained to her (Aisha) of her husband and showed \nher a green spot on her skin caused by beating). It was the habit of ladies to support each other, so \nwhen Allah's Messenger (ﷺ) came, `Aisha said, \"I have not seen any woman suffering as much as the \nbelieving women. Look! Her skin is greener than her clothes!\" When `AbdurRahman heard that his \nwife had gone to the Prophet, he came with his two sons from another wife. She said, \"By Allah! I \nhave done no wrong to him but he is impotent and is as useless to me as this,\" holding and showing \nthe fringe of her garment, `Abdur-Rahman said, \"By Allah, O Allah's Messenger (ﷺ)! She has told a lie! I am \nvery strong and can satisfy her but she is disobedient and wants to go back to Rifa`a.\" Allah's Messenger (ﷺ) \nsaid, to her, \"If that is your intention, then know that it is unlawful for you to remarry Rifa`a unless \n`Abdur-Rahman has had sexual intercourse with you.\" Then the Prophet (ﷺ) saw two boys with `Abdur- \nRahman and asked (him), \"Are these your sons?\" On that `AbdurRahman said, \"Yes.\" The Prophet (ﷺ) \nsaid, \"You claim what you claim (i.e.. that he is impotent)? But by Allah, these boys resemble him as \na crow resembles a crow,\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 5599,
      "title": "Sahih al-Bukhari 5826",
      "narrator": "Narrated Sa`d:",
      "english_text": "On the day of the battle of Uhud, on the right and on the left of the Prophet (ﷺ) were two men wearing \nwhite clothes, and I had neither seen them before, nor did I see them afterwards.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 5600,
      "title": "Sahih al-Bukhari 5827",
      "narrator": "Narrated Abu Dharr:",
      "english_text": "I came to the Prophet (ﷺ) while he was wearing white clothes and sleeping. Then I went back to him again \nafter he had got up from his sleep. He said, \"Nobody says: 'None has the right to be worshipped but \nAllah' and then later on he dies while believing in that, except that he will enter Paradise.\" \nI said, \"Even if he had committed illegal sexual intercourse and theft?\" He said. 'Even if he had committed illegal sexual intercourse and theft.\" \nI said, \"Even if he had committed illegal sexual intercourse and theft?\" He said. 'Even if he had committed illegal sexual intercourse and theft.\" \nI said, 'Even it he had committed illegal sexual intercourse and theft?' He said, \"Even if he had committed illegal sexual intercourse and theft, inspite of the Abu Dharr's dislike. Abu `Abdullah said, \"This is at the time of death or before it if one repents and regrets and says \"None has the right to \nbe worshipped but Allah. He will be forgiven his sins.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 5601,
      "title": "Sahih al-Bukhari 5828",
      "narrator": "Narrated Aba `Uthman An-Nahdi:",
      "english_text": "While we were with `Utba bin Farqad at Adharbijan, there came `Umar's letter indicating that Allah's \nApostle had forbidden the use of silk except this much, then he pointed with his index and middle \nfingers. To our knowledge, by that he meant embroidery.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 5602,
      "title": "Sahih al-Bukhari 5829",
      "narrator": "Narrated Abu `Uthman:",
      "english_text": "While we were at Adharbijan, `Umar wrote to us: 'Allah's Messenger (ﷺ) forbade wearing silk except this \nmuch. Then the Prophet (ﷺ) approximated his two fingers (index and middle fingers) (to illustrate that) to \nus.' Zuhair (the sub-narrator) raised up his middle and index fingers.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 5603,
      "title": "Sahih al-Bukhari 5830",
      "narrator": "Narrated Abu `Uthman:",
      "english_text": "While we were with `Utba. `Umar wrote to us: The Prophet (ﷺ) said, \"There is none who wears silk in this \nworld except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his \nmiddle and index fingers.\n\nThis hadith has also been narrated by Abu `Uthman.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 5604,
      "title": "Sahih al-Bukhari 5831",
      "narrator": "Narrated Ibn Abi Laila:",
      "english_text": "While Hudhaifa was at Al-Madain, he asked for water whereupon the chief of the village brought him \nwater in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have \nforbidden him to use it, but he does not stop using it. Allah's Messenger (ﷺ) said, 'Gold, silver, silk and Dibaj \n(a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 5605,
      "title": "Sahih al-Bukhari 5832",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The Prophet (ﷺ) said, Whoever wears silk in this world shall not wear it in the Hereafter.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 5606,
      "title": "Sahih al-Bukhari 5833",
      "narrator": "Narrated Thabit:",
      "english_text": "I heard Ibn Az-Zubair delivering a sermon, saying, \"Muhammad said, 'Whoever wears silk in this \nworld, shall not wear it in the Hereafter.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 5607,
      "title": "Sahih al-Bukhari 5834",
      "narrator": "Narrated Ibn Az-Zubair:",
      "english_text": "I heard `Umar saying, \"The Prophet (ﷺ) said, 'Whoever wears silk in this world, shall not wear it in the \nHereafter.\"\n\nThis hadith is also narrated through 'Umar ibn al-Khattab.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 5608,
      "title": "Sahih al-Bukhari 5835",
      "narrator": "Narrated 'Umar bin Al-Khattab (ra):",
      "english_text": "Allah's Messenger (ﷺ) said, \"None wears silk in this world, but he who will have no share in the Hereafter.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 5609,
      "title": "Sahih al-Bukhari 5836",
      "narrator": "Narrated Al-Bara:",
      "english_text": "The Prophet (ﷺ) was given a silk garment as a gift and we started touching it with our hands and admiring \nit. On that the Prophet (ﷺ) said, \"Do you wonder at this?\" We said, \"Yes.\" He said, \"The handkerchiefs of \nSa`d bin Mu`adh in Paradise are better than this.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 5610,
      "title": "Sahih al-Bukhari 5837",
      "narrator": "Narrated Hudhaifa:",
      "english_text": "The Prophet (ﷺ) forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the \nwearing of silk and Dibaj or sitting on it.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 5611,
      "title": "Sahih al-Bukhari 5838",
      "narrator": "Narrated Ibn Azib:",
      "english_text": "The Prophet (ﷺ) forbade us to use the red Mayathir and to use Al-Qassiy.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 5612,
      "title": "Sahih al-Bukhari 5839",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) allowed Az-Zubair and `Abdur-Rahman to wear silk because they were suffering from an \nitch.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 5613,
      "title": "Sahih al-Bukhari 5840",
      "narrator": "Narrated `Ali bin Abi Talib:",
      "english_text": "The Prophet (ﷺ) gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore \nit and distributed it among my wives.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 5614,
      "title": "Sahih al-Bukhari 5841",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "`Umar saw a silk suit being sold, so he said, \"O Allah's Messenger (ﷺ)! Why don't you buy it so that you may \nwear it when delegates come to you, and also on Fridays?\" The Prophet (ﷺ) said, \"This is worn only by \nhim who has no share in the Hereafter.\" Afterwards the Prophet (ﷺ) sent to `Umar a silk suit suitable for \nwearing. `Umar said to the Prophet, \"You have given it to me to wear, yet I have heard you saying \nabout it what you said?\" The Prophet (ﷺ) said, \"I sent it to you so that you might either sell it or give it to \nsomebody else to wear.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 5615,
      "title": "Sahih al-Bukhari 5842",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "that he had seen Um Kulthum, the daughter of Allah's Messenger (ﷺ) , wearing a red silk garment.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 5616,
      "title": "Sahih al-Bukhari 5843",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "For one year I wanted to ask `Umar about the two women who helped each other against the Prophet (ﷺ) \nbut I was afraid of him. One day he dismounted his riding animal and went among the trees of Arak to \nanswer the call of nature, and when he returned, I asked him and he said, \"(They were) `Aisha and \nHafsa.\" Then he added, \"We never used to give significance to ladies in the days of the Pre-lslamic \nperiod of ignorance, but when Islam came and Allah mentioned their rights, we used to give them \ntheir rights but did not allow them to interfere in our affairs. \nOnce there was some dispute between me and my wife and she answered me back in a loud voice. I \nsaid to her, 'Strange! You can retort in this way?' She said, 'Yes. Do you say this to me while your \ndaughter troubles Allah's Messenger (ﷺ)?' So I went to Hafsa and said to her, 'I warn you not to disobey \nAllah and His Apostle.' I first went to Hafsa and then to Um Salama and told her the same. She said to \nme, 'O `Umar! It surprises me that you interfere in our affairs so much that you would poke your nose \neven into the affairs of Allah's Messenger (ﷺ) and his wives.' So she rejected my advice. There was an Ansari \nman; whenever he was absent from Allah's Messenger (ﷺ) and I was present there, I used to convey to him \nwhat had happened (on that day), and when I was absent and he was present there, he used to convey \nto me what had happened as regards news from Allah's Messenger (ﷺ) . \nDuring that time all the rulers of the nearby lands had surrendered to Allah's Messenger (ﷺ) except the king \nof Ghassan in Sham, and we were afraid that he might attack us. All of a sudden the Ansari came and \nsaid, 'A great event has happened!' I asked him, 'What is it? Has the Ghassani (king) come?' He said, \n'Greater than that! Allah's Messenger (ﷺ) has divorced his wives! I went to them and found all of them \nweeping in their dwellings, and the Prophet (ﷺ) had ascended to an upper room of his. At the door of the \nroom there was a slave to whom I went and said, \"Ask the permission for me to enter.\" He admitted \nme and I entered to see the Prophet (ﷺ) lying on a mat that had left its imprint on his side. Under his head \nthere was a leather pillow stuffed with palm fires. Behold! There were some hides hanging there and \nsome grass for tanning. Then I mentioned what I had said to Hafsa and Um Salama and what reply \nUm Salama had given me. Allah's Messenger (ﷺ) smiled and stayed there for twenty nine days and then \ncame down.\" (See Hadith No. 648, Vol. 3 for details)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 5617,
      "title": "Sahih al-Bukhari 5844",
      "narrator": "Narrated Um Salama:",
      "english_text": "One night the Prophet (ﷺ) woke up, saying, \"None has the right to be worshipped but Allah! How many \nafflictions have been sent down tonight, and how many treasures have been sent down (disclosed)! \nWho will go and wake up (for prayers) the lady dwellers of these rooms? Many well dressed soul \n(people) in this world, will be naked on the Day of Resurrection.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 5618,
      "title": "Sahih al-Bukhari 5845",
      "narrator": "Narrated Um Khalid bint Khalid:",
      "english_text": "Some clothes were presented to Allah's Messenger (ﷺ) as a gift and there was a black Khamisa with it. The \nProphet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept \nquiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with \nhis own hands and said twice, \"May you live so long that you will wear out many garments.\" He then \nstarted looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in \nEthiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me \nthat she had seen the Khamisa worn by Um Khalid.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 5619,
      "title": "Sahih al-Bukhari 5846",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) forbade men to use saffron.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 5620,
      "title": "Sahih al-Bukhari 5847",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) forbade Muhrims to wear clothes dyed with Wars or saffron.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 5621,
      "title": "Sahih al-Bukhari 5848",
      "narrator": "Narrated Al-Bara:",
      "english_text": "The Prophet (ﷺ) was of a modest height. I saw him wearing a red suit, and I did not see anything better \nthan him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 5622,
      "title": "Sahih al-Bukhari 5849",
      "narrator": "Narrated Al-Bara:",
      "english_text": "The Prophet (ﷺ) ordered us to observe seven things: To visit the sick; follow funeral processions; say \n'May Allah bestow His Mercy on you', to the sneezer if he says, 'Praise be to Allah!; He forbade us to \nwear silk, Dibaj, Qassiy and Istibarq (various kinds of silken clothes); or to use red Mayathir (silkcushions). \n(See Hadith No. 253 A, Vol. 8).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 5623,
      "title": "Sahih al-Bukhari 5850",
      "narrator": "Narrated Sa`id Abu Maslama:",
      "english_text": "I asked Anas (bin Malik), \"Did the Prophet (ﷺ) use to offer the prayers with his shoes on?\" He said, \n\"Yes.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 5624,
      "title": "Sahih al-Bukhari 5851",
      "narrator": "Narrated Sa`id Al-Maqburi:",
      "english_text": "'Ubai bin Juraij said to `Abdullah Ben `Umar, \"I see you doing four things which are not done by your \nfriends.\" Ibn `Umar said, \"What are they, O Ibn Juraij?\" He said, \"I see that you do not touch except \nthe two Yemenite corners of the Ka`ba (while performing the Tawaf): and I see you wearing the \nSabtiyya shoes; and I see you dyeing (your hair) with Sufra; and I see that when you are in Mecca, the \npeople assume the state of Ihram on seeing the crescent (on the first day of Dhul-Hijja) while you do \nnot assume the state of Ihram till the Day of Tarwiya (8th Dhul Hijja).\" `Abdullah bin `Umar said to \nhim, \"As for the corners of the Ka`ba, I have not seen Allah's Messenger (ﷺ) touching except the two \nYemenite corners, As for the Sabtiyya shoes, I saw Allah's Messenger (ﷺ) wearing leather shoes that had no \nhair, and he used to perform the ablution while wearing them. Therefore, I like to wear such shoes. As \nregards dyeing with Sufra, I saw Allah's Messenger (ﷺ) dyeing his hair with it, so I like to dye (my hair) with \nit. As regards the crescent (of Dhul-Hijja), I have not seen Allah's Messenger (ﷺ) assuming the state of Ihram \ntill his she-camel set out (on the 8th of Dhul-Hijja).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 5625,
      "title": "Sahih al-Bukhari 5852",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "Allah's Messenger (ﷺ) forbade that a Muhrim should wear clothes dyed with Saffron or Wars, and said, \n\"Whoever has no shoes can put on Khuffs (socks made from thick fabric or leather) after cutting it \nbelow the ankles.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 5626,
      "title": "Sahih al-Bukhari 5853",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) said, \"Whoever has no Izar (waist sheet), can wear trousers; and whoever has no sandals, \ncan wear Khuffs (socks made from thick fabric or leather, but cut them short below the ankles).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 5627,
      "title": "Sahih al-Bukhari 5854",
      "narrator": "Narrated `Aisha:",
      "english_text": "The Prophet (ﷺ) used to like starting from the right in performing ablution, combing his hair and putting \non his shoes.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 5628,
      "title": "Sahih al-Bukhari 5855",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) said, \"If you want to put on your shoes, put on the right shoe first; and if you want to \ntake them off, take the left one first. Let the right shoe be the first to be put on and the last to be taken \noff.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 5629,
      "title": "Sahih al-Bukhari 5856",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) said, \"None of you should walk, wearing one shoe only; he should either put on both \nshoes or put on no shoes whatsoever.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 5630,
      "title": "Sahih al-Bukhari 5857",
      "narrator": "Narrated Anas:",
      "english_text": "The sandal of the Prophet (ﷺ) had two straps.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 5631,
      "title": "Sahih al-Bukhari 5858",
      "narrator": "Narrated Isaa bin Tahman:",
      "english_text": "Anas bin Malik brought out for us, two sandals having two straps. Thabit Al-Banani said, \"These were \nthe sandals of the Prophet (ﷺ) .\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 5632,
      "title": "Sahih al-Bukhari 5859",
      "narrator": "Narrated Abu Juhaifa:",
      "english_text": "I came to the Prophet (ﷺ) while he was inside a red leather tent, and I saw Bilal taking the remaining \nwater of the ablution of the Prophet, and the people were taking of that water and rubbing it on their \nfaces; and whoever could not get anything of it, would share the moisture of the hand of his \ncompanion (and then rub it on his face).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 5633,
      "title": "Sahih al-Bukhari 5860",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The Prophet (ﷺ) called for the Ansar and gathered them in a leather tent.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 5634,
      "title": "Sahih al-Bukhari 5861",
      "narrator": "Narrated `Aisha:",
      "english_text": "The Prophet (ﷺ) used to construct a loom with a Hasir at night m order to pray therein, and during the day \nhe used to spread it out and sit on it. The people started coming to the Prophet (ﷺ) at night to offer the \nprayer behind him When their number increased, the Prophet (ﷺ) faced them and said. O people! Do only \nthose good deeds which you can do, for Allah does not get tired (of giving reward) till you get tired, \nand the best deeds to Allah are the incessant ones though they were few.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 5635,
      "title": "Sahih al-Bukhari 5862",
      "narrator": "Narrated Al-Miswar bin Makhrama:",
      "english_text": "My father, Makhrama said to me, \"I have come to know that some cloaks have come to the Prophet (ﷺ) and he is distributing them. So O my son! take me to him.\" We went to the Prophet (ﷺ) and found him in the house. My father said to me, \"O my son! Call the Prophet (ﷺ) for me.\" I found it hard to do so, so I said surprisingly, \"Shall I call Allah's Messenger (ﷺ) for you ?\" My father said, \"O mu son! He is not a tyrant.\" So I called him and he came out wearing a Dibaj cloak having gold buttons, and said: \"O Makhrama, I kept this for you.\" The Prophet (ﷺ) then gave it to him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 5636,
      "title": "Sahih al-Bukhari 5863",
      "narrator": "Narrated Al-Bara' bin `Azib:",
      "english_text": "The Prophet (ﷺ) forbade us to use seven things: He forbade using gold rings, silk, Istabraq, Dibaj, red \nMayathir, Al-Qassiy, and silver utensils. He ordered us to do seven other things. To pay a visit to the \nsick; to follow funeral processions; to say, \"May Allah be merciful to you\" to a sneezer if he says \n\"Praise be to Allah\"; to return greetings, to accept invitations; to help others to fulfil their oaths and to \nhelp the oppressed ones.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 5637,
      "title": "Sahih al-Bukhari 5864",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) forbade the wearing of a gold ring.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 5638,
      "title": "Sahih al-Bukhari 5865",
      "narrator": "Narrated `Abdullah:",
      "english_text": "Allah's Messenger (ﷺ) wore a gold or silver .. ring and placed its stone towards the palm of his hand. The \npeople also started wearing gold rings like it, but when the Prophet (ﷺ) saw them wearing such rings, he \nthrew away that golden ring and then wore a silver ring.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 5639,
      "title": "Sahih al-Bukhari 5866",
      "narrator": "Narrated Ibn. `Umar:",
      "english_text": "Allah's Messenger (ﷺ) wore a gold ring or a silver ring and placed its stone towards the palm of his hand \nand had the name 'Muhammad, the Messenger of Allah' engraved on it. The people also started wearing \ngold rings like it, but when the Prophet (ﷺ) saw them wearing such rings, he threw away his own ring \nand said. \"I will never wear it,\" and then wore a silver ring, whereupon the people too started wearing \nsilver rings. Ibn `Umar added: After the Prophet (ﷺ) Abu Bakr wore the ring, and then `Umar and then \n`Uthman wore it till it fell in the Aris well from `Uthman.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 5640,
      "title": "Sahih al-Bukhari 5867",
      "narrator": "Narrated Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) wore a gold \nring, then he threw it and said, \"I will never wear it.\" The people also threw their (gold) rings.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 5641,
      "title": "Sahih al-Bukhari 5868",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "that he saw a silver ring on the hand of Allah's Messenger (ﷺ) for one day only. Then the people had silver \nrings made for themselves and wore it. On that, Allah's Messenger (ﷺ) threw away their rings as well. (For \nthe details of this Hadith, see Fath-ul-Bari, Vol. 12, page 438).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 5642,
      "title": "Sahih al-Bukhari 5869",
      "narrator": "Narrated Humaid:",
      "english_text": "Anas was asked, \"Did the Prophet (ﷺ) wear a ring?\" Anas said, \"Once he delayed the: `Isha' prayer till \nmidnight. Then he came, facing us ..... as if l am now Looking at the glitter of his ring ..... and said, \n\"The people have offered their prayers and slept but you have been in prayer as you have been waiting \nfor it.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 5643,
      "title": "Sahih al-Bukhari 5870",
      "narrator": "Narrated Anas:",
      "english_text": "The ring of the Prophet (ﷺ) was of silver, and its stone was of silver too.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 5644,
      "title": "Sahih al-Bukhari 5871",
      "narrator": "Narrated Sahl:",
      "english_text": "A woman came to the Prophet (ﷺ) and said, \"I have come to present myself to you (for marriage).\" She \nkept standing for a long period during which period the Prophet (ﷺ) looked at her carefully. When she \nstayed for a Long period, a man said to the Prophet (ﷺ) \"If you are not in need of her, then marry her to \nme.\" The Prophet (ﷺ) said, \"Have you got anything to give her (as Mahr)?\" The man said, \"No.\" The \nProphet said, \"Go (to your house) and search for something.\" The man went and came back to say, \n\"By Allah, I could not find anything.\" The Prophet (ﷺ) said, \"Go again and search for something, even if \nit be an iron ring.\" He went again and came back saying, \"No, by Allah, I could not get even an iron \nring.\" The man had only an Izar and had no Rida' (upper garment). He said, \"I will give her my Izar \nas Mahr.\" On that the Prophet (ﷺ) said, \"Your Izar? If she wears it, nothing of it will remain on you, \nand if you wear it nothing of it will be on her\" The man went aside and sat down When the Prophet (ﷺ) \nsaw him leaving (after a while), he called back and asked. \"How much Qur'an do you know (by \nheart)? He said, 'I know such and such Suras,\" naming some Suras. The Prophet (ﷺ) said, \"I marry \nher to you for the amount of Qur'an you know (by heart).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 5645,
      "title": "Sahih al-Bukhari 5872",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Allah's Messenger (ﷺ) wanted to write a letter to a group of people or some non-Arabs. It was said to him, \n\"They do not accept any letter unless it is stamped.\" So the Prophet (ﷺ) had a silver ring made for himself, \nand on it was engraved: 'Muhammad, the Messenger of Allah'. .. as if I am now looking at the glitter of \nthe ring on the finger (or in the palm) of the Prophet (ﷺ) .",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 5646,
      "title": "Sahih al-Bukhari 5873",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "Allah's Messenger (ﷺ) had a silver ring made for himself and it was worn by him on his hand. Afterwards it \nwas worn by Abu Bakr, and then by `Umar, and then by `Uthman till it fell in the Aris well. (On that \nring) was engraved: 'Muhammad, the Messenger of Allah.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 5647,
      "title": "Sahih al-Bukhari 5874",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) got a ring made for himself and said, \"I have got a ring made (for myself) and engraved \na certain engraving on it so none of you should get such an engraving on his ring.\" I saw the glitter of \nthe ring on his little finger.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 5648,
      "title": "Sahih al-Bukhari 5875",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "When the Prophet (ﷺ) intended to write to the Byzantines, it was said to him, \"Those people do not \nread your letter unless it is stamped.\" So the Prophet (ﷺ) took a silver ring and got 'Muhammad, the \nApostle of Allah' engraved on it .... as if I am now looking at its glitter in his hand.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 5649,
      "title": "Sahih al-Bukhari 5876",
      "narrator": "Narrated `Abdullah:",
      "english_text": "The Prophet (ﷺ) had a golden ring made for himself, and when he wore it. he used to turn its stone toward \nthe palm of his! hand. So the people too had gold made for themselves. The Prophet (ﷺ) then ascended \nthe pulpit, and after glorifying and praising Allah, he said, \"I had it made for me, but now I will never \nwear it again.\" He threw it away, and then the people threw away their rings too. (Juwairiya, a subnarrator, \nsaid: I think Anas said that the Prophet (ﷺ) was wearing the ring in his right hand.)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 5650,
      "title": "Sahih al-Bukhari 5877",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Allah's Messenger (ﷺ) took a silver ring and had 'Muhammad, the Apostle' of Allah' engraved on it. The \nProphet then said (to us), 'I have a silver ring with 'Muhammad, the Messenger of Allah engraved on it, \nso none of you should have the same engraving on his ring.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 5651,
      "title": "Sahih al-Bukhari 5878",
      "narrator": "Narrated Anas:",
      "english_text": "that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's \nring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, \nand 'Allah' in a third line.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 5652,
      "title": "Sahih al-Bukhari 5879",
      "narrator": "Anas added:",
      "english_text": "The ring of the Prophet (ﷺ) was in his hand, and after him, in \nAbu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he \nwas sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, \ndropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, \nand finally the well was drained, but the ring was not found.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 5653,
      "title": "Sahih al-Bukhari 5880",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "I offered the `Id prayer with the Prophet (ﷺ) and he offered prayer before the Khutba (sermon). ibn `Abbas \nadded: After the prayer the Prophet (ﷺ) came towards (the rows of) the women and ordered them to give \nalms, and the women started putting their big and small rings in the garment of Bilal.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 5654,
      "title": "Sahih al-Bukhari 5881",
      "narrator": "Narrated ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) came out on the day of `Id and offered a two-rak`at prayer, and he did not pray any \nrak`a before it, nor after it. Then he went towards the women and ordered them to give alms. The \nwomen started donating their earring and necklaces.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 5655,
      "title": "Sahih al-Bukhari 5882",
      "narrator": "Narrated `Aisha:",
      "english_text": "A necklace belonging to Asma' was lost, and the Prophet (ﷺ) sent men in its search. The time for the \nprayer became due and they were without ablution and they could not find water; therefore they \nprayed without ablution, They mentioned that to the Prophet (ﷺ) . Then Allah revealed the Verse of \nTayammum. (`Aisha added: that she had borrowed (the necklace) from Asma').",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 5656,
      "title": "Sahih al-Bukhari 5883",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "\"The Prophet (ﷺ) offered a two-rak`at prayer on `Id day and he did not offer any (Nawafil prayer) \nbefore or after it. He then went towards the women, and Bilal was accompanying him, and ordered \nthem to give alms. And so the women started giving their earrings (etc .).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 5657,
      "title": "Sahih al-Bukhari 5884",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "I was with Allah's Messenger (ﷺ) in one of the Markets of Medina. He left (the market) and so did I. Then he \nasked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin \n`Ali got up and started walking with a necklace (of beads) around his neck. The Prophet (ﷺ) stretched \nhis hand out like this, and Al-Hasan did the same. The Prophet (ﷺ) embraced him and said, \"0 Allah! l \nlove him, so please love him and love those who love him.\" Since Allah's Messenger (ﷺ) said that. nothing \nhas been dearer to me than Al-Hasan.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 5658,
      "title": "Sahih al-Bukhari 5885",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "Allah's Messenger (ﷺ) cursed those men who are in the similitude (assume the manners) of women and those \nwomen who are in the similitude (assume the manners) of men.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 5659,
      "title": "Sahih al-Bukhari 5886",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) cursed effeminate men (those men who are in the similitude (assume the manners of \nwomen) and those women who assume the manners of men, and he said, \"Turn them out of your \nhouses .\" The Prophet (ﷺ) turned out such-and-such man, and `Umar turned out such-and-such woman.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 5660,
      "title": "Sahih al-Bukhari 5887",
      "narrator": "Narrated Um Salama:",
      "english_text": "that once the Prophet (ﷺ) was in her house, and an effeminate man was there too. The effeminate man \nsaid to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I \nrecommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her \nbelly) and eight at the back.\" So the Prophet (ﷺ) said (to his wives) \"These effeminate (men) should not \nenter upon you (your houses).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 5661,
      "title": "Sahih al-Bukhari 5888",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) said, \"To get the moustaches cut 'short is characteristic of the Fitra.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 5662,
      "title": "Sahih al-Bukhari 5889",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Five practices are characteristics of the Fitra: circumcision, shaving the \npubic region, clipping the nails and cutting the moustaches short.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 5663,
      "title": "Sahih al-Bukhari 5890",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"To shave the pubic hair. to clip the nails and to cut the moustaches short, are \ncharacteristics of the Fitra.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 5664,
      "title": "Sahih al-Bukhari 5891",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "I heard the Prophet (ﷺ) saying. \"Five practices are characteristics of the Fitra: circumcision, shaving the \npubic hair, cutting the moustaches short, clipping the nails, and depilating the hair of the armpits.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 5665,
      "title": "Sahih al-Bukhari 5892",
      "narrator": "Narrated Nafi`:",
      "english_text": "Ibn `Umar said, The Prophet (ﷺ) said, 'Do the opposite of what the pagans do. Keep the beards and cut the \nmoustaches short.' Whenever Ibn `Umar performed the Hajj or `Umra, he used to hold his beard with \nhis hand and cut whatever remained outside his hold.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 5666,
      "title": "Sahih al-Bukhari 5893",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Cut the moustaches short and leave the beard (as it is).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 5667,
      "title": "Sahih al-Bukhari 5894",
      "narrator": "Narrated Muhammad bin Seereen:",
      "english_text": "I asked Anas, \"Did the Prophet (ﷺ) dye his hair?\" Anas replied, \"The Prophet (ﷺ) did not have except a few \ngrey hairs.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 5668,
      "title": "Sahih al-Bukhari 5895",
      "narrator": "Narrated Thabit:",
      "english_text": "Anas was asked whether the Prophet (ﷺ) used a a hair dye or not. He replied, \"The Prophet (ﷺ) did not have enough grey hair to dye, (such that) if I wanted to count the fading hairs in his beard (I could have).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 5669,
      "title": "Sahih al-Bukhari 5896",
      "narrator": "Narrated IsraiI:",
      "english_text": "`Uthman bin `Abdullah bin Mauhab said, \"My people sent me with a bowl of water to Um Salama.\" \nIsra'il approximated three fingers ('indicating the small size of the container in which there was some \nhair of the Prophet. `Uthman added, \"If any person suffered from evil eye or some other disease, he \nwould send a vessel (containing water) to Um Salama. I looked into the container (that held the hair \nof the Prophet) and saw a few red hairs in it,\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 5670,
      "title": "Sahih al-Bukhari 5897",
      "narrator": "Narrated `Uthman bin `Abdullah bin Mauhab:",
      "english_text": "I went to Um Salama and she brought out for us some of the dyed hair of the Prophet.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 5671,
      "title": "Sahih al-Bukhari 5898",
      "narrator": "",
      "english_text": "Ibn Mauhab \nalso said that Um Salama had shown him the red hair of the Prophet.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 5672,
      "title": "Sahih al-Bukhari 5899",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) said, \"Jews and Christians do not dye their hair so you should do the opposite of what \nthey do.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 5673,
      "title": "Sahih al-Bukhari 5900",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "The Prophet (ﷺ) was neither conspicuously tall, nor short; neither, very white, nor tawny. His hair was \nneither much curled, nor very straight. Allah sent him (as an Apostle) at the age of forty (and after \nthat) he stayed for ten years in Mecca, and for ten more years in Medina. Allah took him unto Him at \nthe age of sixty, and he scarcely had ten white hairs on his head and in his beard.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 5674,
      "title": "Sahih al-Bukhari 5901",
      "narrator": "Narrated Al-Bara':",
      "english_text": "I did not see anybody in a red cloak looking more handsome than the Prophet.\nNarrated Malik: The \nhair of the Prophet (ﷺ) used to hang near his shoulders. Abu Ishaq said, \"I heard him relate it more than once. He always laughed when he related it.\" \nNarrated Shu`ba: The hair of the Prophet (ﷺ) used to \nhang down to the earlobes.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 5675,
      "title": "Sahih al-Bukhari 5902",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Today I saw myself in a dream near the Ka`ba. I saw a whitish brown man, \nthe handsomest of all brown men you might ever see. He had the most beautiful Limma (hair hanging \ndown to the earlobes) you might ever see. He had combed it and it was dripping water; and he was \nperforming the Tawaf around the Ka`ba leaning on two men or on the shoulders of two men. l asked, \n\"Who is this?\" It was said. \"Messiah, the son of Mary.\" Suddenly I saw a curly-haired man, blind in \nthe right eye which looked like a protruding out grape. I asked, \"Who is this?\" It was said, \"He is \nMasiah Ad-Dajjal.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 5676,
      "title": "Sahih al-Bukhari 5903",
      "narrator": "Narrated Anas :",
      "english_text": "The hair of the Prophet (ﷺ)   used to hang down up to his shoulders.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 5677,
      "title": "Sahih al-Bukhari 5904",
      "narrator": "Narrated Anas:",
      "english_text": "The head-hair of the Prophet (ﷺ) used to hang down to his shoulders.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 5678,
      "title": "Sahih al-Bukhari 5905",
      "narrator": "Narrated Qatada:",
      "english_text": "l asked Anas bin Malik about the hair of Allah's Messenger (ﷺ). He said, \"The hair of Allah's Messenger (ﷺ) \nwas neither much straight, nor much curly, and it used to hang down till between his shoulders and his \nearlobes.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 5679,
      "title": "Sahih al-Bukhari 5906",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) had big hands, and I have never seen anybody like him after him. The hair of the \nProphet was wavy, neither curly nor straight.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 5680,
      "title": "Sahih al-Bukhari 5907",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) had big hands and feet, and I have not seen anybody like him, neither before nor after \nhim, and his palms were soft.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 5681,
      "title": "Sahih al-Bukhari 5908, 5909",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) had big feet and a good-looking face and l have not seen anybody like him after him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 5682,
      "title": "Sahih al-Bukhari 5910",
      "narrator": "Narrated Anas:",
      "english_text": "The Prophet (ﷺ) had big feet and hands.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 5683,
      "title": "Sahih al-Bukhari 5911, 5912",
      "narrator": "Narrated Anas or Jabir bin `Abdullah:",
      "english_text": "The Prophet (ﷺ) \nhad big hands and feet and I have not seen anybody like him after him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 5684,
      "title": "Sahih al-Bukhari 5913",
      "narrator": "Narrated Mujahid:",
      "english_text": "We were with Ibn `Abbas and the people mentioned Ad-Dajjal. Someone said, \"The word 'Kafir' \n(unbeliever) is written in between his (Ad-Dajjal's) eyes.\" Ibn `Abbas said, \"I have not heard the \nProphet saying this, but he said, 'As regards Abraham, he looks like your companion (i.e. the Prophet, \nMuhammad), and as regards Moses, he is a brown curly haired man riding a camel and reigned with a \nstrong jute rope, as if I am now looking at him getting down in the valley and saying, \"Labbaik\".'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 5685,
      "title": "Sahih al-Bukhari 5914",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "I heard `Umar saying, \"Whoever braids his hair should shave it (on finishing lhram). You'd better not \ndo, something like Talbid.\" Ibn `Umar used to say: \"I saw Allah's Messenger (ﷺ) with his hair stuck \ntogether with gum.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 5686,
      "title": "Sahih al-Bukhari 5915",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "I heard Allah's Messenger (ﷺ), while he was in the state of lhram and his hair was stuck together with gum, \nsaying, \"Labbaik, Allahumma Labbaik, Labbaik La Sharika laka Labbaik. Inn-al-Hamda Wan-Ni'mata \nLaka wal-Mulk, La Sharika Lak.\" He did not add anything to those words.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 5687,
      "title": "Sahih al-Bukhari 5916",
      "narrator": "Narrated Hafsa:",
      "english_text": "(the wife of the Prophet) I said, \"O Allah's Messenger (ﷺ)! Why have the people finished their Ihram after \nperforming the `Umra while you have not finished your lhram after your `Umra?\" He said, \"I have \ndone Talbid (of my hair) and have decorated my Hadis with garlands, so I shall not finish my lhram \ntill l have slaughtered my Hadi (animal for sacrifice).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 5688,
      "title": "Sahih al-Bukhari 5917",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) used to copy the people of the Scriptures in matters in which there was no order from \nAllah. The people of the Scripture used to let their hair hang down while the pagans used to part their \nhair. So the Prophet (ﷺ) let his hair hang down first, but later on he parted it.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 5689,
      "title": "Sahih al-Bukhari 5918",
      "narrator": "Narrated `Aisha:",
      "english_text": "As if I am now looking at the shine of the hair parting of the Prophet (ﷺ) while he was in the state of \nlhram.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 5690,
      "title": "Sahih al-Bukhari 5919",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "Once I stayed overnight in the house of my aunt Maimuna bint Al-Harith and Allah's Messenger (ﷺ) was \nwith her as it was her turn. Allah's Messenger (ﷺ) got up to offer the night prayer. I stood on his left but he \ntook hold of my two locks of hair and made me stand on his right.\nNarrated Abu Bishr:\n\n(the above Hadith) but he quoted: Ibn `Abbas said, (took hold of) my two braids on my head.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 5691,
      "title": "Sahih al-Bukhari 5920",
      "narrator": "Narrated Ubaidullah bin Hafs:",
      "english_text": "that `Umar bin Nafi` told him that Nafi`, Maula `Abdullah had heard `Umar saying, \"I heard Allah's \nApostle forbidding Al-Qaza'.\" 'Ubaidullah added: I said, \"What is Al-Qaza'?\" 'Ubaidullah pointed \n(towards his head) to show us and added, \"Nafi` said, 'It is when a boy has his head shaved leaving a \ntuft of hair here and a tuft of hair there.\" Ubaidullah pointed towards his forehead and the sides of his \nhead. 'Ubaidullah was asked, \"Does this apply to both girls and boys?\" He said, \"I don't know, but \nNafi` said, 'The boy.'\" 'Ubaidullah added, \"I asked Nafi` again, and he said, 'As for leaving hair on \nthe temples and the back part of the boy's head, there is no harm, but Al-Qaza' is to leave a tuft of hair \non his forehead unshaved while there is no hair on the rest of his head, and also to leave hair on either \nside of his head.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 5692,
      "title": "Sahih al-Bukhari 5921",
      "narrator": "Narrated (Abdullah) bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) forbade Al-Qaza' (leaving a tuft of hair here and there after shaving one's head.)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 5693,
      "title": "Sahih al-Bukhari 5922",
      "narrator": "Narrated `Aisha:",
      "english_text": "I applied perfume to the Prophet (ﷺ) with my own hands when he wanted to assume the state of Ihram, \nand I also perfumed him at Mina before he departed from there (to perform Tawaf-al-Ifada).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 5694,
      "title": "Sahih al-Bukhari 5923",
      "narrator": "Narrated `Aisha:",
      "english_text": "I used to perfume Allah's Messenger (ﷺ) with the best scent available till I saw the shine of the scent on his \nhead and shine beard.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 5695,
      "title": "Sahih al-Bukhari 5924",
      "narrator": "Narrated Sa`d:",
      "english_text": "A man peeped into the house of the Prophet (ﷺ) through a hole while the Prophet (ﷺ) was scratching his head \nwith a Midrai (a certain kind of comb). On that the Prophet (ﷺ) said (to him), \"If I had known you had \nbeen looking, then I would have pierced your eye with that instrument, because the asking of \npermission has been ordained so that one would not see things unlawfully.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 5696,
      "title": "Sahih al-Bukhari 5925",
      "narrator": "Narrated `Aisha:",
      "english_text": "I used to comb the hair of Allah's Messenger (ﷺ) during my periods.\n\nThis hadith also reaches us through another chain",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 5697,
      "title": "Sahih al-Bukhari 5926",
      "narrator": "'Narrated `Aisha:",
      "english_text": "The Prophet (ﷺ) used to like to start from the right side as far as possible in combing and in performing \nablution.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 5698,
      "title": "Sahih al-Bukhari 5927",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) said, \"(Allah said), 'Every good deed of Adam's son is for him except fasting; it is for \nMe. and I shall reward (the fasting person) for it.' Verily, the smell of the mouth of a fasting person is \nbetter to Allah than the smell of musk.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 5699,
      "title": "Sahih al-Bukhari 5928",
      "narrator": "Narrated `Aisha:",
      "english_text": "used to perfume the Prophet (ﷺ) before his assuming the state of with the best scent available.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 5700,
      "title": "Sahih al-Bukhari 5929",
      "narrator": "Narrated Thumama bin `Abdullah;:",
      "english_text": "Anas never used to refuse (a gift of) scent and used to say that the Prophet (ﷺ) never used to refuse (a \ngift of) scent.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 5701,
      "title": "Sahih al-Bukhari 5930",
      "narrator": "Narrated `Aisha:",
      "english_text": "During Hajjat-al-Wada`, I perfumed Allah's Messenger (ﷺ) with Dharira with my own hands, both on his \nassuming Ihram and on finishing it.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 5702,
      "title": "Sahih al-Bukhari 5931",
      "narrator": "Narrated `Abdullah:",
      "english_text": "Allah has cursed those women who practise tattooing and those who get themselves tattooed, and \nthose who remove their face hairs, and those who create a space between their teeth artificially to look \nbeautiful, and such women as change the features created by Allah. Why then should I not curse those \nwhom the Prophet (ﷺ) has cursed? And that is in Allah's Book. i.e. His Saying: 'And what the Apostle \ngives you take it and what he forbids you abstain (from it).' (59.7)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 5703,
      "title": "Sahih al-Bukhari 5932",
      "narrator": "Narrated Humaid bin `Abdur-Rahman bin `Auf:",
      "english_text": "that in the year he performed Hajj. he heard Mu'awiya bin Abi Sufyan, who was on the pulpit and was \ntaking a tuft of hair from one of his guards, saying, \"Where are your religious learned men? I heard \nAllah's Messenger (ﷺ) forbidding this (false hair) and saying, 'The children of Israel were destroyed when \ntheir women started using this.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 5704,
      "title": "Sahih al-Bukhari 5933",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (ﷺ) said, \"Allah has cursed the \nlady who artificially lengthens (her or someone else's) hair and the one who gets her hair lengthened \nand the One who tattoos (herself or someone else) and the one who gets herself tattooed\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 5705,
      "title": "Sahih al-Bukhari 5934",
      "narrator": "Narrated `Aisha:",
      "english_text": "An Ansari girl was married and she became sick and all her hair fell out intending to provide her \nwith false hair. They asked the Prophet (ﷺ) who said, \"Allah has cursed the lady who artificially \nlengthens (her or someone else's) hair and also the one who gets her hair lengthened.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 5706,
      "title": "Sahih al-Bukhari 5935",
      "narrator": "Narrated Asma:",
      "english_text": "(the daughter of Abu' Bakr) A woman came to Allah's Messenger (ﷺ) and said, \"I married my daughter to \nsomeone, but she became sick and all her hair fell out, and (because of that) her husband does not like \nher. May I let her use false hair?\" On that the Prophet (ﷺ) cursed such a lady as artificially lengthening \n(her or someone else's) hair or got her hair lengthened artificially.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 5707,
      "title": "Sahih al-Bukhari 5936",
      "narrator": "Narrated Asma':",
      "english_text": "(the daughter of Abu Bakr) Allah's Messenger (ﷺ) has cursed such a lady as artificially lengthening (her or \nsomeone else's) hair or gets her hair lengthened.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 5708,
      "title": "Sahih al-Bukhari 5937",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Allah has cursed such a lady as lengthens (her or someone else's) hair \nartificially or gets it lengthened, and also a lady who tattoos (herself or someone else) or gets herself \ntattooed.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 5709,
      "title": "Sahih al-Bukhari 5938",
      "narrator": "Narrated Sa`id bin Al-Musaiyab:",
      "english_text": "Mu'awiya came to Medina for the last time and delivered a sermon. He took out a tuft of hair and said, \n\"I thought that none used to do this (i.e. use false hair) except Jews. The Prophet (ﷺ) labelled such \npractice, (i.e. the use of false hair), as cheating.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 5710,
      "title": "Sahih al-Bukhari 5939",
      "narrator": "Narrated 'Alqama:",
      "english_text": "`Abdullah cursed those women who practiced tattooing and those who removed hair from their faces \nand those who created spaces between their teeth artificially to look beautiful, such ladies as changed \nwhat Allah has created. Um Ya'qub said, \"What is that?\" `Abdullah said, \"Why should I not curse \nthose who were cursed by Allah's Messenger (ﷺ) and are referred to in Allah's Book?\" She said to him \"By \nAllah, I have read the whole Qur'an but I have not found such a thing. `Abdullah said, \"By Allah, \nif you had read it (carefully) you would have found it. (Allah says:) 'And what the Apostle gives you \ntake it and what he forbids you abstain (from it).' (59.7)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 5711,
      "title": "Sahih al-Bukhari 5940",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens her hair artificially and the one who gets her hair \nlengthened, and also the lady who tattoos (herself or others) and the one who gets herself tattooed.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 5712,
      "title": "Sahih al-Bukhari 5941",
      "narrator": "Narrated Asma':",
      "english_text": "A woman asked the Prophet (ﷺ) saying, \"0 Allah's Messenger (ﷺ)! My daughter got measles and her hair fell \nout. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the \nlady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 5713,
      "title": "Sahih al-Bukhari 5942",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "I heard the Prophet (ﷺ) saying, (or the Prophet (ﷺ) said), \"Allah has cursed the lady who practices tattooing \nand that who gets it done for herself, and also the lady who lengthens hair artificially and that who \ngets her hair lengthened artificially.\" The Prophet (ﷺ) has cursed such ladies.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 5714,
      "title": "Sahih al-Bukhari 5943",
      "narrator": "Narrated Ibn Mas`ud:",
      "english_text": "Allah has cursed those women who practise tattooing or get it done for themselves, and those who \nremove hair from their faces, and those who create spaces between their teeth artificially to look \nbeautiful, such ladies as change the features created by Allah. Why then shall I not curse those whom \nAllah's Messenger (ﷺ) has cursed and who are cursed in Allah's Book too?",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 159,
      "hadithNum_inBook": 5715,
      "title": "Sahih al-Bukhari 5944",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "Allah's Messenger (ﷺ) said, \"The evil eye is a fact,\" and he forbade tattooing.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 160,
      "hadithNum_inBook": 5716,
      "title": "Sahih al-Bukhari 5944b",
      "narrator": "Narrated `Abdullah:",
      "english_text": "(As above 827).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 161,
      "hadithNum_inBook": 5717,
      "title": "Sahih al-Bukhari 5945",
      "narrator": "Narrated Abu Juhaifa:",
      "english_text": "The Prophet (ﷺ) forbade the use of the price of blood and the price of a dog, the one who takes (eats) \nusury the one who gives usury, the woman who practises tattooing and the woman who gets herself \ntattooed.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 162,
      "hadithNum_inBook": 5718,
      "title": "Sahih al-Bukhari 5946",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "A woman who used to practise tattooing was brought to `Umar. `Umar got up and said, \"I beseech you \nby Allah, which of you heard the Prophet (ﷺ) saying something about tattooing?\" l got up and said, \"0 \nchief of the Believers! l heard something.\" He said, \"What did you hear?\" I said, \"I heard the \nProphet (addressing the ladies), saying, 'Do not practise tattooing and do not get yourselves tattooed.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 163,
      "hadithNum_inBook": 5719,
      "title": "Sahih al-Bukhari 5947",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) has cursed the lady who lengthens hair artificially and that who gets her hair lengthened \nin such away, and the lady who practises tattooing and that who gets it done for herself.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 164,
      "hadithNum_inBook": 5720,
      "title": "Sahih al-Bukhari 5948",
      "narrator": "Narrated `Abdullah:",
      "english_text": "Allah has cursed those women who practise tattooing and those who get it done for themselves, and \nthose who remove hair from their faces, and those who artificially create spaces between their teeth to \nlook beautiful, such women as alter the features created by Allah. Why should I not then curse those \nwhom Allah's Messenger (ﷺ) has cursed and that is in Allah's Book?",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 165,
      "hadithNum_inBook": 5721,
      "title": "Sahih al-Bukhari 5949",
      "narrator": "Narrated Abu Talha:",
      "english_text": "The Prophet (ﷺ) said, \"Angels do not enter a house in which there is a dog or there are pictures.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 166,
      "hadithNum_inBook": 5722,
      "title": "Sahih al-Bukhari 5950",
      "narrator": "Narrated Muslim:",
      "english_text": "We were with Masruq at the house of Yasar bin Numair. Masruq saw pictures on his terrace and said, \n\"I heard `Abdullah saying that he heard the Prophet (ﷺ) saying, \"The people who will receive the severest \npunishment from Allah will be the picture makers.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 167,
      "hadithNum_inBook": 5723,
      "title": "Sahih al-Bukhari 5951",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Those who make these pictures will be punished on the Day of Resurrection, \nand it will be said to them. 'Make alive what you have created.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 168,
      "hadithNum_inBook": 5724,
      "title": "Sahih al-Bukhari 5952",
      "narrator": "Narrated `Aisha:",
      "english_text": "I never used to leave in the Prophet (ﷺ) house anything carrying images or crosses but he obliterated it.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 169,
      "hadithNum_inBook": 5725,
      "title": "Sahih al-Bukhari 5953",
      "narrator": "Narrated Abu Zur'a:",
      "english_text": "l entered a house in Medina with Abu Huraira, and he saw a man making pictures at the top of the \nhouse. Abu Huraira said, \"I heard Allah's Messenger (ﷺ) saying that Allah said, 'Who would be more unjust \nthan the one who tries to create the like of My creatures? Let them create a grain: let them create a \ngnat.' \"Abu Huraira then asked for a water container and washed his arms up to his armpits. I said, \"0 \nAbu i Huraira! Is this something you have heard I from Allah's Messenger (ﷺ)?\" He said, \"The limit for \nablution is up to the place where the ornaments will reach on the Day of Resurrection.'",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 170,
      "hadithNum_inBook": 5726,
      "title": "Sahih al-Bukhari 5954",
      "narrator": "Narrated `Aisha:",
      "english_text": "Allah's Messenger (ﷺ) returned from a journey when I had placed a curtain of mine having pictures over (the \ndoor of) a chamber of mine. When Allah's Messenger (ﷺ) saw it, he tore it and said, \"The people who will \nreceive the severest punishment on the Day of Resurrection will be those who try to make the like of \nAllah's creations.\" So we turned it (i.e., the curtain) into one or two cushions.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 171,
      "hadithNum_inBook": 5727,
      "title": "Sahih al-Bukhari 5955",
      "narrator": "Narrated Aisha:",
      "english_text": "The Prophet (ﷺ) returned from a journey when I had hung a thick curtain having pictures (in front of a \ndoor). He ordered me to remove it and I removed it.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 172,
      "hadithNum_inBook": 5728,
      "title": "Sahih al-Bukhari 5956",
      "narrator": "Aisha added:",
      "english_text": "The Prophet (ﷺ) and I used to take a \nbath from one container (of water).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 173,
      "hadithNum_inBook": 5729,
      "title": "Sahih al-Bukhari 5957",
      "narrator": "Narrated `Aisha:",
      "english_text": "I purchased a cushion with pictures on it. The Prophet (came and) stood at the door but did not enter. \nI said (to him), \"I repent to Allah for what (the guilt) I have done.\" He said, \"What is this cushion?\" I \nsaid, \"It is for you to sit on and recline on.\" He said, \"The makers of these pictures will be punished on \nthe Day of Resurrection and it will be said to them, 'Make alive what you have created.' Moreover, \nthe angels do not enter a house where there are pictures.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 174,
      "hadithNum_inBook": 5730,
      "title": "Sahih al-Bukhari 5958",
      "narrator": "Narrated Abu Talha:",
      "english_text": "Allah's Messenger (ﷺ) said, \"Angels (of mercy) do not enter a house where there are pictures.'\" The subnarrator \nBusr added: \"Then Zaid fell ill and we paid him a visit. Behold! There was, hanging at his \ndoor, a curtain decorated with a picture. I said to 'Ubaidullah Al-Khaulani, the step son of \nMaimuna, the wife of the Prophet (ﷺ) , \"Didn't Zaid tell us about the picture the day before yesterday?\" \n'Ubaidullah said, \"Didn't you hear him saying: 'except a design in a garment'?\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 175,
      "hadithNum_inBook": 5731,
      "title": "Sahih al-Bukhari 5959",
      "narrator": "Narrated Anas:",
      "english_text": "Aisha had a thick curtain (having pictures on it) and she screened the side of her i house with it. \nThe Prophet (ﷺ) said to her, \"Remove it from my sight, for its pictures are still coming to my mind in \nmy prayers.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 176,
      "hadithNum_inBook": 5732,
      "title": "Sahih al-Bukhari 5960",
      "narrator": "Narrated Salim's father:",
      "english_text": "Once Gabriel promised to visit the Prophet (ﷺ) but he delayed and the Prophet (ﷺ) got worried about that. At \nlast he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to \nhim, \"We do not enter a place in which there is a picture or a dog.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 177,
      "hadithNum_inBook": 5733,
      "title": "Sahih al-Bukhari 5961",
      "narrator": "Narrated `Aisha:",
      "english_text": "(the wife of the Prophet) \nI bought a cushion having pictures on it. When Allah's Messenger (ﷺ) saw it, he stopped at the gate and did \nnot enter. I noticed the signs of hatred (for that) on his face! I said, \"O Allah's Messenger (ﷺ)! I turn to Allah \nand His Apostle in repentance! What sin have I committed?\" He said, \"What about this cushion?\" I \nsaid, 'I bought it for you to sit on and recline on.\" Allah's Messenger (ﷺ) said, \"The makers of these pictures \nwill be punished (severely) on the Day of Resurrection and it will be said to them, 'Make alive what \nyou have created.'\" He added, \"Angels do not enter a house in which there are pictures.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 178,
      "hadithNum_inBook": 5734,
      "title": "Sahih al-Bukhari 5962",
      "narrator": "Narrated Abu Juhaifa:",
      "english_text": "that he had bought a slave whose profession was cupping. The Prophet (ﷺ) forbade taking the price of \nblood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave \n(Riba') usury, and the lady who tattooed others or got herself tattooed, and the picture-maker.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 179,
      "hadithNum_inBook": 5735,
      "title": "Sahih al-Bukhari 5963",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "I heard Muhammad saying, \"Whoever makes a picture in this world will be asked to put life into it on \nthe Day of Resurrection, but he will not be able to do so.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 180,
      "hadithNum_inBook": 5736,
      "title": "Sahih al-Bukhari 5964",
      "narrator": "Narrated Usama bin Zaid:",
      "english_text": "Allah's Messenger (ﷺ) rode a donkey saddled with a saddle covered with a Fadakiyya velvet sheet, and he \nmade me ride behind him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 181,
      "hadithNum_inBook": 5737,
      "title": "Sahih al-Bukhari 5965",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "When the Prophet (ﷺ) arrived at Mecca, the children of Bani `Abdul Muttalib received him. He then \nmounted one of them in front of him and the other behind him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 182,
      "hadithNum_inBook": 5738,
      "title": "Sahih al-Bukhari 5966",
      "narrator": "Narrated Aiyub:",
      "english_text": "The worst of three (persons riding one, animal) was mentioned in `Ikrima's presence `Ikrima said, \n\"Ibn `Abbas said, '(In the year of the conquest of Mecca) the Prophet (ﷺ) came and mounted Qutham \nin front of him and Al-Fadl behind him, or Qutham behind him and Al-Fadl in front of him.' Now \nwhich of them was the worst off and which was the best?\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 183,
      "hadithNum_inBook": 5739,
      "title": "Sahih al-Bukhari 5967",
      "narrator": "Narrated Mu`adh bin Jabal:",
      "english_text": "While I was riding behind the Prophet (ﷺ) and between me and him and between me and him there was \nonly the back of the saddle, he said, \"0 Mu`adh!\" I replied, \"Labbaik, 0 Allah's Messenger (ﷺ), and Sa`daik!\" \nhe said, \"Do you know what is Allah's right upon his slave?\" I said, \"Allah and His Apostle know \nbest\" He said \"Allah's right upon his slaves is that they should worship Him alone and not worship \nanything else besides Him.\" Then he proceeded for a while and then said, \"O Mu`adh bin Jabal!\" I \nreplied, \"Labbaik, O Allah's Messenger (ﷺ):, Sa`daik!' He said, \"Do you know what is the right of the \nslaves upon Allah if they do that?\" I replied, \"Allah and His Apostle know best.\" He said, \"The right \nof the slaves upon Allah is that He will not punish them (if they do that).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 184,
      "hadithNum_inBook": 5740,
      "title": "Sahih al-Bukhari 5968",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "We were coming from Khaibar along with Allah's Messenger (ﷺ) while l was riding behind Abu Talha \nand he was proceeding. While one of the wives of Allah's Messenger (ﷺ) was riding behind Allah's Messenger (ﷺ), \nsuddenly the foot of the camel Slipped and I said, \"The woman!\" and alighted (hurriedly). Allah's \nApostle said, \"She is your mother.\" Sol resaddled the she-camel and Allah's Messenger (ﷺ) mounted it. \nWhen he approached or saw Medina, he said, \"Ayibun, ta'ibun, 'abidun, li-Rabbina hami-dun.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 185,
      "hadithNum_inBook": 5741,
      "title": "Sahih al-Bukhari 5969",
      "narrator": "Narrated `Abbad bin Tamim's uncle:",
      "english_text": "I saw the Prophet (ﷺ) lying-down in the mosque and placing one leg on the other.",
      "grade": "none"
    }
  ]
}