{
  "chapterNum": 18,
  "english_title": "Shortening the Prayers (At-Taqseer)",
  "totalHadiths_inChapter": 39,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 1049,
      "title": "Sahih al-Bukhari 1080",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and \nstayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer \nperiod we used to offer the full prayer.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 1050,
      "title": "Sahih al-Bukhari 1081",
      "narrator": "Narrated Yahya bin 'Is-haq:",
      "english_text": "I heard Anas saying, \"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for \nevery prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \n\"We stayed in Mecca for ten days.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 1051,
      "title": "Sahih al-Bukhari 1082",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "I offered the prayer with the Prophet, Abu Bakr and `Umar at Mina and it was of two rak`at. `Uthman \nin the early days of his caliphate did the same, but later on he started praying the full prayer.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 1052,
      "title": "Sahih al-Bukhari 1083",
      "narrator": "Narrated Haritha bin Wahab:",
      "english_text": "The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 1053,
      "title": "Sahih al-Bukhari 1084",
      "narrator": "Narrated `Abdur Rahman bin Yazid:",
      "english_text": "We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed \nabout it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I \nprayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr and with `Umar (during \ntheir caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by \nAllah).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 1054,
      "title": "Sahih al-Bukhari 1085",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "The Prophet (ﷺ) and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya \n(O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. \nThe Prophet (ﷺ) ordered his companions to assume the lhram for Umra instead of Hajj, excepting those \nwho had Hadi (sacrifice) with them.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 1055,
      "title": "Sahih al-Bukhari 1086",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram \n(i.e. a male with whom she cannot marry at all, e.g. her brother, father, grandfather, etc.) or her own \nhusband.)\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 1056,
      "title": "Sahih al-Bukhari 1087",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "The Prophet (ﷺ) said, \"A woman should not travel for more than three days except with a Dhi-Mahram.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 1057,
      "title": "Sahih al-Bukhari 1088",
      "narrator": "Narrated Abu Huraira:",
      "english_text": "The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day \nto travel for one day and night except with a Mahram.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 1058,
      "title": "Sahih al-Bukhari 1089",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "offered four rak`at of Zuhr prayer with the Prophet (p.b.u.h) at Medina and two rak`at at Dhul-Hulaifa. \n(i.e. shortened the `Asr prayer).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 1059,
      "title": "Sahih al-Bukhari 1090",
      "narrator": "Narrated `Aisha:",
      "english_text": "\"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was \nkept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what \nmade Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 1060,
      "title": "Sahih al-Bukhari 1091, 1092",
      "narrator": "Narrated `Abdullah bin `Umar:",
      "english_text": "\"I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he offered it along with the `Isha' prayer \nwhenever he was in a hurry during the journey.\" Salim narrated, \"Ibn `Umar used to do the same \nwhenever he was in a hurry during the journey.\" And Salim added, \"Ibn `Umar used to pray the \nMaghrib and `Isha' prayers together in Al-Muzdalifa.\" Salim said, \"Ibn `Umar delayed the Maghrib \nprayer because at that time he heard the news of the death of his wife Safiya bint Abi `Ubaid. I said to \nhim, 'The prayer (is due).' He said, 'Go on.' Again I said, 'The prayer (is due).' He said, 'Go on,' till we \ncovered two or three miles. Then he got down, prayed and said, 'I saw the Prophet (ﷺ) praying in this way, \nwhenever he was in a hurry during the journey.' `Abdullah (bin `Umar) added, \"Whenever the \nProphet was in a hurry, he used to delay the Maghrib prayer and then offer three rak`at (of the \nMaghrib) and perform Taslim, and after waiting for a short while, Iqama used to be pronounced for \nthe `Isha' prayer when he would offer two rak`at and perform Taslim. He would never offer any \noptional prayer till the middle of the night (when he used to pray the Tahajjud).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 1061,
      "title": "Sahih al-Bukhari 1093",
      "narrator": "Narrated `Abdullah bin 'Amir from his father who said:",
      "english_text": "I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 1062,
      "title": "Sahih al-Bukhari 1094",
      "narrator": "Narrated Jabir bin `Abdullah:",
      "english_text": "The Prophet (ﷺ) used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 1063,
      "title": "Sahih al-Bukhari 1095",
      "narrator": "Narrated Nafi`:",
      "english_text": "Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said \nthat the Prophet (ﷺ) used to do so.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 1064,
      "title": "Sahih al-Bukhari 1096",
      "narrator": "Narrated `Abdullah bin Dinar:",
      "english_text": "On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction \nit took. `Abdullah said that the Prophet (ﷺ) used to do so.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 1065,
      "title": "Sahih al-Bukhari 1097",
      "narrator": "Narrated 'Amir bin Rabi`a:",
      "english_text": "I saw the Prophet (ﷺ) on his Mount praying Nawafil by nodding his head, whatever direction he faced, but \nAllah's Messenger (ﷺ) never did the same in offering the compulsory prayers.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 1066,
      "title": "Sahih al-Bukhari 1098",
      "narrator": "Narrated Salim:",
      "english_text": "At night \n`Abdullah bin `Umar used to offer the prayer on the back of his animal during the journey and never \ncared about the direction he faced. Ibn `Umar said, \"Allah's Messenger (ﷺ) used to offer the optional prayer \non the back of his Mount facing any direction and also used to pray the witr on it but never offered the \ncompulsory prayer on it.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 1067,
      "title": "Sahih al-Bukhari 1099",
      "narrator": "Narrated Jabir bin `Abdullah:",
      "english_text": "The Prophet (ﷺ) used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the \ncompulsory prayer, he used to dismount and face the Qibla.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 1068,
      "title": "Sahih al-Bukhari 1100",
      "narrator": "Narrated Anas bin Seereen:",
      "english_text": "We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- \nTamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the \nQibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" \nHe replied, \"If I had not seen Allah's Messenger (ﷺ) doing it, I would not have done it.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 1069,
      "title": "Sahih al-Bukhari 1101",
      "narrator": "Narrated Hafs bin `Asim:",
      "english_text": "Ibn `Umar went on a journey and said, \"I accompanied the Prophet (ﷺ) and he did not offer optional \nprayers during the journey, and Allah says: 'Verily! In Allah's Messenger (ﷺ) you have a good example to \nfollow.' \" (33.21)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 1070,
      "title": "Sahih al-Bukhari 1102",
      "narrator": "Narrated Ibn `Umar:",
      "english_text": "I accompanied Allah's Messenger (ﷺ) and he never offered more than two rak`at during the journey. Abu \nBakr, `Umar and `Uthman used to do the same.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 1071,
      "title": "Sahih al-Bukhari 1103",
      "narrator": "Narrated Ibn Abu Laila:",
      "english_text": "Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). \nShe said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) took a bath in my house and offered eight \nrak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 1072,
      "title": "Sahih al-Bukhari 1104",
      "narrator": "",
      "english_text": "Narrated `Abdullah bin Amir that his father had told him that he had seen the Prophet (p.b.u.h) \npraying Nawafil at night on the back of his Mount on a journey, facing whatever direction it took.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 1073,
      "title": "Sahih al-Bukhari 1105",
      "narrator": "Narrated Salim bin `Abdullah:",
      "english_text": "Ibn `Umar said, \"Allah's Messenger (ﷺ) used to pray the Nawafil on the back of his Mount (carriage) by \nsigns facing any direction.\" Ibn `Umar used to do the same.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 1074,
      "title": "Sahih al-Bukhari 1106",
      "narrator": "Narrated Salim's father:",
      "english_text": "The Prophet (ﷺ) used to offer the Maghrib and `Isha' prayers together whenever he was in a hurry on a journey.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 1075,
      "title": "Sahih al-Bukhari 1107",
      "narrator": "Narrated Ibn `Abbas:",
      "english_text": "Allah's Messenger (ﷺ) used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet (ﷺ) used to offer the Maghrib and the `Isha' prayers together on journeys.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 1076,
      "title": "Sahih al-Bukhari 1108",
      "narrator": "Narrated Anas:",
      "english_text": "Allah's Messenger (ﷺ) used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 1077,
      "title": "Sahih al-Bukhari 1109",
      "narrator": "Narrated Az-Zuhri:",
      "english_text": "Salim told me, \"`Abdullah bin `Umar said, 'I saw Allah's Messenger (ﷺ) delaying the Maghrib prayer till he \noffered it along with the `Isha prayer whenever he was in a hurry during the journey.' \" Salim said, \n\"Abdullah bin `Umar used to do the same whenever he was in a hurry during the journey. After \nmaking the call for Iqama, for the Maghrib prayer he used to offer three rak`at and then perform \nTaslim. After waiting for a short while, he would pronounce the Iqama for the `Isha' prayer and offer \ntwo rak`at and perform Taslim. He never prayed any Nawafil in between the two prayers or after the \n`Isha' prayers till he got up in the middle of the night (for Tahajjud prayer).\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 1078,
      "title": "Sahih al-Bukhari 1110",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Whenever the Prophet (ﷺ) started a journey before noon, he used to delay the Zuhr prayer till the time of \n`Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer \nand then ride (for the journey).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 1079,
      "title": "Sahih al-Bukhari 1111",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Whenever the Prophet (ﷺ) started the journey before noon, he used to delay the Zuhr prayer till the time \nfor the `Asr prayer and then he would dismount and pray them together; and whenever the sun \ndeclined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 1080,
      "title": "Sahih al-Bukhari 1112",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Whenever the Prophet (ﷺ) started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 1081,
      "title": "Sahih al-Bukhari 1113",
      "narrator": "Narrated `Aisha:",
      "english_text": "Allah's Messenger (ﷺ) prayed in his house while sitting during his illness and the people prayed behind him \nstanding and he pointed to them to sit down. When he had finished the prayer, he said, \"The Imam is \nto be followed and so when he bows you should bow; and when he lifts his head you should also do \nthe same.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 1082,
      "title": "Sahih al-Bukhari 1114",
      "narrator": "Narrated Anas bin Malik:",
      "english_text": "Allah's Messenger (ﷺ) (p.b.u.h) fell down from a horse and his right side was either injured or scratched, so \nwe went to inquire about his health. The time for the prayer became due and he offered the prayer \nwhile sitting and we prayed while standing. He said, \"The Imam is to be followed; so if he says \nTakbir, you should also say Takbir, and if he bows you should also bow; and when he lifts his head \nyou should also do the same and if he says: Sami`a l-lahu liman hamidah (Allah hears whoever sends \nhis praises to Him) you should say: Rabbana walakal-Hamd (O our Lord! All the praises are for \nYou.\") (See Hadith No. 656 Vol. 1).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 1083,
      "title": "Sahih al-Bukhari 1115",
      "narrator": "Narrated `Imran bin Husain:",
      "english_text": "(who had piles) I asked Allah's Messenger (ﷺ) about the praying of a man while sitting. He said, \"If he prays \nwhile standing it is better and he who prays while sitting gets half the reward of that who prays \nstanding; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 1084,
      "title": "Sahih al-Bukhari 1116",
      "narrator": "Narrated `Abdullah bin Buraida:",
      "english_text": "`Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked \nthe Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray \nstanding; and whoever prays sitting gets half the reward of that who prays while standing; and \nwhoever prays while Lying gets half the reward of that who prays while sitting.' \"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 1085,
      "title": "Sahih al-Bukhari 1117",
      "narrator": "Narrated `Imran bin Husain:",
      "english_text": "had piles, so I asked the Prophet (ﷺ) about the prayer. He said, \"Pray while standing and if you can't, pray \nwhile sitting and if you cannot do even that, then pray Lying on your side.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 1086,
      "title": "Sahih al-Bukhari 1118",
      "narrator": "Narrated Aisha:",
      "english_text": "(the mother of the faithful believers) I never saw Allah's Messenger (ﷺ) offering the night prayer while \nsitting except in his old age and then he used to recite while sitting and whenever he wanted to bow he \nwould get up and recite thirty or forty verses (while standing) and then bow.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 1087,
      "title": "Sahih al-Bukhari 1119",
      "narrator": "Narrated `Aisha:",
      "english_text": "(the mother of the faithful believers) Allah's Messenger (ﷺ) (in his last days) used to pray sitting. He would \nrecite while sitting, and when thirty or forty verses remained from the recitation he would get up and \nrecite them while standing and then he would bow and prostrate. He used to do the same in the second \nrak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I \nwas asleep, he would lie down.",
      "grade": "none"
    }
  ]
}