{
    "chapterNum": 12,
    "english_title": "The Chapters on Expiation",
    "totalHadiths_inChapter": 47,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 2090,
            "title": "Sunan Ibn Majah 2090",
            "narrator": "It was narrated that Rifa'ah Al - Juhani said:",
            "english_text": "\"When the Prophet (ﷺ) took an oath he would say: 'By the One in Whose Hand is the soul of Muhammad.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 2091,
            "title": "Sunan Ibn Majah 2091",
            "narrator": "It was narrated that Rifa'ah bin 'Arabah A-Juhani said:",
            "english_text": "\"The swearing of the Messenger of Allah (ﷺ) when he took an oath and I bear witness before Allah was: 'By the One in Whose Hand is my soul.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 2092,
            "title": "Sunan Ibn Majah 2092",
            "narrator": "It was narrated from Salim that his father said:",
            "english_text": "\"The swearing most frequently sworn by the Messenger of Allah (ﷺ) was: 'No, by the Controller of the hearts.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 2093,
            "title": "Sunan Ibn Majah 2093",
            "narrator": "It was narrated that Abu Hurairah said:",
            "english_text": "\"The swearing of the Messenger of Allah (ﷺ) was: 'No, and I ask Allah for forgiveness.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 2094,
            "title": "Sunan Ibn Majah 2094",
            "narrator": "It was narrated from Salim bin 'Abdullah bin 'Umar, from his father, from 'Umar, that :",
            "english_text": "the Messenger of Allah (ﷺ) heard him swearing by his father. The Messenger of Allah (ﷺ) said: 'Allah forbids you from making oaths by your forefathers.\" 'Umar said: I never took an oath by them (i.e., my forefathers) myself nor narrating such words from anyone else.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 2095,
            "title": "Sunan Ibn Majah 2095",
            "narrator": "It was narrated from 'Abdur-Rahman bin Samurah that :",
            "english_text": "the Messenger of Allah (ﷺ) said: 'Do not take oaths by idols nor by your forefathers. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 2096,
            "title": "Sunan Ibn Majah 2096",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever takes an oath, and swears, saying: 'By Al-Lat and Al-Uzza,' let him say:'La ilaha illallah.' \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 2097,
            "title": "Sunan Ibn Majah 2097",
            "narrator": "It was narrated that Sa'd said:",
            "english_text": "\"I took an oath by Lat and 'Uzza. The Messenger of Allah (ﷺ) said : 'Say: \"La ilaha illallah wahdahu la sharika lahu\" (None has the right to be worshipped but Allah alone, with no partner or associate),\" then spit toward your left three times, and seek refuge with Allah, and do not do that again.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 2098,
            "title": "Sunan Ibn Majah 2098",
            "narrator": "It was narrated that Thabit bin Ad-Dahhak said:",
            "english_text": "The Messenger of Allah (ﷺ) said: 'Whoever takes an oath to follow a religion other than Islam, telling a deliberate lie, he will be as he said.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 2099,
            "title": "Sunan Ibn Majah 2099",
            "narrator": "It was narrated from Anas that the Messenger of Allah (ﷺ) heard a man say:",
            "english_text": "\"If that happens, I will be a Jew.\" The Messenger of Allah (ﷺ) said: 'That is guaranteed.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 2100,
            "title": "Sunan Ibn Majah 2100",
            "narrator": "It was narrated from Abdullah bin Buraidah that his father told that :",
            "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever says: 'I have nothing to do with Islam,' if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 2101,
            "title": "Sunan Ibn Majah 2101",
            "narrator": "It was narrated that Ibn 'Umar said:",
            "english_text": "\"The Messenger of Allah (ﷺ) heard a man taking an oath by his father and said: 'Do not make oaths by your forefathers. Whoever makes an oath by Allah, let him fulfill his oath, and if an oath is sworn for a person by Allah, let him accept it. Whoever is not content with Allah has nothing to do with Allah.'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 2102,
            "title": "Sunan Ibn Majah 2102",
            "narrator": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:",
            "english_text": "\"Eisa bin Maryam saw a man stealing and said: 'Did you steal?'  He said: 'No, by the One besides Whom there is no other God.' 'Eisa said: 'I believe in Allah, and I do not believe what my eyes see.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 2103,
            "title": "Sunan Ibn Majah 2103",
            "narrator": "It was narrated from Ibn 'Umar that :",
            "english_text": "the Messenger of Allah (ﷺ) said: \"An oath (leads to) either sin or regret. \"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 2104,
            "title": "Sunan Ibn Majah 2104",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "'Whoever swears an oath and says In sha' Allah, he will have made an exception.\"(2)",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 2105,
            "title": "Sunan Ibn Majah 2105",
            "narrator": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Whoever swears an oath and says In sha' Allah, if he wishes he may go ahead and if he wishes he may not, without having broken his oath.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 2106,
            "title": "Sunan Ibn Majah 2106",
            "narrator": "It was narrated from Ibn 'Umar:",
            "english_text": "\"Whoever swears an oath and says In sha' Allah, will never break his oath.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 2107,
            "title": "Sunan Ibn Majah 2107",
            "narrator": "It was narrated from Abu Burdah that his father Abu Musa said:",
            "english_text": "\"I came to the Messenger of Allah (ﷺ) with a group of Asharites and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride, and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three she-camels with fine humps. When we left, we said to one another: 'We came to the Messenger of Allah (ﷺ) to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something. Let us go back.' So we went to him and we said: 'O Messenger of Allah! We came to you seeking mounts, and you took an oath that you would not give us mounts, then you gave us some mounts.' He said: 'By Allah, I did not give you animals to ride, rather Allah gave you them to ride. I, by Allah, if Allah wills, do not swear and then see something better than it, but I offer expiation for what I swore about, and do that which is better.' Or he said: 'I do that which is better and offer expiation for what I swore about.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 2108,
            "title": "Sunan Ibn Majah 2108",
            "narrator": "It was narrated from 'Adi bin Hatim that :",
            "english_text": "the Messenger of Allah (ﷺ), said: \"Whoever swears an oath then sees that something else is better than it, let him do that which is better and offer expiation for what he swore about. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 2109,
            "title": "Sunan Ibn Majah 2109",
            "narrator": "It was narrated from Abul-Ahwas 'Awf bin Malik Al- Jushami that his father said:",
            "english_text": "\"I said: 'O Messenger of Allah, my cousin comes to me and I swear that I will not give him anything or uphold the ties of kinship with him.' He said: 'Offer expiation for what you swore about.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 2110,
            "title": "Sunan Ibn Majah 2110",
            "narrator": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Whoever takes an oath to cut off the ties of kinship, or to do something that is not right, the fulfillment of his vow is not to do that.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 2111,
            "title": "Sunan Ibn Majah 2111",
            "narrator": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said that the Prophet (ﷺ) said:",
            "english_text": "\"Whoever swears an oath then sees  that something else is better than it, let him not do it, and his leaving it is the expiation for it. \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 2112,
            "title": "Sunan Ibn Majah 2112",
            "narrator": "It was narrated that Ibn Abbas said:",
            "english_text": "\"The Messenger of Allah (ﷺ) offered expiation of a Sa' of dates, and he enjoined the people to do likewise. Whoever does not have that (must give) half a Sa' of wheat.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 2113,
            "title": "Sunan Ibn Majah 2113",
            "narrator": "It was narrated that Ibn 'Abbas said:",
            "english_text": "\"A man would give his family food that was abundant and another would give his family food that was barely sufficient, then the following was revealed: 'With the Awsat of that with which you feed your families...’”(2)",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 2114,
            "title": "Sunan Ibn Majah 2114",
            "narrator": "It was narrated that Hammam heard Abu Hurairah saying that 'Abul-Qasim (ﷺ) said:",
            "english_text": "\"If anyone of you insists on fulfilling what he swore to (after learning that it is wrong) then it is more sinful before Allah than (breaking the oath for which) the expiation that has been enjoined upon him.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 2115,
            "title": "Sunan Ibn Majah 2115",
            "narrator": "It was narrated that Bara' bin 'Azib said:",
            "english_text": "'The Messenger of Allah (ﷺ) commanded us to help fulfill the oath.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 2116,
            "title": "Sunan Ibn Majah 2116",
            "narrator": "It was narrated from Mujahid, that 'Abdur-Rahman bin Safwan, or Safwan bin 'Abdur- Rahman Al-Qurashi said:",
            "english_text": "\"On the Day of the conquest of Makkah, he came with his father and he said: 'O Messenger of Allah, give my father a share of Hijrah.' He said: 'There is no Hijrah.' Then he went away and entered upon 'Abbas and said: 'Do you know who I am?' He said: 'Yes.' Then 'Abbas went out, wearing a shirt and no upper wrap, and said: 'O Messenger of Allah, do you know so-and-so with whom we have friendly ties? He brought his father to swear an oath of allegiance (i.e., promise) to emigrate.' The Prophet (ﷺ) said: 'There is no Hijrah.'\" 'Abbas said: 'I adjure you to do it.' The Prophet (ﷺ) stretched forth his hand and touched his hand, and said: 'I have fulfilled the oath of my uncle, but there is no Hijrah.\"' (Da'if)Another chain with similar wording. Yazid bin Abu Ziyad said: \"Meaning: There is no Hijrah from a land whose people have accepted Islam.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 2117,
            "title": "Sunan Ibn Majah 2117",
            "narrator": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:",
            "english_text": "'When anyone of you swears an oath, let him not say: 'What Allah wills and what you will.' Rather let him say: 'What Allah wills and then what you will.'",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 2118,
            "title": "Sunan Ibn Majah 2118",
            "narrator": "It was narrated from Hudhaifah bin Yaman that :",
            "english_text": "a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 2119,
            "title": "Sunan Ibn Majah 2119",
            "narrator": "It was narrated that Suwaid bin Hanzalah said:",
            "english_text": "\"We went out looking for the Messenger of Allah (ﷺ) and Wa'il bin Hujr was with us. An enemy of his seized him and the people were reluctant to swear an oath but I swore that he was my brother, so they set him free. We came to the Messenger of Allah (ﷺ) and I told him that the people had been reluctant to swear an oath, but I had sworn that he was my brother. He said: 'You told the truth. The Muslim is the brother of his fellow Muslim.' \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 2120,
            "title": "Sunan Ibn Majah 2120",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"The oath is only according to the intention of the one who requests the oath to be taken.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 2121,
            "title": "Sunan Ibn Majah 2121",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Your oath is as your companion understands it to be.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 2122,
            "title": "Sunan Ibn Majah 2122",
            "narrator": "It was narrated that 'Abdullah bin 'Umar said:",
            "english_text": "\"The Messenger of Allah (ﷺ) forbade vows and said: 'They are just a means of taking wealth from the miserly.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 2123,
            "title": "Sunan Ibn Majah 2123",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Vows do not bring the son of Adam anything unless it has been decreed for him. But he is dominated by Divine preordainment, and will get what is decreed for him. And (vows) are a means of making the miser give something, so what he desires becomes obtainable for him, which was not obtainable before his vow. And Allah says: 'Spend, I will spend on you.'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 2124,
            "title": "Sunan Ibn Majah 2124",
            "narrator": "It was narrated from 'Imran bin Husain that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"[There is no vow to commit disobedience and] no vow concerning that which the son of Adam does not possess.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 2125,
            "title": "Sunan Ibn Majah 2125",
            "narrator": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"There is no vow to commit disobedience, and the expiation (for such a vow) is the expiation for breaking an oath.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 2126,
            "title": "Sunan Ibn Majah 2126",
            "narrator": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Whoever vows to obey Allah, let him obey Him, and whoever vows to disobey Allah, let him not disobey Him. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 2127,
            "title": "Sunan Ibn Majah 2127",
            "narrator": "It was narrated from 'Uqbah bin 'Amit Al-Juhani that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 2128,
            "title": "Sunan Ibn Majah 2128",
            "narrator": "lt was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:",
            "english_text": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. Whoever makes a vow and is not able to fulfill it, the expiation for that is the expiation for breaking an oath. Whoever makes a vow and is able to fulfill it, let him do so.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 2129,
            "title": "Sunan Ibn Majah 2129",
            "narrator": "It was narrated that 'Umar bin Khattab said:",
            "english_text": "\"I made a vow during the Ignorance period and I asked the Prophet (ﷺ) (about it) after I became Muslim. He told me to fulfill my vow.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 2130,
            "title": "Sunan Ibn Majah 2130",
            "narrator": "It was narrated from Ibn Abbas that a man came to the Prophet (ﷺ) and said:",
            "english_text": "\"O Messenger of Allah, I vowed to offer a sacrifice at Buwanah.\" He said: \"Do you intend any action of Ignorance period?\" He said: \"No.\" He said: \"Then fulfill your vow.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 2131,
            "title": "Sunan Ibn Majah 2131",
            "narrator": "It was narrated from Maimunah bint Kardam Al-Yasariyyah that :",
            "english_text": "her father met the Prophet (ﷺ) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (ﷺ) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 2132,
            "title": "Sunan Ibn Majah 2132",
            "narrator": "It was narrated from Ibn 'Abbas' that :",
            "english_text": "Sa'd bin 'Ubadah asked the Messenger of Allah (ﷺ) about a vow which his mother had made, but she had died without fulfilling it. The Messenger of Allah (ﷺ) said: \"Fulfill it on her behalf .\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 2133,
            "title": "Sunan Ibn Majah 2133",
            "narrator": "It was narrated from Jabir  bin 'Abdullsh that :",
            "english_text": "a woman came to the Messenger of Allah (ﷺ) and said: \"My mother has died, and she had made a vow to fast, but she died before she could fulfill it. The Messenger of Allah (ﷺ) said: 'Let her guardian fast on her behalf .\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 2134,
            "title": "Sunan Ibn Majah 2134",
            "narrator": "It was narrated from Abu Sa'eed Ar-Ru'aini that 'Abdullah bin Malik told him, that :",
            "english_text": "'Uqbah  bin 'Amir told him, that his sister vowed to walk, barefoot and bareheaded, and he mentioned that to the Messenger of Allah (ﷺ) He said: \"Order her to ride and to cover her head, and to fast for three days.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 2135,
            "title": "Sunan Ibn Majah 2135",
            "narrator": "It was narrated that Abu Hurairah said:",
            "english_text": "\"The Prophet (ﷺ) saw an old man walking between his two sons, and he said: What is the matter with him?' His sons said: 'A vow, O Messenger of Allah.' He said: 'Let this old man ride, for Allah has no need of you or your vow.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 2136,
            "title": "Sunan Ibn Majah 2136",
            "narrator": "It was narrated from Ibn Abbas that the  :",
            "english_text": "Messenger of Allah (ﷺ) passed by a man in Makkah who was standing in the sun. He said: \"What is this?\" They said: \"He vowed to fast and not to seek shade until night comes, and not to speak, and to remain standing.\" He said: \"Let him speak and seek shade and let him sit down, but let him complete his fast.\"Another chain from Ibn 'Abbas, from the Prophet (ﷺ), with similar wording. expiation for breaking an oath.\"",
            "grade": "Sahih (Darussalam)"
        }
    ]
}