{
    "chapterNum": 11,
    "english_title": "The Chapters on Divorce",
    "totalHadiths_inChapter": 74,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 2016,
            "title": "Sunan Ibn Majah 2016",
            "narrator": "It was narrated from 'Umar bin Khattab that:",
            "english_text": "the Messenger of Allah divorced Hafsah then took her back.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 2017,
            "title": "Sunan Ibn Majah 2017",
            "narrator": "It was narrated from Abu Musa that:",
            "english_text": "the Messenger of Allah said: What is wrong with people who play with the limits imposed by Allah, and one of them says: \"I divorce you, I take you back, I divorce you?\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 2018,
            "title": "Sunan Ibn Majah 2018",
            "narrator": "It was narrated from 'Abdullah bin 'Umar that:",
            "english_text": "the Messenger of Allah said: \"The most hated of permissible things to Allah is divorce. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 2019,
            "title": "Sunan Ibn Majah 2019",
            "narrator": "It was narrated that Ibn 'Umar said:",
            "english_text": "\"I divorced my wife when she was menstruating. 'Umar mentioned that to the Messenger of Allah and he said: 'Tell him to take her back until she becomes pure (i.e., her period ends), then she has her period (again), then she becomes pure (again), then if he wishes he may divorce her before having sexual relations with her, and if he wishes he may keep her. This is the waiting period that Allah has enjoined.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 2020,
            "title": "Sunan Ibn Majah 2020",
            "narrator": "It was narrated that Abdullah said:",
            "english_text": "\"Divorce according to the Sunnah means divorcing her when she is pure, ( i.e., not menstruating) and without having had intercourse with her (during that cycle).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 2021,
            "title": "Sunan Ibn Majah 2021",
            "narrator": "It was narrated that 'Abdullah said:",
            "english_text": "\"Divorce according to the Sunnah means divorcing her with one divorce in each cycle when she is pure, then when she becomes pure the third time, then he pronounces divorce again, and after that she must wait one more menstrual cycle.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 2022,
            "title": "Sunan Ibn Majah 2022",
            "narrator": "It was narrated that Yunus bin Jubair, Abu Ghallab, said:",
            "english_text": "\"I asked Ibn 'Umar about a man who divorced his wife when she was menstruating. He said: 'Do you know 'Abdullah bin 'Umar? He divorced his wife when she was menstruating then 'Umar came to the Prophet (ﷺ) (and told him what had happened). He ordered him to take her back.' I said: 'Will that be counted (as a divorce)?' He said: 'Do You think he was helpless and behaving foolishly? [i.e., Yes, it counts (as a divorce).].\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 2023,
            "title": "Sunan Ibn Majah 2023",
            "narrator": "It was narrated from Ibn 'Umar that:",
            "english_text": "he divorced his wife when she was menstruating, and 'Umar mentioned that to the Prophet (ﷺ). He said: \"Tell him to take her back then divorce her when she is pure (not menstruating) or pregnant.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 2024,
            "title": "Sunan Ibn Majah 2024",
            "narrator": "It was narrated that 'Amir Sha'bi said:",
            "english_text": "\"I said to Fatimah bint Qais: 'Tell me about your divorce.' She said: 'My husband divorced me three times when he was leaving for Yemen, and the Messenger of Allah (ﷺ) allowed that.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 2025,
            "title": "Sunan Ibn Majah 2025",
            "narrator": "'Imran bin Husain:",
            "english_text": "was asked about a man who divorced his wife then had intercourse with her, and there were no witnesses to his divorcing her or his taking her back. 'Imran said: \"You have divorced (her) in a manner that is not according to the Sunnah, and you have taken her back in a manner that is not according to the Sunnah. Bring people to witness your divorcing her and taking her back.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 2026,
            "title": "Sunan Ibn Majah 2026",
            "narrator": "It was narrated from Zubair bin 'Awwam that:",
            "english_text": "he was married to Umm Kulthum bint 'Uqbah, and she said to him when she was pregnant. \"I will accept one divorce.\" So he divorced her once. Then he went out for prayer, and when he came back she had given birth. He said: \"What is wrong with her? She misled me may Allah mislead her!\" Then he came to the Prophet (ﷺ), who said: \"Her waiting period is over (and she is divorced); propose marriage a new to her.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 2027,
            "title": "Sunan Ibn Majah 2027",
            "narrator": "It was narrated that Abu Sanabil said:",
            "english_text": "\"Subai'ah Aslamiyyah bint Harith gave birth twenty-odd days after her husband died. When her postnatal bleeding ended, she adorned herself, and was criticized for doing that. Her case was mentioned to the Prophet (ﷺ) and he said: 'If she does that, then her waiting period is over.\"'",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 2028,
            "title": "Sunan Ibn Majah 2028",
            "narrator": "It was narrated that Masruq and 'Amr bin 'Utbah wrote to Subai'ah bint Harith, asking about her case.:",
            "english_text": "She wrote to them saying that she gave birth twenty-five days after her husband died. Then she prepared herself, seeking to remarry. Abu Sanabil bin Ba'kak passed by her and said: \"You are in a hurry; observe waiting period for the longer period, four months and ten days.\" \"So I went to the Prophet (ﷺ) and said: 'O Messenger of Allah, (ﷺ) pray for forgiveness for me.' He said: 'Why is that.” I told him (what had happened). He said: 'If you find a righteous husband then marry him.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 2029,
            "title": "Sunan Ibn Majah 2029",
            "narrator": "It was narrated from Miswar bin Makhramah that:",
            "english_text": "the Prophet (ﷺ) told Subai'ah to get married, when her postnatal bleeding ended.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 2030,
            "title": "Sunan Ibn Majah 2030",
            "narrator": "It was narrated that' Abdullah bin Mas'ud said:",
            "english_text": "\"By Allah, for those who would like to go through the process of praying for Allah's curse to be upon the one who is wrong, the shorter Surah concerning women[l] was revealed after (the Verses[2] which speak of the waiting period of) four months and ten (days).\" [1] (65:40), [2] (2:234)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 2031,
            "title": "Sunan Ibn Majah 2031",
            "narrator": "It was narrated from Zainab bint Ka'b bin 'Ujrah, who was married to Abu Sa'eed Al-Khudri,:",
            "english_text": "that his sister Furai'ah bint Malik said: \"My husband went out to pursue some slaves of his. He caught up with them at the edge of Qadumttl and they killed him. News of his death reached me when I was in one of the houses of the Ansar, far away from the house of my family and my brothers. I went to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), there has come to me news of my husband's death and I am in a house far away from the house of my people and the house of my brothers. He did not leave any money that could be spent on me, or any inheritance, or any house I may take possession of. If you think that you could give me permission to join my family and my brothers, then that is what I prefer and is better for me in some ways.' He said: 'Do that if you wish.' Then I went out, feeling happy with the ruling of Allah given upon the lips of the Messenger of Allah (ﷺ), until, when I was in the mosque, or, in one of the apartments, he called me and said: 'What did you say?' I told him the story, and he said: 'Stay in the house in which the news of your husband's death came to you, until your waiting period is ever.\"' She said: \"So I observed the waiting period there for four months and ten (days).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 2032,
            "title": "Sunan Ibn Majah 2032",
            "narrator": "It was narrated from Hisham bin 'Urwah that his father said:",
            "english_text": "\"I entered upon Marwan and said to him: 'A women from your family has been divorced. I passed by her and she was moving. She said: 'Fatimah bint Qais told us to do that, and she told us that the Messenger of Allah (ﷺ) told her to move.' Marwan said: 'She told them to do that.\"' 'Urwah said: \"l said: 'By Allah, 'Aishah did not like that, and said: 'Fatimah was living in a deserted house and it was feared for her (safety and well being), so the Messenger of Allah (ﷺ) granted a concession to her.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 2033,
            "title": "Sunan Ibn Majah 2033",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“Fatimah bint Qais said: 'O Messenger of Allah, (ﷺ) I am afraid that someone may enter upon me by force.' So he told her to move.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 2034,
            "title": "Sunan Ibn Majah 2034",
            "narrator": "It was narrated that Jabir bin 'Abdullah said:",
            "english_text": "\"My maternal aunt was divorced, and she wanted to collect the harvest from her date-palm trees. A man rebuked her for going out to the trees. She went to the Prophet (ﷺ), who said: 'No, go and collect the harvest from your trees, for perhaps you will give some in charity or do a good deed with it.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 2035,
            "title": "Sunan Ibn Majah 2035",
            "narrator": "It was narrated that Abu Bakr bin Abu Jahm bin Sukhair Al-'Adawi said:",
            "english_text": "\"I heard Fatimah bint Qais say that her husband divorced her ttree times, and the Messenger of Allah (ﷺ) did not say that she was entitled to accommodation and maintenance.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 2036,
            "title": "Sunan Ibn Majah 2036",
            "narrator": "It was narrated that Sha'bi said:",
            "english_text": "Fatimah bint Qais said:\n“My husband divorced me at the time of the Messenger of Allah (ﷺ) three times. The Messenger of Allah (ﷺ) said: 'You have no right to accommodation or to maintenance.'”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 2037,
            "title": "Sunan Ibn Majah 2037",
            "narrator": "It was narrated from 'Aishah that:",
            "english_text": "'Amrah bint Jawn sought refuge.with Allah from the Messenger of Allah (ﷺ) when she was brought to him (as a bride) He said: \"You have sought refuge with Him in Whom refuge is sought.\" So he divorced her and told Usamah or Anas to give her, a gift of three garments of white flax.",
            "grade": "Maudu (Darussalam)"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 2038,
            "title": "Sunan Ibn Majah 2038",
            "narrator": "It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:",
            "english_text": "the Prophet (ﷺ) said: \"If a woman claims that her husband has divorced her, and she brings a witness of good character (to testify) to that, her husband should be asked to swear an oath. If he swears, that will invalidate the testimony of the witness, but if he refuses then that will be equivalent to a second witness, and the divorce will take effect.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 2039,
            "title": "Sunan Ibn Majah 2039",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah (ﷺ) said: \"There are three matters in which seriousness is serious and joking is serious: marriage, divorce and taking back (one's wife). \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 2040,
            "title": "Sunan Ibn Majah 2040",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of  Allah (ﷺ) said: \"Allah has forgiven my nation for what they think of to themselves, so long as they do not act upon it or speak of it.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 2041,
            "title": "Sunan Ibn Majah 2041",
            "narrator": "It was narrated from Aishah that:",
            "english_text": "the Messenger of Allah said. \"The Pen has been lifted from three : from the sleeping person until he awakens, from the minor until he grows up, and from the insane person until he comes to his senses.\"In his narration, (one of the narrators Abu Bakr (Ibn Abu Shaibah) said: \"And from the afflicted person, unit he recovers\" (1)",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 2042,
            "title": "Sunan Ibn Majah 2042",
            "narrator": "It was narrated from 'Ali bin Abu Talib that:",
            "english_text": "the Messenger of Allah (ﷺ) said: \"The Pen is lifted from the minor, the insane person and the sleeper.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 2043,
            "title": "Sunan Ibn Majah 2043",
            "narrator": "It was narrated from Abu Dharr Al-Ghifari that the Messenger of Allah (ﷺ) said:",
            "english_text": "Allah has forgiven for me my nation their mistakes and forgetfulness, and what they are forced to do.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 2044,
            "title": "Sunan Ibn Majah 2044",
            "narrator": "It was narrated from Abu Hurairah that the:",
            "english_text": "Messenger of Allah (ﷺ) said : \"Allah has forgiven my nation for the evil suggestions of their hearts, so long as they do not act upon it or speak of it, and for what they are forced to do.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 2045,
            "title": "Sunan Ibn Majah 2045",
            "narrator": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said :",
            "english_text": "\"Allah has forgiven my nation for mistakes and forgetfulness, and what they are forced to do.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 2046,
            "title": "Sunan Ibn Majah 2046",
            "narrator": "It was narrated that Safiyyah bint Shaibah said:",
            "english_text": "\"Aishah told me that the Messenger of Allah (ﷺ) said: 'There is no divorce and no manumission at the time of coercion.' \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 2047,
            "title": "Sunan Ibn Majah 2047",
            "narrator": "It was narrated from \"Amr bin Shu'aib, from his father, from his grandfather, that:",
            "english_text": "the Messenger of Allah said : \"There is no divorce regarding that which one does not possess.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 2048,
            "title": "Sunan Ibn Majah 2048",
            "narrator": "It was narrated from Miswar bin Makharamah that the Prophet (ﷺ) said:",
            "english_text": "\"There is no divorce before marriage, and no manumission before taking possession.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 2049,
            "title": "Sunan Ibn Majah 2049",
            "narrator": "It was narrated from ' Ali bin Abu Talib that the Prophet (ﷺ) said :",
            "english_text": "\"There is no divorce before marriage.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 2050,
            "title": "Sunan Ibn Majah 2050",
            "narrator": "Awza'i said :",
            "english_text": "\"I asked Zuhri: 'Which of the wives of the Prophet (ﷺ) sought refuge with Allah from him? He said : \"Urwah told me, (narrating) from 'Aishah, that when the daughter of Jawn entered upon the Messenger of Allah (ﷺ) and he came close to her, she said: \"I seek refuge with Allah from you.\" the Messenger of Allah (ﷺ) said : \"You have sought refuge in the Almighty\" go to your family.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 2051,
            "title": "Sunan Ibn Majah 2051",
            "narrator": "It was narrated from 'Abdullah bin 'Ali bin Yazid bin Rukanah, from his father, from his grandfather, that:",
            "english_text": "he divorced his wife irrevocably, then he came to the Messenger of Allah (ﷺ) and asked him. He said: \"What did you mean by that?\" He said: \"One (divorce).\" He said: \"By Allah did you only mean one (divorce) thereby?\" He said: \"By Allah, I meant one.\" Then he sent her back to him. (Da'if)Muhammad bin Majah said: I heard Abul-Hasan ' Ali bin Muhammad Tanafisi saying: \"How noble is this Hadith.\" Ibn Majah said: 'Abu 'Ubaid left it (i.e., did not accept its narration) and Ahmad was fearful of it (i.e., of narrating it).\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 2052,
            "title": "Sunan Ibn Majah 2052",
            "narrator": "It was narrated that Aishah said:",
            "english_text": "\"The Messenger of Allah gave us the choice, and we chose him, and he did not consider it as something (i.e., an effective divorce).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 2053,
            "title": "Sunan Ibn Majah 2053",
            "narrator": "It was narrated that Aishah said:",
            "english_text": "\"When the following was revealed: 'But if you desire Allah and His Messenger, (ﷺ) the Messenger of Allah (ﷺ) entered upon me and said: 'O Aishah I want to say something to you, and you do not have to hasten (in making a decision) until you have consulted your parents.\"' She said: \"He knew, by Allah, that my parents would never tell me to leave him.\" She said: \"Then he recited to me: ' O Prophet (Muhammad)! Say to your wives: \" If you desire the life of this world, and its glitter.'\" I said: 'Do I need to consult my parents about this? I choose Allah and His Messenger.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 2054,
            "title": "Sunan Ibn Majah 2054",
            "narrator": "It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:",
            "english_text": "\"No woman asks for divorce when it is not absolutely necessary, but she will never smell the fragrance of paradise, although its fragrance can be detected from a distance of forty years' travel. \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 2055,
            "title": "Sunan Ibn Majah 2055",
            "narrator": "It was narrated from Thawban that the Messenger of Allah (ﷺ) said:",
            "english_text": "'Any woman who asks her husband for a divorce when it is not absolutely necessary, the fragrance of Paradise will be forbidden to her.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 2056,
            "title": "Sunan Ibn Majah 2056",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "Jamilah bint Salul came to the Prophet (ﷺ) and said: \"By Allah, I do not find any fault with Thabit regarding his religion nor his behavior, but I hate disbelief after becoming Muslim and I cannot stand him. \"The Prophet (ﷺ) said to her: 'WiIl you give him back his garden?\" She said: \"Yes.\" So the Messenger of Allah (ﷺ) told him to take back his garden from her and no more than that.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 2057,
            "title": "Sunan Ibn Majah 2057",
            "narrator": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:",
            "english_text": "\"Habibah bint Sahl was married to Thabit bin Qais bin Shammas, who was an ugly man. She said: 'O Messenger of Allah, (ﷺ)  by Allah, were it not for fear of Allah when he enters upon me I would spit in his face.' The Messenger of Allah  (ﷺ) said: 'Will you give him back his garden?' She :said: 'Yes.' So she gave him back his garden and the Messenger of Allah (ﷺ) separated them.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 2058,
            "title": "Sunan Ibn Majah 2058",
            "narrator": "It was narrated from 'Ubadah bin Samit from Rubai' bint Mu'awwidh bin 'Afra'.:",
            "english_text": "He said: \"I said to her: 'Tell me your Hadith.' She said: 'I got Khul' from my husband, then I came to 'Uthman and asked him: \"What waiting period do I have to observe?\" He said: \"You do not have to observe any waiting period, unless you had intercourse with him recently, in which case you should stay with him until you have menstruated.\" In that he was following the ruling of the Messenger of Allah (ﷺ) concerning Maryam Maghaliyyah, who was married to Thabit bin Qais and she got Khul' from him.' \"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 2059,
            "title": "Sunan Ibn Majah 2059",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Messenger of Allah (ﷺ) swore that he would not enter upon his wives for a month, and he stayed for twenty-nine days until, on the eve of the thirtieth, he entered upon me. I said: 'You swore not to enter upon us for a month.' He said: 'The month may be like this,' and he held up his (ten) fingers three times; 'or the month may be like this,' and he held up his fingers three times, keeping one finger down on the third time.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 2060,
            "title": "Sunan Ibn Majah 2060",
            "narrator": "It was narrated from Aishah that:",
            "english_text": "the Messenger of Allah (ﷺ) swore to keep away from his wives, because Zainab had sent back her gift and 'Aishah said: \"She has disgraced you.\" He became angry and swore to keep away from them.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 2061,
            "title": "Sunan Ibn Majah 2061",
            "narrator": "It was narrated from Umm Salamah that:",
            "english_text": "the Messenger of Allah (ﷺ) swore to keep away from some of his wives for a month. On the twenty-ninth day, in the evening or the morning, it was said: \"O Messenger of Allah, only twenty-nine days have passed.\" He said: \"The month is twenty-nine days.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 2062,
            "title": "Sunan Ibn Majah 2062",
            "narrator": "It was narrated that Salamah bin Sakhr Al-Bayadi said:",
            "english_text": "\"I was a man who had a lot of desire for women, and I do not think there was any man who had as great a share of that as me. When Ramadan began, I declared Zihar upon my wife (to last) until Ramadan ended. While she was talking to me one night, part of her body became uncovered. I jumped on her and had intercourse with her. The next morning I went to my people and told them, and said to them: 'Ask the Messenger of Allah (ﷺ) for me.' They said: 'We will not do that, lest Allah reveal Quran concerning us or the Messenger of Allah (ﷺ) says, something about us, and it will be a lasting source of disgrace for us. Rather we will leave you to deal with it yourself. Go yourself and tell the Messenger of Allah (ﷺ) about your problem.' So I went out and when I came to him, I told him what happened. The Messenger of Allah (ﷺ) said: 'Did you really do that?' I said: 'I really did that, and here I am, O Messenger of Allah. (ﷺ) I will bear Allah’s ruling on me with patience.' He said: 'Free a slave.' I said: 'By the One Who sent you with the truth, I do not own anything but myself.' He said: 'Fast for two consecutive months.' I said: 'O Messenger of Allah, the thing that happened to me was only because of fasting.' He said: 'Then give charity, or feed sixty poor persons.' I said: 'By the One Who sent you with the truttu we spent last night with no dinner.' He said: 'Then go to the collector of charity of Banu Zuraiq, and tell him to give you something, then feed sixty poor persons, and benefit from the rest.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 2063,
            "title": "Sunan Ibn Majah 2063",
            "narrator": "It was narrated from 'Urwah bin Zubair, that 'Aishah said:",
            "english_text": "\"Blessed is the One Whose hearing encompasses all things. I heard some of the words of Khawlah bint Tha'labah, but some of her words were not clear to me, when she complained to the Messenger of Allah (ﷺ) about her husband, and said: 'O Messenger of Allah, (ﷺ) he has consumed my youth and I split my belly for him (i.e., bore him many children), but when I grew old and could no longer bear children he declared Zihar upon me; O Allah, I complain to You.' She continued to complain until Jibra'il brought down these Verses: 'Indeed Allah has heard the statement of she who pleads with you (O Muhammad) concerning her husband, and complains to Allah\" (58:1)",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 2064,
            "title": "Sunan Ibn Majah 2464",
            "narrator": "It was narrated from Salamah bin Sakhr Al-Bayedi that:",
            "english_text": "the Prophet (ﷺ) said concerning a man who declared Zihar upon his wife having intercourse with her before compensation: \"Let him offer one expiation.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 2065,
            "title": "Sunan Ibn Majah 2065",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "a man declared Zihar upon his wife, then he had intercourse with her before offering expiation. He came to the Prophet (ﷺ) and told him about that. He said: \"What made you do that?\" He said: \"I saw her ankles in the moonlight, and I could not control myself, and I had intercourse with her.\" The Messenger of Allah (ﷺ) smiled and told him not to go near her until he had offered expiation.",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 2066,
            "title": "Sunan Ibn Majah 2066",
            "narrator": "It was narrated that Sahl bin Sa'd As-Sa'idi said:",
            "english_text": "\"Uwaimir came to 'Asim bin 'Adi and said: 'Ask the Messenger of Ailah (ﷺ) for me: \"Do you think that if a man finds another man with his wife and kills him, he should be killed in retaliation, or what should he do?\" 'Asim asked the Messenger of Allah (ﷺ) about that, and the Messenger of Allah (ﷺ) disapproved of the question. Then 'Uwaimir met him ('Asim) and asked him about that, saying: 'What did you do?’ He said: I did that and you have not brought me any good. I asked the Messenger of Allah (ﷺ) and he disapproved of this question.’ Uwaimir said: 'By Allah, I will go to the Messenger of Allah (ﷺ) myself and ask him.' So he went to the Messenger of Allah (ﷺ) and found that Qur'an had been revealed concerning them, and the Prophet (ﷺ) told them to go through the procedure of Li'an. 'Uwaimir said: 'O Messenger of Allah, (ﷺ) by Allah if I take her back, I would have been telling lies about her.' So he left her before the Messenger of Allah (ﷺ) told him to do so, and that became the Sunnah for two who engage in the procedure of Li'an. Then the Prophet (ﷺ) said: 'Wait and see. If she gives birth to a child who is black in color with widely-spaced dark eyes and large buttocks, then I think that he was telling the truth about her, but if she gives birth to a child with a red complexion like a Wahrah,[1] then I think that he was lying.' Then she gave birth to a child with features resembling those of the man concerning whom she was accused.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 2067,
            "title": "Sunan Ibn Majah 2067",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "Hilal bin Umayyah accused his wife in the presence of the Prophet (ﷺ) of (committing adultery) with Sharik bin Sahma'. The Prophet said: \"Bring proof or you will feel the Hadd (punishment) on your back.\" Hilal bin Umayyah said: \"By the One Who sent you with the truth, I am telling the truth, and Allah will send down revelation concerning my situation which will spare my back.\" Then the following was revealed: \"And for those who accuse their wives, but have no witnesses except themselves, let the testimony of one of them be four testimonies (i.e., testifies four times) by Allah that he is one of those who speak the truth. And the fifth (testimony should be) the invoking of the curse of Allah on him if he be of those who tell a lie (against her). But it shall avert the punishment (of stoning to death) from her, it she bears witness four times by Allah, that he (her husband) is telling a lie. And the fifth (testimony) should be that the wrath of Allah be upon her if he (her husband) speaks the truth.\" The Prophet (ﷺ), turned and sent for them, and they came. Hilal bin Umayyah stood up and bore witness, and the Prophet (ﷺ) said: \"Allah knows that one of you is lying. Will either of you repent?\" Then she stood up and affirmed her innocence. On the fifth time, meaning that the wrath of Allah be upon her if he (her husband) speaks the truth, they said to her: \"It will invoke the wrath of Allah.\" Ibn 'Abbas said: \"She hesitated and backed up, until we thought that she was going to recant. Then she said: 'By Allah, I cannot dishonor my people for ever.' Then the Prophet (ﷺ) said: 'Wait and see. If she gives birth to a child with black eyes, fleshy buttocks and big calves, then he is the son of Sharik bin Sahma'.' And she gave birth to such a child. Then the Prophet (ﷺ) said: 'Had it not the matter been settled by the Book of Allah, I would have punished her severely.' \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 2068,
            "title": "Sunan Ibn Majah 2068",
            "narrator": "It was narrated that 'Abdullah said:",
            "english_text": "\"We were in the mosque one Friday night when a man said: 'If a man finds a man with his wife and kills him, will you kill him, and if he speaks,will you flog him. By Allah I will mention that to the Prophet (ﷺ). So he mentioned that to the Prophet (ﷺ), and Allah revealed the Verses of Li'an. Then after that the man came and accused his wife, so the Prophet (ﷺ) told them to go through the procedure of  Li'an and he said: 'Perhaps she will give birth to a black child.’ Then she gave birth to a black child with curly hair.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 2069,
            "title": "Sunan Ibn Majah 2069",
            "narrator": "It was narrated from Ibn 'Umar that:",
            "english_text": "a man invoked curses on his wife, and refused to accept her child. The Messenger of Allah (ﷺ) separated them, and left the child with the woman.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 2070,
            "title": "Sunan Ibn Majah 2070",
            "narrator": "It was narrated that Ibn 'Abbas said:",
            "english_text": "\"A man from among the Ansar manried a wornan from Bal'ijlan. He entered upon her and spent the night with her, then in the morning he said: 'I did not find her to be a virgin.' Her case was taken to the Prophet (ﷺ), and he called the girl and asked her. She said: 'No, I was a virgin.' So he told thern to go through the procedure of Li'an, and gave her the bridal-money.” (D a'if)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 2071,
            "title": "Sunan Ibn Majah 2071",
            "narrator": "It was nanated from 'Amr bin Shu'aib, from his father, from his grandfather, that:",
            "english_text": "the Prophet (ﷺ) said: \"There are four kinds of women for whom there is no Li'an: a Christian woman married to a Muslim, a Jewish woman married to a Muslim, a free woman married to a slave, and a slave woman married to a free man.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 2072,
            "title": "Sunan Ibn Majah 2072",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Messenger of Allah swore to keep away from his wives and declared them as unlawful for him, so he made something permissible forbidden, and he offered expiation for having sworn to do so.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 2073,
            "title": "Sunan Ibn Majah 2073",
            "narrator": "It was narrated from Sa'eed bin Jubair that Ibn 'Abbas said:",
            "english_text": "\"For the one who makes unlawful is the swearing.\" (Sahih)And Ibn 'Abbas used to say: \"You had the best example in the Messenger of Allah.\" (33:21)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 2074,
            "title": "Sunan Ibn Majah 2074",
            "narrator": "It was narrated from Aishah that:",
            "english_text": "she freed Barirah and the Messenger of Allah (ﷺ) gave her the choice, and she (Barirah) had a free husband.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 2075,
            "title": "Sunan Ibn Majah 2075",
            "narrator": "It was narrated that Ibn 'Abbas said:",
            "english_text": "\"The husband of Barirah was a slave called Mughith. It is as if I can see him now, walking behind her and weeping, with tears running down his cheeks. The Prophet (ﷺ) said to 'Abbas: 'O Abbas, are you not amazed by the love of Mughith for Barirah, and the hatred of Barirah for Mughith?' And the Prophet said to her: Why don’t you take him back, for he is the father of your child?' She said: 'O Messenger of Allah, are you commanding me (to do so)?' He said: 'No, rather I am interceding.' She said: 'I have no need of him.' \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 2076,
            "title": "Sunan Ibn Majah 2476",
            "narrator": "It was narrated that Aishah said:",
            "english_text": "'Three Sunan were established because of Barirah: She was given the choice (of whether to remain married) when she was freed, and her husband was a slave; they used to give her charity and she used to give it as a gift to the Prophet (ﷺ), and he would say: 'It is charity for her and a gift for us,' and he said, the 'Wala' is for the one who set the slave free.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 2077,
            "title": "Sunan Ibn Majah 2477",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"Barirah was told to observe the waiting period for three menstrual cycles.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 2078,
            "title": "Sunan Ibn Majah 2078",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah (ﷺ) gave Barirah the choice.",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 2079,
            "title": "Sunan Ibn Majah 2079",
            "narrator": "It was narrated from Ibn 'Urnar that the Messenger of Allah (ﷺ), said:",
            "english_text": "\"The divorce of a  slave woman is twice, and her waiting period is two menstrual cycles. \"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 2080,
            "title": "Sunan Ibn Majah 2080",
            "narrator": "It was narrated from 'Aishah that the Prophet (ﷺ) said:",
            "english_text": "\"The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles.\" Abu 'Asim said: \"I mentioned this to Muzahir and said: 'Tell me what you told Ibn Juraij.' So he told me, narrating from Qasim  from 'Aishah, that the Prophet (ﷺ) said: 'The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 2081,
            "title": "Sunan Ibn Majah 2081",
            "narrator": "It was narrated that Ibn 'Abbas said:",
            "english_text": "\"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah, my master married me to his slave woman, and now he wants to separate me and her.' The Messenger of Allah (ﷺ) ascended the pulpit and said: 'O people, what is the matter with one of you who marries his slave to his slave woman, then wants to separate them? Divorce belongs to the one who takes hold of the calf (i.e., her husband).’ “",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 2082,
            "title": "Sunan Ibn Majah 2082",
            "narrator": "lt was narrated that Abul Hasan, the freed slave of Banu Nawfal, said:",
            "english_text": "\"Ibn 'Abbas was asked about a slave who divorces his wife twice, then (they are freed). Can he marry her? He said: 'Yes.' It was said to him: 'On what basis?' He said: 'The Messenger of Allah (ﷺ) passed such a judgement .' \" (D a' if)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 2083,
            "title": "Sunan Ibn Majah 2083",
            "narrator": "It was narrated that 'Amr bin 'As said:",
            "english_text": "\"Do not corrupt the Sunnah of our Prophet Muhammad (ﷺ). The waiting period of an Umm Walad is four months and ten (days).\"",
            "grade": "Da,if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 2084,
            "title": "Sunan Ibn Majah 2084",
            "narrator": "It was narrated from Humaid bin Nafi' that:",
            "english_text": "he heard Zainab the daughter of Umm Salamah narrating that she heard Umm Salamah and Umm Habibah mention that a woman came to the Prophet (ﷺ) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (ﷺ) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 2085,
            "title": "Sunan Ibn Majah 2085",
            "narrator": "It was narrated from 'Aishah that:",
            "english_text": "the Prophet (ﷺ) said: \"It is not permissible for a woman to mourn for any deceased person for more than three days, except for her husband.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 2086,
            "title": "Sunan Ibn Majah 2086",
            "narrator": "It was narrated from Hafsah the wife of the Prophet (ﷺ) that:",
            "english_text": "the Messenger of Allah (ﷺ), said: \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for any deceased person for more than three days, except for her husband.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 2087,
            "title": "Sunan Ibn Majah 2087",
            "narrator": "It was narrated from Umm 'Atiyyah that the Messenger of Allah (ﷺ) said:",
            "english_text": "'No deceased person should be mourned for more than three days, except a woman should mourn for her husband for four months and ten days, and she should not wear dyed clothes, except for a garment of 'Asb, and she should not wear kohl or perfume, except at the beginning of her purity, when she may apply a little Qust and Azfar.’”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 2088,
            "title": "Sunan Ibn Majah 2088",
            "narrator": "It was narrated that 'Abdullah bin 'Umar said:",
            "english_text": "\"I had a wife whom I loved, but my father hated her. 'Umar mentioned that to the Prophet (ﷺ) and he ordered me to divorce her, so I divorced her.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 2089,
            "title": "Sunan Ibn Majah 2089",
            "narrator": "It was narrated from 'Abdur-Rahman that:",
            "english_text": "a man's father or mother - Shu'bah (one of the namators) was not sure - ordered him to divorce his wife, and he made a vow that he would free one hundred slaves if he did that. He came to Abu Darda' while he was praying the Duha, and he was making his prayer lengthy, and he prayed between Zuhr and 'Asr. Then he asked him and Abu Darda' said: \"Fulfill your vow and honor your parents.\" Abu Ad-Darda' said: \"I heard the Messenger of Allah (ﷺ) say: '(Honoring) one's father may lead one to enter through the best of the gates of Paradise; so take care of your parents, (it is so, whether you take care of them) or not. \"",
            "grade": "Hasan (Darussalam)"
        }
    ]
}