{
    "chapterNum": 15,
    "english_title": "The Chapters on Gifts",
    "totalHadiths_inChapter": 15,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 2375,
            "title": "Sunan Ibn Majah 2375",
            "narrator": "It was narrated that Nu'man bin Bashir said that his father took him to the Prophet (ﷺ) and said:",
            "english_text": "“Bear witness that I have given Nu'man such and such from my wealth.” He said: “Have you given all your children something like that which you have given to Nu'man?” He said: “No.” He said: “Then let someone other than me bear witness to that.” And he said: “Would you not like all your children to honor you equally?” He said: “Of course.” He said: “Then do not do this.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 2376,
            "title": "Sunan Ibn Majah 2376",
            "narrator": "It was narrated from Nu'man bin Bashir that:",
            "english_text": "his father gave him a gift of a slave, and he came to the Prophet (ﷺ) so that he could witness the gift. He said: “Have you given something to all of your children?” He said: “No.” He said: “Then take back (your gift).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 2377,
            "title": "Sunan Ibn Majah 2377",
            "narrator": "It was narrated from Ibn 'Abbas and Ibn 'Umar, who attributed the Hadith to the Prophet (ﷺ) that he said:",
            "english_text": "“It is not permissible for a man to give a gift then take it back, except what a father gives to his child.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 2378,
            "title": "Sunan Ibn Majah 2378",
            "narrator": "It was narrated from Amr bin Shu'aib, from his father, from, his Grandfather, that the Prophet (ﷺ) of Allah (SWT) said:",
            "english_text": "“None of you should take back his gift, except a father (taking it back) from his son.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 2379,
            "title": "Sunan Ibn Majah 2379",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "“There is no lifelong grant. Whoever is given something as a lifelong grant, it is his.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 2380,
            "title": "Sunan Ibn Majah 2380",
            "narrator": "It was narrated that Jabir said:",
            "english_text": "“I heard the Messenger of Allah (ﷺ) say: 'Whoever gives a lifelong grant to a man, it belongs to him (the recipient) and to his heirs. His (the giver's) words put an end to his right to it, and it belongs to the one to whom it was given for life and to his heirs.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 2381,
            "title": "Sunan Ibn Majah 2381",
            "narrator": "It was narrated from Zaid bin Thabit that :",
            "english_text": "the Prophet (ﷺ) ruled that a gift given for life belongs to the heirs (of the recipient).",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 2382,
            "title": "Sunan Ibn Majah 2382",
            "narrator": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:",
            "english_text": "“There is no Ruqba. Whoever is given a gift on the basis of Ruqba, it belongs to him, whether he lives or dies.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 2383,
            "title": "Sunan Ibn Majah 2383",
            "narrator": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:",
            "english_text": "“Umra belongs to the one to whom it is given, and Ruqba belongs to the one to whom it is given.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 2384,
            "title": "Sunan Ibn Majah 2384",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "“The likeness of one who takes back his gift is that of a dog that eats until it is full and vomits; then it goes back to its vomit and eats it again.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 2385,
            "title": "Sunan Ibn Majah 2385",
            "narrator": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:",
            "english_text": "“The one who takes back his gift is like the one who goes back to his vomit.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 2386,
            "title": "Sunan Ibn Majah 2386",
            "narrator": "It was narrated from Ibn`Umar that the Prophet (ﷺ) said:",
            "english_text": "“The one who takes back his gift is like the dog that goes back to its vomit.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 2387,
            "title": "Sunan Ibn Majah 2387",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
            "english_text": "“A man has more right to his gift so long as he has not gotten something in return for it.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 2388,
            "title": "Sunan Ibn Majah 2388",
            "narrator": "It was narrated from 'Amr  bin Shu'aib, from his father that he delivered:",
            "english_text": "“It is not permissible for a woman to dispose of her wealth except with her husband's permission, once he has married her.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 2389,
            "title": "Sunan Ibn Majah 2389",
            "narrator": "It was narrated from 'Abdullah bin Yahya, one of the sons of Ka'b bin Malik, from his grandfather, that :",
            "english_text": "his grandmother  Khairah, the wife of Ka'b bin Malik, came to the Messenger of Allah (ﷺ) with some jewelry belonging to her and said, I am giving this in charity. The Messenger of Allah (ﷺ) said to her: “It is not permissible for a woman to dispose of her wealth without her husband's permission. Did you ask Ka'b's permission?” She said: “Yes.” So the Messenger of Allah (ﷺ) sent for Ka'b bin Malik, her husband, and said, “Did you give Khairah permission to give her jewelry in charity?” He said: “Yes.” So the Messenger of Allah (ﷺ) accepted it from her.",
            "grade": "Da'if (Darussalam)"
        }
    ]
}