{
    "chapterNum": 10,
    "english_title": "The Chapters on Marriage",
    "totalHadiths_inChapter": 171,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 1845,
            "title": "Sunan Ibn Majah 1845",
            "narrator": "It was narrated that:",
            "english_text": "Alqamah bin Qais said: “I was with Abdullah bin Masud in Mina, and Uthman took him aside. I was sitting near him. Uthman said to him: 'Would you like that I marry you to a young virgin who will remind you of how you were in the past?' When Abdullah saw that he did not say anything to him apart from that, he gestured to me, so I came and he said: 'As you say that the Messenger of Allah said “O young men, whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding one's chastity. Whoever cannot afford it, let him fast, for it will diminish his desire.” ' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 1846,
            "title": "Sunan Ibn Majah 1846",
            "narrator": "It was narrated from Aishah that:",
            "english_text": "the Messenger of Allah said: “Marriage is part of my sunnah, and whoever does not follow my sunnah has nothing to do with me. Get married, for I will boast of your great numbers before the nations. Whoever has the means, let him get married, and whoever does not, then he should fast for it will diminish his desire.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 1847,
            "title": "Sunan Ibn Majah 1847",
            "narrator": "It was narrated from Ibn Abbas that:",
            "english_text": "the Messenger of Allah said: “There is nothing like marriage, for two who love one another.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 1848,
            "title": "Sunan Ibn Majah 1848",
            "narrator": "It was narrated that:",
            "english_text": "Sa'd said: “The Messenger of Allah disapproved of Uthman bin Maz'un's desire to remain celibate; if he had given him permission, we would have gotten ourselves castrated.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 1849,
            "title": "Sunan Ibn Majah 1849",
            "narrator": "It was narrated from Samurah that:",
            "english_text": "the Messenger of Allah(ﷺ) forbade celibacy. Zaid bin Akhzam added: “And Qatadah recited: 'And indeed We sent Messengers before you (O Muhammad (ﷺ)), and made for them wives and offspring.'”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 1850,
            "title": "Sunan Ibn Majah 1850",
            "narrator": "It was narrated from Hakim bin Muawiyah, from his father, that:",
            "english_text": "a man asked the Prophet(ﷺ): “What are the right of the woman over her husband?” He said: “That he should feed her as he feeds himself and clothe her as he clothes himself; he should not strike her on the face nor disfigure her, and he should not abandon her except in the house (as a form of discipline).” (Hassan)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 1851,
            "title": "Sunan Ibn Majah 1851",
            "narrator": "It was narrated that:",
            "english_text": "Sulaiman bin Amr bin Ahwas said: “My father told me that he was present at the Farewell Pilgrimage with the Messenger of Allah. He praised and glorified Allah, and reminded and exhorted (the people). Then he said: 'I enjoin good treatment of women, for they are prisoners with you, and you have no right to treat them otherwise, unless they commit clear indecency. If they do that, then forsake them in their beds and hit them, but without causing injury or leaving a mark. If they obey you, then do not seek means of annoyance against them. You have rights over your women and your women have rights over you. Your rights over your women are that they are not to allow anyone whom you dislike to tread on your bedding (furniture), nor allow anyone whom you dislike to enter your houses. And their right over you are that you should treat them kindly with regard to their clothing and food.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 1852,
            "title": "Sunan Ibn Majah 1852",
            "narrator": "It was narrated from Aishah:",
            "english_text": "that the messenger of Allah of said: “If I were to command anyone to prostrate to anyone else, I would have commanded women to prostrate to their husbands. If a man were to command his wife to move (something) from a red mountain to a black mountain, and from a black mountain to a red mountain, her duty is to obey to him.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 1853,
            "title": "Sunan Ibn Majah 1853",
            "narrator": "It was narrated that:",
            "english_text": "Abdullah bin Abu Awfa said “When Muadh bin Jabal came from Sham, he prostrated to the Prophet who said: 'What is this, O Muadh?' He said: 'I went to Sham and saw them prostrating to their bishops and patricians and I wanted to do that for you.' The messenger of Allah said: 'Do not do that. If I were to command anyone to prostrate to anyone other than Allah, I would have commanded women to prostrate to their husbands. By the One in Whose Hand is the soul of Muhammad! No woman can fulfill her duty towards Allah until she fulfills her duty towards her husband. If he asks her (for intimacy) even if she is on her camel saddle, she should not refuse.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 1854,
            "title": "Sunan Ibn Majah 1854",
            "narrator": "It was narrated that from Musawir Al Himyari from his mother that:",
            "english_text": "she heard Umm Salamah say: “I heard the Messenger of Allah say: 'Any woman who dies when her husband is pleased with her, will enter Paradise.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 1855,
            "title": "Sunan Ibn Majah 1855",
            "narrator": "It was narrated that from Abdullah bin Amr that\n\n:",
            "english_text": "the Messenger of Allah said: “This world is but provisions, and there is no provision in this world better than a righteous wife.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 1856,
            "title": "Sunan Ibn Majah 1856",
            "narrator": "It was narrated that:",
            "english_text": "Thawban said: “When the Verse concerning silver and gold was revealed, they said: 'What kind of wealth should we acquire?' Umar said: 'I will tell you about that.' So he rode on his camel and caught up with the Prophet, and I followed him. He said: 'O Messenger of Allah what kind of wealth should we acquire?' He said: 'Let one of you acquire a thankful heart, a tongue that remembers Allah and a believing wife who will help him with regard to the Hereafter.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 1857,
            "title": "Sunan Ibn Majah 1857",
            "narrator": "It was narrated from Abu Umamah that:",
            "english_text": "the Prophet used to say: “Nothing is of more benefit to the believer after Taqwa of Allah than a righteous wife whom, if he commands her she obeys him, if he looks at her he is pleased, if he swears an oath concerning her she fulfills it, and when he is away from her she is sincere towards him with regard to herself and his wealth.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 1858,
            "title": "Sunan Ibn Majah 1858",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Prophet said: “A woman may be married for four things: Her wealth, her lineage, her beauty or for her religion. Choose the religious, may your hands be rubbed with dust (i.e., may you prosper).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 1859,
            "title": "Sunan Ibn Majah 1859",
            "narrator": "It was narrated from Abdullah bin Amr that:",
            "english_text": "the Prophet said: “Do not marry women for their beauty for it may lead to their doom. Do not marry them for their wealth, for it may lead them to fall into sin. Rather, marry them for their religion. A black slave woman with piercings who is religious is better.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 1860,
            "title": "Sunan Ibn Majah 1860",
            "narrator": "It was narrated that:",
            "english_text": "Jabir bin Abdullah said: “I married a woman during the time of the Prophet and he said: 'Have you got married, O Jabir?' I said: 'Yes'. He said: 'To a virgin or to a previously-married woman?' I said: 'A previously married woman.' He said: 'Why not a virgin so you could play with her?' I said: 'I have sisters and did not want her to create trouble between them and me.' He said: 'That is better then.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 1861,
            "title": "Sunan Ibn Majah 1861",
            "narrator": "It was narrated from Abdur-Rahman bin Salim bin Utbah bin Salim bin Uwaim bin Sa'idah Al-Ansari, from his father that:",
            "english_text": "his grandfather said: “The Messenger of Allah said: 'You should marry virgins, for their mouths are sweeter, their wombs are more prolific and they are satisfied with less.'”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 1862,
            "title": "Sunan Ibn Majah 1862",
            "narrator": "It was narrated that:",
            "english_text": "Anas bin Malik said: “I heard the Messenger of Allah say: 'Whoever wants to meet Allah pure and purified, let him marry free women.' ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 1863,
            "title": "Sunan Ibn Majah 1863",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah said: “Marry, for I will boast of your great numbers.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 1864,
            "title": "Sunan Ibn Majah 1864",
            "narrator": "It was narrated that:",
            "english_text": "Muhammad bin Salamah said: “I proposed marriage to a woman, then I hid and waited to see her until I saw her among some date palm trees that belonged to her.” It was said to him: “Do you do such a thing when you are a companion of the Messenger of Allah?” He said: “I heard the Messenger of Allah saying: 'When Allah causes a man to propose to a woman, there is nothing wrong with him looking at her.' ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 1865,
            "title": "Sunan Ibn Majah 1865",
            "narrator": "It was narrated from Anas bin Malik that:",
            "english_text": "Mughirah bin Shubah wanted to marry a woman. The Prophet (ﷺ) said to him: “Go and look at her, for that is more likely to create love between you.” So he did that, and married her, and mentioned how well he got along with her.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 1866,
            "title": "Sunan Ibn Majah 1866",
            "narrator": "It was narrated that:",
            "english_text": "Mughirah bin Shubah said: “I came to the Prophet and told him of a woman to whom I had to propose marriage. He said: 'Go and look at her, for that is more likely to create love between you.' So I went to a woman among the Ansar and proposed marriage through her parents. I told them what the Prophet had said, and it was as if they did not like that. Then I heard that woman, behind her curtain, say: 'If the Messenger of Allah has told you to do that, then do it, otherwise I adjure you by Allah (not to do so)'. And it was as if she regarded that as a serious matter. So I looked at her and married her.” And he mentioned how well he got along with her.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 1867,
            "title": "Sunan Ibn Majah 1867",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah said: “A man should not propose to a woman to whom his brother has already proposed.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 1868,
            "title": "Sunan Ibn Majah 1868",
            "narrator": "It was narrated from Ibn Umar that:",
            "english_text": "the Messenger of Allah said: “A man should not propose to a woman to whom his brother has already proposed.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 1869,
            "title": "Sunan Ibn Majah 1869",
            "narrator": "It was narrated that:",
            "english_text": "Abu Bakr bin Abu Jahm bin Sukhair Al-Adawi said: “I heard Fathima bint Qais say: 'The Messenger of Allah said to me: “When you become lawful, tell me.” So I told him.' Then Muawiyah, Abu Jahm bin Sukhair and Usamah bin Zaid proposed marriage to her. The Messenger of Allah said: 'As for Muawiyah, he is a poor man who has no money. As from Abu Jahm he is a man who habitually beats woman. But Usamah (is good).' She gestured with her hand, saying: 'Usamah, Usamah!?' The Messenger of Allah said to her: 'Obedience to Allah and obedience to His Messenger is better for you.' She said: 'So I married him and I was pleased with him.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 1870,
            "title": "Sunan Ibn Majah 1870",
            "narrator": "It was narrated from Ibn Abbas that:",
            "english_text": "the Messenger of Allah said: “A widow has more right (to decide) concerning herself than her guardian, and a virgin should be consulted”. It was said: “O Messenger of Allah, a virgin may be too shy to speak.” He said: “Her consent is her silence.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 1871,
            "title": "Sunan Ibn Majah 1871",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah said: “A previously-married woman should not be married until she is consulted, and a virgin should not be married until her consent is sought, and her consent is her silence.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 1872,
            "title": "Sunan Ibn Majah 1872",
            "narrator": "It was narrated from Adi bin Adi Al-Kindi that:",
            "english_text": "his father said: “The Messenger of Allah said: 'A previously-married woman can speak for herself, and the consent of a virgin is her silence.' ”",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 1873,
            "title": "Sunan Ibn Majah 1873",
            "narrator": "Abdur Rahman bin Yazid Al-Ansari and Mujamma bin Yazid Al-Ansari said:",
            "english_text": "that a man among them who was called Khidam arranged a marriage for his daughter, and she did not like the marriage arranged by her father. She went to the Messenger of Allah and told him about that, and he annulled the marriage arranged by her father. Then she married Abu Lubabah bin Abdul-Mundhir.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 1874,
            "title": "Sunan Ibn Majah 1874",
            "narrator": "It was narrated from Ibn Buraidah that:",
            "english_text": "his father said: “A girl came to the Prophet and said: 'My father married me to his brother's son so that he might raise his status thereby.' The Prophet gave her the choice, and she said: 'I approve of what my father did, but I wanted women to know that their fathers have no right to do that.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 1875,
            "title": "Sunan Ibn Majah 1875",
            "narrator": "It was narrated from Ibn Abbas that:",
            "english_text": "a virgin girl came to the Prophet and told him that her father arranged a marriage that she did not like, and the Prophet gave her the choice.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 1876,
            "title": "Sunan Ibn Majah 1876",
            "narrator": "It was narrated that:",
            "english_text": "Aishah said: “The Messenger of Allah married me when I was six years old. Then we came to Al-Madinah and settled among Banu Harith bin Khazraj. I became ill and my hair fell out, then it grew back and became abundant. My mother Umm Ruman came to me while I was on an Urjuhah with some of my friends, and called for me. I went to her, and I did not know what she wanted. She took me by the hand and made me stand at the door of the house, and I was panting. When I got my breath back, she took some water and wiped my face and head, and led me into the house. There were some woman of the Ansar inside the house, and they said: 'With blessings and good fortune (from Allah).' (My mother) handed me over to them and they tidied me up. And suddenly I saw the Messenger of Allah in the morning. And she handed me over to him and I was at that time, nine years old.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 1877,
            "title": "Sunan Ibn Majah 1877",
            "narrator": "It was narrated that:",
            "english_text": "Abdullah said: “The Prophet married Aishah when she was seven years old, and consummated the marriage with her when she was nine, and he passed away when she was eighteen.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 1878,
            "title": "Sunan Ibn Majah 1878",
            "narrator": "It was narrated from Ibn Umar that:",
            "english_text": "when Uthman bin Mazun died, he left behind a daughter. Ibn Umar said: “My maternal uncle Qudamah, who was her paternal uncle, married me to her, but he did not consult her. That was after her father had died. She did not like this marriage, and the girl wanted to marry Mughirah bin Shubah, so she married him.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 1879,
            "title": "Sunan Ibn Majah 1879",
            "narrator": "It was narrated from Aishah that\n:",
            "english_text": "the Messenger of Allah said: “Any woman whose marriage is not arranged by her guardian, her marriage is invalid, her marriage is invalid, her marriage is invalid. If (the man) has had intercourse with her, then the Mahr belongs to her in return for his intimacy with her. And if there is any dispute then the ruler is the guardian of the one who does not have a guardian.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 1880,
            "title": "Sunan Ibn Majah 1880",
            "narrator": "It was narrated that:",
            "english_text": "Aisha and Ibn Abbas said: “The Messenger of Allah said: 'There is no marriage except with a guardian.' ”According to the Hadith of Aishah: “And the ruler is the guardian of the one who does not have a guardian. ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 1881,
            "title": "Sunan Ibn Majah 1881",
            "narrator": "It was narrated from Abu Musa that:",
            "english_text": "the Messenger of Allah said: “There is no marriage except with a guardian.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 1882,
            "title": "Sunan Ibn Majah 1882",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah said: “No woman should arrange the marriage of another woman, and no woman should arrange her own marriage. The adulteress is the one who arranges her own marriage.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 1883,
            "title": "Sunan Ibn Majah 1883",
            "narrator": "It was narrated that:",
            "english_text": "Ibn Umar said: “The Messenger of Allah forbade Shighar. Shighar is when a man says to another man: 'Marry your daughter or sister to me, on condition that I will marry my daughter or sister to you,' and they do not give any dower (i.e. neither of them give other the dower).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 1884,
            "title": "Sunan Ibn Majah 1884",
            "narrator": "It was narrated that:",
            "english_text": "Abu Hurairah said: “The Messenger of Allah forbade Shighar.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 1885,
            "title": "Sunan Ibn Majah 1885",
            "narrator": "It was narrated from Anas bin Malik that:",
            "english_text": "the Messenger of Allah said: “There is no Shighar in Islam.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 1886,
            "title": "Sunan Ibn Majah 1886",
            "narrator": "It was narrated that:",
            "english_text": "Abu Salamah said: “I asked Aishah: 'How much was the dowry of the wives of the Prophet?' She said: 'The dowry he gave to his wives was twelve Uqiyyah and a Nash (of silver). Do you know what a Nash is? It is one half of an Uqiyyah. And that is equal to to five hundred Dirham.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 1887,
            "title": "Sunan Ibn Majah 1887",
            "narrator": "It was narrated that:",
            "english_text": "Abu Ajfa As-Sulami said: “Umar bin Khattab said: 'Do not go to extremes with regard to the dowries of women, for if that were a sign of honor and dignity in this world or a sign of Taqwa before Allah, then Muhammad (ﷺ) would have done that before you. But he did not give any of his wives and none of his daughters were given more than twelve uqiyyah. A man may increase dowry until he feels resentment against her and says: “You cost me everything I own,” or, “You caused me a great deal of hardship.”'” (Hassan)",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 1888,
            "title": "Sunan Ibn Majah 1888",
            "narrator": "It was narrated from Abdullah bin Amir bin Rabiah from his father, that:",
            "english_text": "A man among Banu Fazarah got married for a pair of sandals, and the Prophet permitted his marriage.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 1889,
            "title": "Sunan Ibn Majah 1889",
            "narrator": "It was narrated that:",
            "english_text": "Sahl bin Sa'd said: “A woman came to the Prophet and he said: 'Who will marry her ?' A man said: 'I will.' The Prophet said: 'Give her something, even if it is an iron ring.' He said: 'I do not have one.' He said: 'I marry her to you for what you know of the Quran.'”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 1890,
            "title": "Sunan Ibn Majah 1890",
            "narrator": "It was narrated from Abu Saeed Al-Khudri that:",
            "english_text": "the Prophet (ﷺ) married Aishah with the household goods the value of which was fifty Dirham.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 1891,
            "title": "Sunan Ibn Majah 1891",
            "narrator": "It was narrated from Masruq that:",
            "english_text": "Abdullah was asked about a man who married a woman and died without having consummated the marriage with her, nor stipulating the dowry. Abdullah said: “The dowry is hers, and the inheritance is hers and she has to observe the waiting period.” Ma'qil bin Sinan Al-Ashja'i said: “I saw the Messenger of Allah (ﷺ) pass a similar ruling concerning Birwa' bint Washiq.” (Sahih)\n\nAnother chain from 'Alqamah, from Abdullah, with similar wording.\nIt was narrated from Masruq that:\nAbdullah was asked about a man who married a woman and died without having consummated the marriage with her, nor stipulating the dowry. Abdullah said: “The dowry is hers, and the inheritance is hers and she has to observe the waiting period.” Ma'qil bin Sinan Al-Ashja'i said: “I saw the Messenger of Allah pass a similar ruling concerning Birwa' bint Washiq.” (Sahih)\n\nAnother chain from 'Alqamah, from Abdullah, with similar wording.",
            "grade": "Da'if, (Darussalam)"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 1892,
            "title": "Sunan Ibn Majah 1892",
            "narrator": "It was narrated that:",
            "english_text": "`Abdullah bin Mas`ud said: “The Messenger of Allah (ﷺ) was granted a combination of all manner of goodness, as well as its seal,” or he said: “The opening (of the way to) all good. He (ﷺ) taught us the Khutbah of prayer and Khutbah of need. 'The Khutbah of prayer is: At-tahiyyatu lillahi was-salawatu wat-tayyibat. As-salamu `alaika ayyuhan-Nabiyyu was rahmat-ullahi was barakatuhu. As-salamu `alaina wa `ala `ibadillahis-salihin. Ashhadu an la ilaha illallah. Wa ashhadu anna Muhammadan `abduhu wa rasuluh (All compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that none has the right to be worshiped but Allah. And I bear witness that Muhammad (ﷺ) is His slave and Messenger). The Khutbah of need is: Al-hamdu lillahi nahmadhu wa nasta`inuhu wa nastaghfiruhu, wa na`udhu billahi min shururi anfusina wa min sayi'ati a`malina, man yahdihillahu fala mudilla lahu, wa man yudlil fala hadiya lahu. Wa ashadu an la ilaha illallahu wahduhu la sharika lahu, wa anna Muhammadan `abduhu wa rasuluhu. (Praise is to Allah, we praise Him and we seek His help and His forgiveness. We seek refuge with Allah from the evil of our own souls and from our bad deeds, Whomsoever Allah guides will never be led astray; and whomsoever is led astray, no one can guide. I bear witness that none has the right to be worshiped but Allah, alone with no partner or associate, and that Muhammad (ﷺ) is His slave and His Messenger). Then add to your Khutbah the following three verses: 'O you who believe! Fear Allah as He should be feared, and die not except in the state of Islam (as Muslims) with complete submission to Allah.' And: 'O mankind! Be dutiful to your Lord, Who created you from a single person, and from him He created his wife, and from them both He created many men and women, and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever an All-Watcher over you.' And: 'O you who believe! Keep your duty to Allah and fear Him, and speak (always) the truth. He will direct you to do righteous good deeds and will forgive you your sins...' until the end of the verse.”",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 1893,
            "title": "Sunan Ibn Majah 1893",
            "narrator": "It was narrated from Ibn `Abbas that:",
            "english_text": "The Prophet (ﷺ) said: “Al-hamdu lillahi nahmadhu wa nasta`inuhu wa na`udhu billahi min shururi anfusina wa min sayi'ati a`malina, man yahdihillahu fala mudilla lahu, wa man yudlil fala hadiya lahu. Wa ashadu an la ilaha illallahu wahduhu la sharika lahu, wa anna Muhammadan `abduhu wa rasuluhu. Amma ba`d. (Praise is to Allah, we praise Him and we seek His help. We seek refuge with Allah from the evil of our own souls and from our bad deeds, Whomsoever Allah guides will never be led astray; and whomsoever is led astray, no one can guide. I bear witness that none has the right to be worshiped but Allah, alone with no partner or associate, and that Muhammad is His slave and His Messenger. To proceed).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 1894,
            "title": "Sunan Ibn Majah 1894",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of  Allah said: “Every important matter that does not start with praise of Allah, is devoid (of blessings).”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 1895,
            "title": "Sunan Ibn Majah 1895",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Prophet said: “Announce this marriage, and beat the sieve for it.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 1896,
            "title": "Sunan Ibn Majah 1896",
            "narrator": "It was narrated from Muhammad bin Hatib\nthat the Messenger of Allah said:",
            "english_text": "“What differentiates between the lawful and the unlawful is (beating) the Daff and raising the voices (in song) at the time of marriage.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 1897,
            "title": "Sunan Ibn Majah 1897",
            "narrator": "It was narrated that Abu Husain, whose name was Khalid Al-Madani, said:",
            "english_text": "“We were in Al-Madinah on the Say of 'Ashura and the girls were beating the Daff and singing. We entered upon Rubai' bint Mu'awwidh and mentioned that to her. She said: 'The Messenger of Allah entered upon me on the morning of my wedding, and there were two girls with me who were singing and mentioning the qualities of my forefathers who were killed on the Day of Badr. One of the things they were saying was: “Among us there is a Prophet who knows what will happen tomorrow.” He said: “Do not say this, for no one knows what will happen tomorrow except Allah.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 1898,
            "title": "Sunan Ibn Majah 1898",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“Abu Bakr entered upon me, and there were two girls from the Ansar with me, singing about the Day of Bu'ath.” She said: “And they were not really singers. Abu Bakr said: 'The wind instruments of Satan in the house of the Prophet ?' That was on the day of 'Eid(Al-Fitr). But the Prophet said: 'O Abu Bakr, every people has its festival and this is our festival.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 1899,
            "title": "Sunan Ibn Majah 1899",
            "narrator": "It was narrated from Anas bin Malik:",
            "english_text": "that the Prophet passed by some part of Al-Madinah and saw some girls beating their Daff And singing, saying: “We are girls from Banu Najjar what an excellent neighbor is Muhammad.” The Prophet said: “Allah knows that you are dear to me.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 1900,
            "title": "Sunan Ibn Majah 1900",
            "narrator": "It was narrated that Ibn'Abbas said:",
            "english_text": "'Aisha arranged a marriage for a female relative of hers among the Ansar. The Messenger of Allah came and said: Have you taken the girl (to her husbands house)?” They said: “Yes.” He said: “Have you sent someone with her to sing?” She said: “No.” The Messenger of Allah said: “The Ansar are People with romantic feelings. Why don't you send someone with her to say: 'We have come to you, we have come to you, may Allah bless you and us?'”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 1901,
            "title": "Sunan Ibn Majah 1901",
            "narrator": "It was narrated that Mujahid said:",
            "english_text": "“I was with Ibn Umar, and he heard the sound of a drum, so he put his fingers in his ears and turned away. He did that three times, then he said: “This is what I saw the Messenger of Allah do.' ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 1902,
            "title": "Sunan Ibn Majah 1902",
            "narrator": "It was narrated from Umm Salamah:",
            "english_text": "that the Prophet Mohammad entered upon her, and he heard an effeminate man say to 'Abdullah bin Abu Umayyah: “If  Allah enables you to conquer Ta'if tommorrow, I will show you a woman who comes in on four (rolls of fat) and goes out on eight.” The Messenger of Allah said: “Throw them out of your houses.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 1903,
            "title": "Sunan Ibn Majah 1903",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Messenger of Allah cursed women who imitate men and men who imitate women.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 1904,
            "title": "Sunan Ibn Majah 1904",
            "narrator": "It was narrated from Ibn 'Abbas:",
            "english_text": "that the Prophet cursed men who imitate women and woman who imitate men.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 1905,
            "title": "Sunan Ibn Majah 1905",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Prophet used to say, when offering congratulations of the occasion of marriage: “Barak Allahu lakum, wa barak 'alaikum, wa jama'a bainakuma fi khair (May Allah bless you and bestow blessings upon you,  and bring you together in harmony).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 1906,
            "title": "Sunan Ibn Majah 1906",
            "narrator": "It was narrated from `Aqil bin Abu Talib:",
            "english_text": "that he married a woman from Banu Jusham, and they said: “May you live in harmony and have many sons.” He said: “Do not say that, rather say what the Messenger of Allah said: 'Allahumma barik lahum wa barik `alaihim (O Allah, bless them and bestow blessings upon them).' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 1907,
            "title": "Sunan Ibn Majah 1907",
            "narrator": "It was narrated from Anas bin Malik:",
            "english_text": "the Prophet saw traces of yellow perfume on 'Abdur-Rahmaan bin 'Awf, and he asked him “What is this?” He said: “O Messenger of Allah, I married a women for the weight of a Nawah (Stone) of gold. He said: “May Allah bless you. Give a feast even if it is only with one sheep.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 1908,
            "title": "Sunan Ibn Majah 1908",
            "narrator": "It was narrated that Anas bin Malik said:",
            "english_text": "“I never saw the Messenger of Allah give a wedding feast for any of his wives like the feast he gave for Zainab, for which he slaughtered a sheep.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 1909,
            "title": "Sunan Ibn Majah 1909",
            "narrator": "It was narrated from Anas bin Malik:",
            "english_text": "that the Prophet offered Sawiq and dates as a wedding feast for Safiyyah.",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 1910,
            "title": "Sunan Ibn Majah 1910",
            "narrator": "It was narrated from Sufyan (Ibn 'Uyainah) from `Ali bin Zaid bin Ju`dan from Anas bin Malik who said:",
            "english_text": "“I attended a wedding feast for the Prophet in which there was no meat and no bread.”\n\nIbn Majah said: It was not narrated except by Ibn `Uyainah.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 1911,
            "title": "Sunan Ibn Majah 1911",
            "narrator": "It was narrated that 'Aishah and Umm Salamah said:",
            "english_text": "“The Messenger of Allah commanded us to prepare Fatimah (for her wedding) and take her in to 'Ali. We went to the house and sprinkled it with soft earth from the land of Batha'. Then we stuffed two pillows with (date - palm) fiber which we picked with our own hands. Then we offered dates and raisins to eat, and sweet water to drink. We went and got some wood and set it up at the side of the room, to hang the clothes and water skins on. And we never saw any wedding better than the wedding of Fatimah.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 1912,
            "title": "Sunan Ibn Majah 1912",
            "narrator": "It was narrated that Sahl bin Sa'd  As-Sa'idi said:",
            "english_text": "“Abu Usaid As-Sa'idi invited the Messenger of Allah to his wedding, and the bride herself served them. She said: 'Do you know what I gave the Messenger of Allah to drink? I had soaked some dates the night before, then in the morning I strained them and gave him that water to drink.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 1913,
            "title": "Sunan Ibn Majah 1913",
            "narrator": "It was narrated that Abu Hurairah said:",
            "english_text": "“The worst of food is food of a wedding feast to which the rich are invited and the poor are not. Whoever does not accept an invitation has disobeyed Allah and His Messenger.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 1914,
            "title": "Sunan Ibn Majah 1914",
            "narrator": "It was narrated from Ibn 'Umar:",
            "english_text": "that the Messenger of Allah said: “If anyone of you is invited to a wedding feast, let him accept.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 1915,
            "title": "Sunan Ibn Majah 1915",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Messenger of Allah said: 'The wedding feast on the first day is an obligation, on the second day is a custom and on the third day is showing off.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 1916,
            "title": "Sunan Ibn Majah 1916",
            "narrator": "It was narrated from Anas:",
            "english_text": "that the Messenger of Allah said: “Three days for a previously-married woman and seven days for a virgin.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 1917,
            "title": "Sunan Ibn Majah 1917",
            "narrator": "It was narrated from Al-Harith from his father that when when the Messenger of Allah (ﷺ) married Umm Salamah, he stayed with her for three days, then he said:",
            "english_text": "“You are not insignificant in your husband's eyes. If you wish, I will stay with you for seven days, but then I will stay with my other wives for seven days too.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 1918,
            "title": "Sunan Ibn Majah 1918",
            "narrator": "It was narrated from 'Abdullah bin 'Amr:",
            "english_text": "that the Prophet said: “When anyone of you gets a new wife, a servant, or an animal, let him take hold of the forelock and say: Allahumma inni as`aluka min khayriha wa khayri ma jubilat 'alaihi, wa 'audhu bika min sharriha wa sharri ma jubilat `alaih (O Allah, I ask You for the goodness within her and the goodness that she is inclined towards, and I seek refuge with you from the evil to which she is inclined).' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 75,
            "hadithNum_inBook": 1919,
            "title": "Sunan Ibn Majah 1919",
            "narrator": "It was narrated from Ibn `Abbas:",
            "english_text": "that the Prophet said: “When anyone of you has intercourse with his wife, let him say: Allahumma  jannibnish-Shaitana  wa jannibish-Shaitana ma razaqtani (O Allah, keep Satan away from me and keep Satan away from that with which You bless me).'  Then if they have a child, Allah will never allow Satan to gain control over him or he will never harm him.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 76,
            "hadithNum_inBook": 1920,
            "title": "Sunan Ibn Majah 1920",
            "narrator": "Bahz bin Hakim narrated from his father that his grandfather said:",
            "english_text": "“I said: 'O Messenger of Allah, with regard to our 'Awrah, what may we uncover of it and what must we conceal?' He said: 'Cover your 'Awrah, except from your wife and those whom your right hand possesses.' I said: 'O Messenger of Allah, what if the people live close together?' He said: 'If you can make sure that no one sees it, then do not let anyone see it.' I said: 'O Messenger of Allah, what if one of us is alone?' He said: 'Allah is more deserving that you should feel shy before Him than People.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 77,
            "hadithNum_inBook": 1921,
            "title": "Sunan Ibn Majah 1921",
            "narrator": "It was narrated from 'Utbah bin 'Abd Sulamain:",
            "english_text": "that the Messenger of Allah said: “When anyone of you has intercourse with his wife, let him cover himself and not be naked liked donkeys.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 78,
            "hadithNum_inBook": 1922,
            "title": "Sunan Ibn Majah 1922",
            "narrator": "It was narrated from a freed slave of 'Aishah that 'Aishah said:",
            "english_text": "“I never looked at or I never saw the private part of the Messenger of Allah.' ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 79,
            "hadithNum_inBook": 1923,
            "title": "Sunan Ibn Majah 1923",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Prophet said: “Allah will not look at a man who has intercourse with his wife in her buttocks.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 80,
            "hadithNum_inBook": 1924,
            "title": "Sunan Ibn Majah 1924",
            "narrator": "It was narrated from Khuzaimah bin Thabit:",
            "english_text": "That the Messenger of Allah (ﷺ) said: “Allah is not too shy to tell the truth,” three times.  “Do not have intercourse with women in their buttocks.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 81,
            "hadithNum_inBook": 1925,
            "title": "Sunan Ibn Majah 1925",
            "narrator": "It was narrated from Muhammad bin Munkadir:",
            "english_text": "that he heard Jabir bin 'Abdullah say: “The Jews used to say that if a man has intercourse with a woman in her vagina from the back, the child would have a squint. Then Allah, Glorious is He, revealed: 'Your wives are a tilth for you, so go to your tilth, when or how you will.' ”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 82,
            "hadithNum_inBook": 1926,
            "title": "Sunan Ibn Majah 1926",
            "narrator": "It was narrated that Abu Sa'eed Al-Kudri said:",
            "english_text": "“A man asked the Messenger of about coitus interruptus. He said: 'Do you do that? If you do not do so, it will not harm; for there is no soul that (SWT) has decreed will exist but it will come into being.' “",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 83,
            "hadithNum_inBook": 1927,
            "title": "Sunan Ibn Majah 1927",
            "narrator": "It was narrated that Jabir said:",
            "english_text": "'We used to practice coitus interruptus during the time of the Messenger of Allah when the Qur'an was being revealed.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 84,
            "hadithNum_inBook": 1928,
            "title": "Sunan Ibn Majah 1928",
            "narrator": "It was narrated that 'Umar bin Khattab said:",
            "english_text": "“The Messenger of Allah forbade practicing coitus interruptus with a free woman except with her consent.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 85,
            "hadithNum_inBook": 1929,
            "title": "Sunan Ibn Majah 1928",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Prophet said: “A woman should not be married to a man who is married to her paternal aunt of maternal aunt (at the same time).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 86,
            "hadithNum_inBook": 1930,
            "title": "Sunan Ibn Majah 1930",
            "narrator": "It was narrated that Abu Sa'eed Al-Khudri said:",
            "english_text": "“I heard the Messenger of Allah forbid two types of marriage: For a man to be married to a woman and her paternal aunt (at the same time), and to a woman and her maternal aunt( at the same time).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 87,
            "hadithNum_inBook": 1931,
            "title": "Sunan Ibn Majah 1931",
            "narrator": "Abu Bakr bin Abu Musa narrated that his father said:",
            "english_text": "“The Messenger of Allah said: “A man should not be married to a woman and her paternal aunt or maternal aunt at the same time.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 88,
            "hadithNum_inBook": 1932,
            "title": "Sunan Ibn Majah 1932",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the wife of Rifa'ah Al-Qurazi came to the Messenger of Allah and said: “I was married to Rifa'ah, and he divorced me and made it irrevocable. Then I married ' Abdur-Rahman bin Zubair, and what he has is like the fringe of a garment.” The Prophet smiled and said: “Do you want to go back to Rifa'ah? No, not until you taste his ('Abdur-Rahman's) sweetness and he tastes your sweetness.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 89,
            "hadithNum_inBook": 1933,
            "title": "Sunan Ibn Majah 1933",
            "narrator": "It was narrated from Ibn 'Umar,:",
            "english_text": "from the Prophet, concerning a man who had a wife then divorced her, then another man married her but divorced her before consummating the marriage. Could she go back to the first man? He said: “No, not until he tastes her sweetness.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 90,
            "hadithNum_inBook": 1934,
            "title": "Sunan Ibn Majah 1934",
            "narrator": "It was narrated that Ibn 'Abbas said:",
            "english_text": "“The Messenger of Allah cursed the Muhallil and the Muhallal lahu.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 91,
            "hadithNum_inBook": 1935,
            "title": "Sunan Ibn Majah 1935",
            "narrator": "It was narrated that 'Ali said:",
            "english_text": "“The Massenger of Allah cursed the Muhallil and the Muhallal lahu.”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 92,
            "hadithNum_inBook": 1936,
            "title": "Sunan Ibn Majah 1936",
            "narrator": "'Uqbah bin 'Amir narrated:",
            "english_text": "that the Messenger of said: 'Shall I not tell you of a borrowed billy goat.” They said: “Yes, O Messenger of!” He said: “He is Muhallil. May curse the Muhallil and the Muhallal lahu.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 93,
            "hadithNum_inBook": 1937,
            "title": "Sunan Ibn Majah 1937",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Messenger of Allah said: 'Breast-feeding makes unlawful (for marriages) the same things that blood tie make unlawful.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 94,
            "hadithNum_inBook": 1938,
            "title": "Sunan Ibn Majah 1938",
            "narrator": "It was narrated from Ibn 'Abbas:",
            "english_text": "that the Messenger of was offered the daughter of Hamzah bin 'Abdul-Muttalib in marriage, and he said: “She is the daughter of my brother through breastfeeding, and breastfeeding makes unlawful (for marriage) the same things that blood ties make unlawful.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 95,
            "hadithNum_inBook": 1939,
            "title": "Sunan Ibn Majah 1939",
            "narrator": "It was narrated from 'Urwah bin Zubair that Zainab bint Abi Salmah told him that Umm Habibah told her that she said to Messenger of Allah:",
            "english_text": "“Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry Durrah bint Abi Salmah.” The Messenger of Allah said:  The daughter of Umm Salamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 96,
            "hadithNum_inBook": 1940,
            "title": "Sunan Ibn Majah 1940",
            "narrator": "It was narrated that Umm Fadl said:",
            "english_text": "that the Messenger of Allah said: “Breastfeeding once or twice, or suckling once or twice, does not make (marriage) unlawful.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 97,
            "hadithNum_inBook": 1941,
            "title": "Sunan Ibn Majah 1941",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Prophet Allah said: “Suckling once or twice does not make (marriage) unlawful.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 98,
            "hadithNum_inBook": 1942,
            "title": "Sunan Ibn Majah 1942",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“Once of the things that Allah revealed in the the Qur'an and then abrogated was that nothing makes marriage prohibited except ten breastfeedings or five well-known (breastfeedings).”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 99,
            "hadithNum_inBook": 1943,
            "title": "Sunan Ibn Majah 1943",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“Sahlah bint Suhail came to the Prophet and said: 'O Messenger of Allah, I see signs of displeasure on the face of Abu Hudhaifah when Salim enters upon me.” The Prophet said: “Breastfeed him.” She said: “How can I breastfeed him when he is a grown man? The Messenger of Allah smiled and said: “I know that he is a grown man.” So she did that, then she came to the Prophet and said: “I have never seen any signs of displeasure on the face of Abu Hudhayfah after that.” And he was present at (the battle of) Badr.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 100,
            "hadithNum_inBook": 1944,
            "title": "Sunan Ibn Majah 1944",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“The Verse of stoning and of breastfeeding an adult ten times was revealed1, and the paper was with me under my pillow. When the Messenger of Allah died, we were preoccupied with his death, and a tame sheep came in and ate it.”\n\n1: These verses were abrogated in recitation but not ruling. Other ahadith establish the number for fosterage to be 5.",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 101,
            "hadithNum_inBook": 1945,
            "title": "Sunan Ibn Majah 1945",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Prophet entered upon her and there was a man with her. He said: “Who is this? She said: “This is my brother.” He said: “Look at whom you allow to enter upon you, because the breastfeeding (that makes a person Mahram) is that which satisfies hunger.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 102,
            "hadithNum_inBook": 1946,
            "title": "Sunan Ibn Majah 1946",
            "narrator": "It was narrated from 'Abdullah bin Zubair:",
            "english_text": "that the Messenger of Allah said: “There is no breastfeeding except that which fills the stomach.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 103,
            "hadithNum_inBook": 1947,
            "title": "Sunan Ibn Majah 1947",
            "narrator": "It was narrated from Zainab bint Abi Salamah:",
            "english_text": "that the wives of the Prophet all differed with 'Aishah and refused to allow anyone with ties of breastfeeding like Salim, the freed salve of Abu Hudhaifah, to enter upon them. They said: “How do we know? That may be a concession granted only to Salim.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 104,
            "hadithNum_inBook": 1948,
            "title": "Sunan Ibn Majah 1948",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "“My paternal uncle through breastfeeding, Aflah bin Abu Qu'ais, came and asked permission to visit me, after the ruling on veiling had been enjoined, and I refused to let him in, until the Prophet came in and said: 'He is your paternal uncle; let him in.' I said: 'But it is the woman who breastfed me; the man did not breastfeed me.' He said: 'May your hands be rubbed with dust', or: 'May your right hand be rubbed with dust!”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 105,
            "hadithNum_inBook": 1949,
            "title": "Sunan Ibn Majah 1949",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "X“My paternal uncle through breastfeeding came to visit me and I refused to let him in. The Messenger of Allah said: 'Let your paternal uncle visit you.' I said: 'But it is the woman who breastfed me; the man did not breastfeed me.' He said: 'He is your paternal uncle; let him visit you.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 106,
            "hadithNum_inBook": 1950,
            "title": "Sunan Ibn Majah 1950",
            "narrator": "It was narrated that Dailami said:",
            "english_text": "“I came to the Messenger of  Allah, and I was married to two sisters whom I had married during the Ignorance period. He said: 'When you go back, divorce one of them.' ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 107,
            "hadithNum_inBook": 1951,
            "title": "Sunan Ibn Majah 1951",
            "narrator": "Dahhak bin Fairuz Dailami narrated that his father said:",
            "english_text": "'I came to the Prophet and said: 'O Messenger of Allah! I have become Muslim and I am married to two sisters.' The Messenger of Allah said: 'Divorce whichever of them you want.'  ”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 108,
            "hadithNum_inBook": 1952,
            "title": "Sunan Ibn Majah 1952",
            "narrator": "It was narrated that Qais bin Harith said:",
            "english_text": "“I became Muslim and I had eight wives. I went to the Prophet and told him about that. He said: 'Choose four of them.'  ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 109,
            "hadithNum_inBook": 1953,
            "title": "Sunan Ibn Majah 1953",
            "narrator": "It was narrated that Ibn 'Umar said:",
            "english_text": "“Ghailan bin Salamah became Muslim and he had ten wives. The Prophet said to him: 'Choose four of them.'  ”",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 110,
            "hadithNum_inBook": 1954,
            "title": "Sunan Ibn Majah 1954",
            "narrator": "It was narrated from 'Uqbah bin 'Amir:",
            "english_text": "that the Prophet said: “The conditions most deserving to be fulfilled are those by means of which the private parts become permissible for you.”",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 111,
            "hadithNum_inBook": 1955,
            "title": "Sunan Ibn Majah 1955",
            "narrator": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:",
            "english_text": "“The Messenger of Allah said: “Whatever is given as a dowry or gift before the marriage, it belongs to her. Whatever is given after the marriage belongs to the one to whom it was given. And the most deserving matter for which a man is honored is (the marriage of) his daughter or sister.”",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 112,
            "hadithNum_inBook": 1956,
            "title": "Sunan Ibn Majah 1956",
            "narrator": "It was narrated from Abu Musa that the Messenger of Allah said:",
            "english_text": "'Whoever has a slave woman and teaches her good manners and educates her, then sets her free and marries her, will have two rewards. Any man from among the People of the Book who believed in his Prophet and believed in Muhammad will have two rewards. Any slave who does his duty towards Allah and towards his masters will have two rewards.” (Sahih)(one of the narrators) Salih said: “Sha'bi said: 'I have given this (Hadith) to you for little effort on your part. A rider would travel to Al-Madinah for less than this.'  ”",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 113,
            "hadithNum_inBook": 1957,
            "title": "Sunan Ibn Majah 1957",
            "narrator": "It was narrated that Anas said:",
            "english_text": "“Safiyyah was given to Dihyah Al-Kalbi (as his share of the war booty), then she was given to the Messenger of Allah after that. He married her, and made her ransom (i.e., freedom from slavery) her dowry.” (Sahih)Hammad said: “Abdul-'Aziz said to Thabit: 'O Abu Muhammad! Did you ask Anas what her bridal-money was?' He said: 'Her bridal-money was her freedom.' ”",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 114,
            "hadithNum_inBook": 1958,
            "title": "Sunan Ibn Majah 1958",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Messenger of Allah (ﷺ) set Safiyyah free, and made her ransom her dowry, and he married her.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 115,
            "hadithNum_inBook": 1959,
            "title": "Sunan Ibn Majah 1959",
            "narrator": "It was narrated from Ibn 'Umar:",
            "english_text": "that the Messenger of Allah said : \"If a slave gets married without his master's permission, he is a fornicator.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 116,
            "hadithNum_inBook": 1960,
            "title": "Sunan Ibn Majah 1960",
            "narrator": "It was narrated from Ibn 'Umar:",
            "english_text": "that the Messenger of Allah said : \"Any slave who gets married without his master's permission, is a fornicator.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 117,
            "hadithNum_inBook": 1961,
            "title": "Sunan Ibn Majah 1961",
            "narrator": "It was narrated from 'Ali bin Abu Talib that:",
            "english_text": "The Messenger of Allah forbade on the Day of Khaibar, the temporary marriage of women and (he forbade) the flesh of domestic donkeys.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 118,
            "hadithNum_inBook": 1962,
            "title": "Sunan Ibn Majah 1962",
            "narrator": "It was narrated from Rabi'bin Sabrah that his father said :",
            "english_text": "\"We went out with the Messenger of Allah on the Farewell pilgrimage, and they said : 'O Messenger of Allah, (ﷺ) celibacy has become too difficult for us'. He said : 'Then make temporary marriages with these women'. So we went to them, but they insisted on setting a fixed time between us and them. They mentioned that to the Prophet and he said : 'Set a fixed time between you and them.' So I went out with a cousin of mine. He had a cloak and I had a cloak, but his cloak was finer than mine, and I was younger than him. We came to a women and she said: 'One cloak is like another.' So I married her and stayed with her that night. Then the next day I saw the Messenger of Allah standing between the Rukn (corner) and the door (of the Ka'bah), saying : 'O people, I had permitted temporary marriage for you, but Allah has forbidden it until the Day of Resurrection. however had any temporary wives, he should let them go, and do not take back anything that you had given to them.' \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 119,
            "hadithNum_inBook": 1963,
            "title": "Sunan Ibn Majah 1963",
            "narrator": "It was narrated that Ibn 'Umar said:",
            "english_text": "\"When 'Umar bin Khattab was appointed caliph, he addressed the people and said: 'The Messenger of Allah permitted temporary marriage for us three times, then he forbade it. By Allah, If I hear of any married person entering a temporary marriage, I will stone him to death, unless he can bring me four witnesses who will testify that the Messenger of Allah, allowed it after he forbade it'.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 120,
            "hadithNum_inBook": 1964,
            "title": "Sunan Ibn Majah 1964",
            "narrator": "Maimunah bint Harith narrated:",
            "english_text": "that the Messenger of Allah married her when he was Halal (not in Ihram). (Sahih).He (one of the narrators-Yazid) said: \"And she was my maternal aunt and the maternal aunt of Idn 'Abbas also.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 121,
            "hadithNum_inBook": 1965,
            "title": "Sunan Ibn Majah 1955",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "the Prophet got married while he was a Muhrim (in Ihram).",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 122,
            "hadithNum_inBook": 1966,
            "title": "Sunan Ibn Majah 1966",
            "narrator": "It was narrated from Aban bin 'Uthman bin 'Affan' that his father said:",
            "english_text": "\"The Messenger of Allah said: 'The one in lhram should not get married, nor arrange a marriage for anyone else, nor Propose marriage''",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 123,
            "hadithNum_inBook": 1967,
            "title": "Sunan Ibn Majah 1967",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Messenger of Allah said: \"If there comes to you one with whose character and religious commitment you are pleased, then marry (your daughter or female relative under your care) to him, for if you do not do that there will be Fitnah in the land and widespread corruption.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 124,
            "hadithNum_inBook": 1968,
            "title": "Sunan Ibn Majah 1968",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Messenger of Allah said: \"Choose the best for your sperm, and marry compatible women and propose marriage to them.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 125,
            "hadithNum_inBook": 1969,
            "title": "Sunan Ibn Majah 1969",
            "narrator": "It was narrated from Abu Hurairah:",
            "english_text": "that the Messenger of Allah said: \"Whoever has two wives and favors one of them over the other, he will come on the Day of Resurrection with one of his sides leaning.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 126,
            "hadithNum_inBook": 1970,
            "title": "Sunan Ibn Majah 1970",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that whenever the Messenger of Allah was to travel, he would cast lots among his wives.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 127,
            "hadithNum_inBook": 1971,
            "title": "Sunan Ibn Majah 1971",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Messenger of Allah used to divide his time equally among his wives, then he would say 'O Allah, this is what I am doing with regard to that which is within my control, so do not hold me accountable for that which is under Your control and is beyond my control.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 128,
            "hadithNum_inBook": 1972,
            "title": "Sunan Ibn Majah 1972",
            "narrator": "'Urwah narrated from 'Aishah:",
            "english_text": "that when Saudah bint Zam'ah grew old, she gave her day to 'Aishah, and the Messenger of Allah went to 'Aishah on Saudah's day.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 129,
            "hadithNum_inBook": 1973,
            "title": "Sunan Ibn Majah 1973",
            "narrator": "It was narrated from 'Aishah:",
            "english_text": "that the Messenger of Allah became angry with Safiyyah bint Huyai for something, and Safiyyah said: \"O 'Aishah, can you make the Messenger of Allah be pleased with me, and I will give you my day?\" She said: \"Yes.\" So she took a headcover of hers that was dyed with saffron and sprinkled it with water so that its fragrance would become stronger, then she sat beside the Messenger of Allah. The Prophet said: \"O 'Aishah, go away, because it is not your day!\" She said: \"That is the Grace of Allah which He bestows on whom He pleases.\" Then she told him about that matter and he was pleased with her.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 130,
            "hadithNum_inBook": 1974,
            "title": "Sunan Ibn Majah 1974",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"This Verse 'And making peace is better.' was revealed concerning a man who had been married to a woman for a long time, and she had given birth to his children and he wanted to exchange her (for a new wife). She agreed that he would stay with her (the new wife) and would not give her (the first wife) a share of his time. (i.e.) not spend the nights with her).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 131,
            "hadithNum_inBook": 1975,
            "title": "Sunan Ibn Majah 1975",
            "narrator": "It was narrated that Abu Ruhm said:",
            "english_text": "\"The Messenger of Allah said: 'One of the best kinds of intercession is interceding between two people concerning marriage.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 132,
            "hadithNum_inBook": 1976,
            "title": "Sunan Ibn Majah 1976",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"Usamah stumbled at the threshold of the door and cut his face. The Messenger of Allah said: 'Remove the harm (the blood) from him,' but I was repulsed by that. He started to suck the blood and remove it from his face, then he said: 'If Usamah were a girl, I would have adorned him and dressed him until I married him off.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 133,
            "hadithNum_inBook": 1977,
            "title": "Sunan Ibn Majah 1977",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "the Prophet said: \"The best of you is the one who is best to his wife, and I am the best of you to my wives.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 134,
            "hadithNum_inBook": 1978,
            "title": "Sunan Ibn Majah 1978",
            "narrator": "It was narrated from 'Abdullah bin 'Amr that:",
            "english_text": "the Messenger of Allah said: \"The best of you are those who are best to their womenfolk.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 135,
            "hadithNum_inBook": 1979,
            "title": "Sunan Ibn Majah 1979",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Prophet raced with me and I beat him.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 136,
            "hadithNum_inBook": 1980,
            "title": "Sunan Ibn Majah 1980",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "When the Messenger of Allah came to Al-Madinah, he had just married Safiyyah bint Huyai, and the women of the Ansar came and told us about that. My expression changed and I covered my face and went away. The Messenger of Allah looked at my eyes and recognized me. I turned away and walked quickly, but he caught up with me and put his arm around me and said: 'What did you see?' I said: 'Let me go, (I saw) a Jewish woman among other Jewish women.' \"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 137,
            "hadithNum_inBook": 1981,
            "title": "Sunan Ibn Majah 1981",
            "narrator": "Urwah bin Zubair narrated that 'Aishah said:",
            "english_text": "\"I did not know until Zainab burst in on me without permission and she was angry. Then she said: 'O Messenger of Allah, is it enough for you that the young daughter of Abu Bakr waves her hands in front of you?' Then she turned to me, but I ignored her until the Prophet said: 'You should say something to defend yourself.' So I turned on her, (and replied to her) until I saw that her mouth had become dry, and she did not say anything back to me. And I saw the Prophet with his face shining.\" (Hasan).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 138,
            "hadithNum_inBook": 1982,
            "title": "Sunan Ibn Majah 1982",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"I used to play with dolls when I was with the Messenger of Allah, and he used to bring my friends to me to play with me.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 139,
            "hadithNum_inBook": 1983,
            "title": "Sunan Ibn Majah 1983",
            "narrator": "It was narrated that 'Abduleh bin Zam'ah said:",
            "english_text": "'The Prophet delivered a sermon then he made mention of women, and exhorted (the men) concerning them. Then he said: 'How long will one of you whip his wife like a slave, then lie with her at the end of the day?'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 140,
            "hadithNum_inBook": 1984,
            "title": "Sunan Ibn Majah 1984",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Messenger of Allah never beat any of his servants, or wives, and his hand never hit anything.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 141,
            "hadithNum_inBook": 1985,
            "title": "Sunan Ibn Majah 1985",
            "narrator": "It was narrated that Iyas bin 'Abdullah bin Abu Dhubab said:",
            "english_text": "\"The Prophet said: 'Do not beat the female slaves of Allah.' Then 'Umar came to the Prophet and said: 'O Messenger of Allah, the woman have become bold towards their husbands? So order the beatin g of them,' and they were beaten. Then many women went around to the family of Muhammad,. The next day he said: 'Last night seventy women came to the family of Muhammad, each woman complaining about her husband. You will not find that those are the best of you.' \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 142,
            "hadithNum_inBook": 1986,
            "title": "Sunan Ibn Majah 1986",
            "narrator": "It was narrated that Ash'ath bin Qais said:",
            "english_text": "\"I was a guest (at the home) of 'Umar one night, and in the middle of the night he went and hit his wife, and I separated them. When he went to bed he said to me: 'O Ash'ath, learn from me something that I heard from the Messenger of Allah\" A man should not be asked why he beats his wife, and do not go to sleep until you have prayed the Witr.\"' And I forgot the third thing.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 143,
            "hadithNum_inBook": 1987,
            "title": "Sunan Ibn Majah 1987",
            "narrator": "It was narrated from Ibn 'Umar that:",
            "english_text": "the Prophet cursed the woman who does hair extensions and the one who has that done, and the woman who does tattoos and the one who has that done.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 144,
            "hadithNum_inBook": 1988,
            "title": "Sunan Ibn Majah 1988",
            "narrator": "It was narrated that Asma' said:",
            "english_text": "\"A woman came to the Prophet and said:, My daughter is going to get married, and she had the measles and her hair has fallen out. Can I put extensions in her hair?, The Messenger of Allah said: ‘Allah has cursed the one who does hair extensions and the one who has that done.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 145,
            "hadithNum_inBook": 1989,
            "title": "Sunan Ibn Majah 1989",
            "narrator": "It was narrated that 'Abdulleh said:",
            "english_text": "\"The Messenger of Allah cursed the woman who does tattoos and the one who has them done, and those who pluck their eyebrows and file their teeth for the purpose of beautification, and those who change the creation of Allah.\" News of that reached a woman of Banu Asad who was called Umm Ya'qub. She came to him and said: \"I have heard that you said such and such.\" He said: 'Why should I not curse those whom the Messenger of Allah cursed ? And it is in the Book of Allah.'' She said: \"I read what is between its two covers 'and I have not found that.\" He said: \"If you read it properly you would have found it. Have you not read the words: 'And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).'?\" She said: \"Of course.\" He said: 'The Messenger of Allah forbade that.\" She said: 'I think that your wife does it.' He said: \" Go and look.\" So she went and looked and she did not see what she wanted. She said: \"I have not seen anything!’ 'Abdullah said: \"If she was as you say, I would not have kept her with me. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 146,
            "hadithNum_inBook": 1990,
            "title": "Sunan Ibn Majah 1990",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"The Prophet, married me in Shawwal, and he consummated the marriage with me in Shawwal, and which of his wives was more favored to him than I.\" 'Airhuh used to like marriage to be consummated with her female relatives in Shawwal.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 147,
            "hadithNum_inBook": 1991,
            "title": "Sunan Ibn Majah 1991",
            "narrator": "It was narrated from 'Abdul-Malik bin Harith bin Hisham, from his father, that:",
            "english_text": "the Prophet married Umm Salamah in Shawwal, and consummated the marriage with her in Shawwal.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 148,
            "hadithNum_inBook": 1992,
            "title": "Sunan Ibn Majah 1992",
            "narrator": "It was narrated from 'Aishah that:",
            "english_text": "the Messenger of Allah told her to take a woman to her husband before he had given her anything (i.e. bridal-money). (Da' if)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 149,
            "hadithNum_inBook": 1993,
            "title": "Sunan Ibn Majah 1993",
            "narrator": "It was narrated from Hakim bin Mu'awiyah that his paternal uncle Mikhmar bin Mu'awiyah said:",
            "english_text": "\"I heard the Messenger of Allah say: 'Do not believe in omens, and good fortune is only to be found in three things: A woman, a horse and a house.\"'",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 150,
            "hadithNum_inBook": 1994,
            "title": "Sunan Ibn Majah 1994",
            "narrator": "It was narrated from Sahl bin Sa'd that:",
            "english_text": "the Messenger of Allah said: \"If  it exists, it is in three things: a horse, and woman and a house,\" meaning omens.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 151,
            "hadithNum_inBook": 1995,
            "title": "Sunan Ibn Majah 1995",
            "narrator": "It was narrated from Salim, from his father, that:",
            "english_text": "the Messenger of Allah said: \"Omens are only to be found in three things: a horse, a woman and a house.\" (Sahih)(One of the narrators) Az-Zuhri said: \" Abu 'Ubaidah bin 'Abdullah bin Zam'ah said that his mother, Zainab, narrated to him, from Umm Salamah, that she used to list these three, and add to them \"the sword.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 152,
            "hadithNum_inBook": 1996,
            "title": "Sunan Ibn Majah 1996",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Messenger of Allah said: \"There is a kind of protective jealousy that Allah loves and a kind that Allah hates. As for that which Allah loves, it is protective jealousy when there are grounds for suspicion. And as for that which He hates, it is protective jealousy when there are no grounds for suspicion.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 153,
            "hadithNum_inBook": 1997,
            "title": "Sunan Ibn Majah 1997",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"I never felt as jealous of any woman as I did of Khadijah, because I saw how the Messenger of Allah remembered her, and his Lord had told him to give her the glad tidings of a house in Paradise made of Qasab.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 154,
            "hadithNum_inBook": 1998,
            "title": "Sunan Ibn Majah 1998",
            "narrator": "It was narrated that Mishwar bin Makhramah said:",
            "english_text": "\"I heard the Messenger of Allah when he was on the pulpit, say: 'Banu Hisham bin Mughirah asked me for permission to marry their daughter to 'Ali bin Abu Talib, but I will not give them permission, and I will not give them permission, and I will not give them permission, unless 'Ali bin Abu Talib wants to divorce my daughter and marry their daughter, for she is a part of me, and what bothers her bothers me, and what upsets her upsets me.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 155,
            "hadithNum_inBook": 1999,
            "title": "Sunan Ibn Majah 1999",
            "narrator": "'Ali bin Husain said that Miswar bin Makhramah told him that:",
            "english_text": "'Ali bin Abu Talib proposed to the daughter of Abu Jahl, when he was married to Fatimah the daughter of the Prophet. When Fatimah heard of that she went to the Prophet, and said: \"Your people are saying that you do not feel angry for your daughters. This 'Ali is going to marry the daughter of Abu Jahl.\" Miswar said: \"The Prophet stood up, and I heard him when he bore witness (i.e., said the Shahadah), then he said: 'I married my daughter (Zainab) to Abul-As bin Rabi', and he spoke to me and was speaking the truth. Fatimah bint Muhammad is a part of me, and I hate to see her faced with troubles. By Allah, the daughter of the Messenger of Allah and the daughter of the enemy of Allah will never be joined together in marriage to one man.\" He said: So, 'Ali abandoned the marriage proposal.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 156,
            "hadithNum_inBook": 2000,
            "title": "Sunan Ibn Majah 2000",
            "narrator": "It 'was narrated from Hisham bin 'Urwah, from his father that 'Aishah used to say:",
            "english_text": "\"Wouldn't a woman feel too shy to offer herself to the Prophet?\" Until Aileh revealed; \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will.” She said: \"Then I said: 'Your Lord is quick to make things easy for you.\"'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 157,
            "hadithNum_inBook": 2001,
            "title": "Sunan Ibn Majah 2001",
            "narrator": "Thabit said:",
            "english_text": "“We were sitting with Anas bin Mahk, and a daughter of his was with him. Anas said: 'A woman came to the Prophet and offered herself to him. She said: \" O Messenger of Allah, do you have any need of me?\"' His daughter said: 'How little modesty she had!' He said: 'She was better than you, because she wanted (to marry) the Messenger of Allah, and she offered herself to him. \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 158,
            "hadithNum_inBook": 2002,
            "title": "Sunan Ibn Majah 2002",
            "narrator": "It was narrated that Abu Hurairah said:",
            "english_text": "\"A man from Banu Fazdrah came to the Messenger of Allah, and said: 'O Messenger of Allah, my wife has given birth to a black boy! The Messenger of Allah said: 'Do you have camels?' He said: 'Yes.' He said: 'What color are they?' He said: 'Red.' He said: 'Are there any grey ones among them?' He said: 'Yes, there are some grey ones among them.' He said: 'Where does that come from?' He said: 'Perhaps it is hereditary.' He said: 'Likewise, perhaps this is hereditary! \"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 159,
            "hadithNum_inBook": 2003,
            "title": "Sunan Ibn Majah 2003",
            "narrator": "It was narrated from Ibn 'Umar that:",
            "english_text": "a man frorn the desert people came to the Prophet and said: \"O Messenger of Allah, my wife has given birth on  my bed to a black boy, and there are no black people among my family.\" He said: \"Do you have camels?\" He said: \"Yes.\" He said: \"What color are they?\" He said: \"Red.\" He said: are there any black ones among them?\" He said, \"No.\" He said: \"Are there any grey ones among them?\" He said- \"Yes.\" He said \"How is that?\" He said: \"Perhaps it is hereditary.\" He said: \"Perhaps (the color of) this son of yours is also hereditary.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 160,
            "hadithNum_inBook": 2004,
            "title": "Sunan Ibn Majah 2004",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "Ibn Zam'ah and\nSa'd (Ibn Abu Waqqas) referred a dispute to the Prophet concerning the son of Zam'ah's slave woman. Sa'd said : \" O Messenger of Allah my brother (Utbah bin Abu Waqqas) left instructions in his will that when I come to Makkah, I should look for the son of the slave woman of Zam'ah and take him into my care.\" 'Abd bin Zam’ah said: \"He is my brother and the son of the slave woman of my father; he was born on my father's bed.\" The Prophet ffi saw that he resembled 'Utbah, and said: \"He belongs to you, O 'Abd bin Zam'ah. The child is for the bed. Observe Hijab before him, O Saudah.\" (sahih)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 161,
            "hadithNum_inBook": 2005,
            "title": "Sunan Ibn Majah 2005",
            "narrator": "It was narrated from 'Umar that:",
            "english_text": "the Messenger of Allah ruled that the child belonged to the bed.",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 162,
            "hadithNum_inBook": 2006,
            "title": "Sunan Ibn Majah 2006",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "the Prophet said: \"The child is for the bed (i.e., belongs to the husband) and the fornicator gets nothing!'",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 163,
            "hadithNum_inBook": 2007,
            "title": "Sunan Ibn Majah 2007",
            "narrator": "Shurahbil bin Muslim said:",
            "english_text": "\"I heard Abu Um Amah Al-Bahili say: 'I heard the Messenger of Allah say: \"The child is for the bed and the fornicator gets nothing.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 164,
            "hadithNum_inBook": 2008,
            "title": "Sunan Ibn Majah 2008",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "a woman came to the Prophet and became Muslim, and a man married her. Then her first husband came and said: \"O Messenger of Allah, I became Muslim with her, and she knew that I was Muslim.\" So the Messenger of Allah took her away from her second husband and returned her to her first husband.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 165,
            "hadithNum_inBook": 2009,
            "title": "Sunan Ibn Majah 2009",
            "narrator": "It was narrated from Ibn 'Abbas that:",
            "english_text": "the Messenger of Allah returned his daughter to Abul-'As bin Rabi' after two years, on the basis of the first marriage contract.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 166,
            "hadithNum_inBook": 2010,
            "title": "Sunan Ibn Majah 2010",
            "narrator": "It was narrated from 'Amr bin Shu'aib, from his father, from his grand father, that:",
            "english_text": "the Messenger of Allah, returned his daughter Zainab to Abul-As bin Rabi', with a new marriage contract.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 167,
            "hadithNum_inBook": 2011,
            "title": "Sunan Ibn Majah 2011",
            "narrator": "It was narrated that Judamah bint Wahb Al-Asadiyyah said:",
            "english_text": "\"I heard the Messenger of Allah say: 'I wanted to forbid intercourse with a nursing mother, but then (I saw that) the Persians and the Romans do this, and it does not kill their children.'  And I heard him say/when he was asked about coitus interruptus: 'It is the disguised form of b.rryirg children alive.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 168,
            "hadithNum_inBook": 2012,
            "title": "Sunan Ibn Majah 2012",
            "narrator": "It was narrated from Muhajir bin Abu Muslim, from Asma' bint Yazid bin Sakary who was his freed slave womary that:",
            "english_text": "she heard the Messenger of Allah say: \"Do not kill your children secretly, for by the One in Whose Hand is my soul, intercourse with a breastfeeding woman catches up with people when they are riding their horses (in battle) and wrestles them to the ground.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 169,
            "hadithNum_inBook": 2013,
            "title": "Sunan Ibn Majah 2013",
            "narrator": "It was narrated that Abu Umamah said:",
            "english_text": "\"A woman came to the Prophet with two of her children, carrying one and leading the other. The Messenger of Allah said: 'They carry children and give birth to them and are compassionate. If they do not annoy their husbands, those among them who perform prayer will enter Paradise.\"'",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 170,
            "hadithNum_inBook": 2014,
            "title": "Sunan Ibn Majah 2014",
            "narrator": "It was narrated from Mu'adh bin Jabal that:",
            "english_text": "the Messenger of Allah said: \"No woman annoys her husband but his wife among houris (of Paradise) safs: 'Do not annoy him, may Allah destroy you, for he is just a temporary guest with you and soon he will leave you and join us.\"'",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 171,
            "hadithNum_inBook": 2015,
            "title": "Sunan Ibn Majah 2015",
            "narrator": "It was narrated from Ibn 'Umar that:",
            "english_text": "the Prophet, said: \"What is Haram does not make what is Halal into what is Haram.”",
            "grade": "Da’if (Darussalam)"
        }
    ]
}