{
    "chapterNum": 34,
    "english_title": "Etiquette",
    "totalHadiths_inChapter": 170,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 3659,
            "title": "Sunan Ibn Majah 3657",
            "narrator": "Ibn Salamah As-Sulami narrated that the Prophet (ﷺ) said:",
            "english_text": "\"I enjoin each one to honor his mother,I enjoin each one to honor his mother,I enjoin each one to honor his mother(three times), I enjoin each one to honor his guardian who is taking care of him, even if he is causing him some annoyance.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 3660,
            "title": "Sunan Ibn Majah 3658",
            "narrator": "Abu Hurairah, may Allah be pleased with them, said that:",
            "english_text": "Allah's Messenger said: \"They said: 'O Messenger of Allah, whom should I treat kindly?' He said: 'Your mother.' He said: 'Then who?' He said :'Your mother.\" He said: 'Then who?' He said: 'Your father'. He said : 'Then who?' He said: 'The next closest and the next closest.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 3661,
            "title": "Sunan Ibn Majah 3659",
            "narrator": "Abu Hurairah, may Allah be pleased with them, narrated that:",
            "english_text": "Allah's Messenger said: \"No child can compensate his father unless he finds a slave, and buys him and sets him free.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 3662,
            "title": "Sunan Ibn Majah 3660",
            "narrator": "Abu Hurairah, may Allah be pleased with them, narrated that:",
            "english_text": "Allah's Messenger said: \"Qintar is twelve thousand 'Uqiyah, each 'Uqiyah of which is better than what is between heaven and earth.\" And the Messenger of Allah(ﷺ) said: \"A man will be raised in status in Paradise and will say: 'Where did this come from?' And it will be said:'From your son's praying for forgiveness for you.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 3663,
            "title": "Sunan Ibn Majah 3661",
            "narrator": "Miqdam bin Ma'dikarib, may Allah be pleased with them, narrated that:",
            "english_text": "Allah's Messenger said: \"Allah enjoins you to treat your mother's kindly\"-three times- \"Allah enjoins you to treat your fathers kindly, Allah enjoins you to treat the closest and the next closest kindly.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 3664,
            "title": "Sunan Ibn Majah 3662",
            "narrator": "Abu Umamah narrated that a man said that:",
            "english_text": "\"O Allah's Messenger(ﷺ), what are the rights of parents over their child?\" He said:\"They are your Paradise and your Hell.\" (Daif)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 3665,
            "title": "Sunan Ibn Majah 3663",
            "narrator": "Abu Darda' heard the Prophet (ﷺ) say that:",
            "english_text": "\"The father is the middle door of Paradise (i.e. the best way to Paradise), so it is up to you whether you take advantage of it or not.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 3666,
            "title": "Sunan Ibn Majah 3664",
            "narrator": "It was narrated that Abu Usaid, Malik bin Rabi'ah, said:",
            "english_text": "\"While we were with the Prophet(ﷺ), a man from the Banu Salamah came to him and said: \" O messenger of Allah, is there anyway of honoring my parents that I can still do for them after they die?' He said: \"Yes offering the funeral prayer for them, praying for forgiveness for them, fulfilling their promises after their death, honoring their freinds and upholding the ties of kinship which you would not have were it nor for them.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 3667,
            "title": "Sunan Ibn Majah 3665",
            "narrator": "It was narrated that Aisha, said:",
            "english_text": "\"Some Bedouin people came to the Prophet(ﷺ) and said: 'Do you kiss your children?' He said: 'Yes'. He said: 'But we, by Allah, never kiss (our children)'. The Prophet(ﷺ) said: 'What can I do if Allah has taken away mercy from you?'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 3668,
            "title": "Sunan Ibn Majah 3666",
            "narrator": "It was narrated from Ya'la Al -Amir that he said:",
            "english_text": "\"Hasan and Hussain came running to the Prophet (ﷺ) and he embraced them and said: 'Children make a man a miser and a coward.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 3669,
            "title": "Sunan Ibn Majah 3667",
            "narrator": "It was narrated from Suraqah bin Malik that the Prophet(ﷺ) said:",
            "english_text": "\"Shall I not tell you of the best charity? A daughter who comes back to you and has no other breadwinner apart from you.\" (Daif)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 3670,
            "title": "Sunan Ibn Majah 3668",
            "narrator": "It was narrated that Sa'sa'ah the paternal uncle of Ahnaf, said:",
            "english_text": "\"A woman entered upon Aisha with her two daughters, and she gave her three dates. (The woman) gave each of her daughters a date, then she split the last one between them. She (Aisha) said: 'Then the Prophet(ﷺ) came and I told him about that.' He said:' Why are you surprised? She will enter Paradise because of that.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 3671,
            "title": "Sunan Ibn Majah 3669",
            "narrator": "Uqbah bin Amir said, I heard the Messenger of Allah(ﷺ) say:",
            "english_text": "\"Whoever has three daughters and is patient towards them, and feeds them, gives them to drink, and clothes them from his wealth; they will be a shield for him from the Fire on the Day of Resurrection.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 3672,
            "title": "Sunan Ibn Majah 3670",
            "narrator": "It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"There is no man whose two daughters reach the age of puberty and he treats them kindly for the time they are together, but they will gain him admittance to Paradise.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 3673,
            "title": "Sunan Ibn Majah 3671",
            "narrator": "Anas bin Malik narrated that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Be kind to your children, and perfect their manners.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 3674,
            "title": "Sunan Ibn Majah 3672",
            "narrator": "It was narrated from Abu Shuraih Al-Khuzai that the Prophet(ﷺ) said:",
            "english_text": "\"Whoever believes in the Last Day, let him treat his neighbour well. Whoever believes in Allah and Last Day, let him honor his guest. Whoever believes in Allah and the Last Day, let him say something good or else remain silent\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 3675,
            "title": "Sunan Ibn Majah 3673",
            "narrator": "Aisha narrated that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Jibra'il kept enjoining good treatment of neighbours untol I thought that he would make neigbours heirs.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 3676,
            "title": "Sunan Ibn Majah 3674",
            "narrator": "It was narrated from Abu Hurayrah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Jibra'il kept enjoining good treatment of neighbours until I thought he would make neighbours heirs.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 3677,
            "title": "Sunan Ibn Majah 3675",
            "narrator": "It was narrated from Abu Shuraih Al-Khuza'i that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Whoever believes in the Last Day, let him honor his guest, and grant him reward for a day and a night. And it is not permissible for him to stay so long that he causes annoyance to his host. Hospitality is for three days, and whatever he spends on him after three days is charity.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 3678,
            "title": "Sunan Ibn Majah 3676",
            "narrator": "It was narrated that Uqbah bin Amir said:",
            "english_text": "\"We said to the Messenger of Allah(ﷺ): ' You send us and we stay with people who do not show us any hospitality. WHat do you think of that?' The MEssenger of Allah (ﷺ) said: 'If you stay with people and they give you what a guest deserves, then accept it. If they do not do that , then take from them what they should have offered, which a guest is entitled to.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 3679,
            "title": "Sunan Ibn Majah 3677",
            "narrator": "It was narrated that Miqdam Abu Karimah said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: ' Putting up a guest for one night is obligatory. If you find a guest at your door in the morning, then this (hospitality) is (like) a debt that you (the host) owe him. If he (the guest) wants, he may request it, and if he wants, he may leave it'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 3680,
            "title": "Sunan Ibn Majah 3678",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"O Allah, bear witness that I have issued a warning concerning (failure to fulfill) the rights of the two weak ones: Orphans and women.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 3681,
            "title": "Sunan Ibn Majah 3679",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The best house among the Muslims is a house in which there is an orphan who is treated well. And the worst house among the Muslims is a house in which there is an orphan who is treated badly.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 3682,
            "title": "Sunan Ibn Majah 3680",
            "narrator": "It was narrated from `Abdullah bin `Abbas that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Whoever raises three orphans, is like the one who spends his nights in prayer and fasts during the day, and goes out morning and evening drawing his sword in the cause of Allah. In Paradise, he and I will be brothers like these two sisters,'and he held up his forefinger and middle finger together.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 3683,
            "title": "Sunan Ibn Majah 3681",
            "narrator": "It was narrated that Abu Barzah Al-Aslami said:",
            "english_text": "\"O Messenger of Allah! Tell me of an action by which I may benefit.' He said: 'Remove harmful things from the path of the Muslims.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 3684,
            "title": "Sunan Ibn Majah 3682",
            "narrator": "It was narrated from Abu Hurayrah that the Prophet(ﷺ) said:",
            "english_text": "\"There was a branch of a tree that annoyed the people. A man removed it, so he was admitted to Paradise.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 3685,
            "title": "Sunan Ibn Majah 3683",
            "narrator": "It was narrated from Abu Dharr that the Prophet(ﷺ) said:",
            "english_text": "\"My nation was shown to me with their good deeds and bad deeds. Among their good deeds I saw a harmful thing being removed from the road. And among their bad deeds I saw sputum in the mosque that had not been removed.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 3686,
            "title": "Sunan Ibn Majah 3684",
            "narrator": "It was narrated that Sad bin Ubadah said:",
            "english_text": "\"I said: 'O Messenger of Allah, what charity is best?' He said: 'Giving water to drink.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 3687,
            "title": "Sunan Ibn Majah 3685",
            "narrator": "It was narrated from Anas bin Malik that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"On the Day of Resurrection, people will be lined up in rows, (one of the narrators) Ibn NUmair said: i.e., the people of Paradise, and a man from among the people of Hell will pass by a man (from the people of Paradise) and say: 'O so and so! Do you not remember the day when you asked for water and I gave you water to drink?\" So he will intercede for him. And another man will come and say: \" Do you not remember the day when I gave you water with which to purify yourself?\" and he will intercede for him.\" (In his narration, one of the narrators) Ibn NUmair said: \"And he will remember the day when you sent me to do such and such for you, and I went and did it for you?' and he will intercede for him.\"  \"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 3688,
            "title": "Sunan Ibn Majah 3686",
            "narrator": "It was narrated that Suraqah bin Ju'shum said:",
            "english_text": "\"I asked the Messenger of Allah(ﷺ) about a lost camel that comes to my cisterns that I have prepared for my own camels - will I be rewarded if I give it some water to drink? He said: Yes, in every living being there is reward.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 3689,
            "title": "Sunan Ibn Majah 3687",
            "narrator": "It was narrated from Jarir bin Abdullah Al-Bajali that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Whoever is deprived of gentleness, he is deprived of goodness.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 3690,
            "title": "Sunan Ibn Majah 3688",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Allah is Gentle and loves gentleness, and He grants reward for it that He does not grant for harshness.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 3691,
            "title": "Sunan Ibn Majah 3689",
            "narrator": "It was narrated from Aishah that the Prophet(ﷺ) said:",
            "english_text": "\"Allah is Gentle and loves gentleness in all things.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 3692,
            "title": "Sunan Ibn Majah 3690",
            "narrator": "It was narrated that Abu Dhar said:",
            "english_text": "\"The Messenger of Allah said: '(Slaves are) your brothers whom Allah has put under your control, so feed them with the same food that you eat, clothe them with the same clothes you wear, and do not burden them with so much that htey are overwhelmed; if you do burden them, then help them.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 3693,
            "title": "Sunan Ibn Majah 3691",
            "narrator": "It was narrated from Abu Bakr Siddiq(RA) that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"No person who mistreats his slave will enter Paradise.\" They said: \" O Messenger of Allah, did you  not tell us that this nation will have more slaves and orphans than any other nation?\" He said: \" Yes, so be as kind to them as you are to your own children, and feed them with the same food that you eat.\" They said: \"What will benefit us in this world?\" He said: \"A horse that is kept ready for fighting in the cause of Allah, and your slave to take care of you, and if he performs prayer, then he is your brother(in Islam).\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 3694,
            "title": "Sunan Ibn Majah 3692",
            "narrator": "It was narrated from Abu Hurairah(RA) that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"By the One in Whose Hand is my soul, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something which, if you do it, you will love one another? Spread (the greeting of) peace among yourselves.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 3695,
            "title": "Sunan Ibn Majah 3693",
            "narrator": "It was narrated that Abu Umamah said:",
            "english_text": "\"Our Prophet(ﷺ) commanded us to spread (the greeting of) peace.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 3696,
            "title": "Sunan Ibn Majah 3694",
            "narrator": "It was narrated from Abdullah bin 'Amr that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Worship the Most Merciful and spread (the greeting of) peace.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 3697,
            "title": "Sunan Ibn Majah 3695",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "\"a man entered the masjid, and the Messenger of Allah(ﷺ) was sitting in a corner of the mosque. He prayed, then he came and greeted him with Salam(peace), and he said: 'Wa 'alaikassalm.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 3698,
            "title": "Sunan Ibn Majah 3696",
            "narrator": "It was narrated from Abu Salamah that 'Aishah told him that the Messenger of Allah(ﷺ) said to her:",
            "english_text": "\"Jibrail send (greetings of) Salam to you.\" She said: \"Wa 'alahisalam wa rahmatullah (and upon him be peace and mercy of Allah).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 3699,
            "title": "Sunan Ibn Majah 3697",
            "narrator": "It was narrated that Anas bin Malik said \"the Messenger of Allah(ﷺ) said\":",
            "english_text": "\"When any of the People of the Book greets you with Salam (peace), then say, Wa 'alaikum(and also upon you).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 3700,
            "title": "Sunan Ibn Majah 3698",
            "narrator": "It was narrated from Aishah that some of the Jews came to the Prophet(ﷺ) and said:",
            "english_text": "\"Assam o alaika (death be upon you), O Abul-Qasim!\" He said: \"Wa 'alayikum (and also upon you).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 3701,
            "title": "Sunan Ibn Majah 3699",
            "narrator": "It was narrated from Abu 'Abdur-Rahman Al Juhani that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"I am riding to the Jews tomorrow. Do not initiate the greeting with them, and if they greet you, then say: Wa 'alaikum (and also upon you)\".",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 3702,
            "title": "Sunan Ibn Majah 3700",
            "narrator": "It was narrated that Anas said:",
            "english_text": "\"The Messenger of Allah(ﷺ) came to us, and we were young boys, and he greeted us with (the greeting of) peace\".",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 3703,
            "title": "Sunan Ibn Majah 3701",
            "narrator": "Asma bint Yazid said:",
            "english_text": "\"The Messenger of Allah(ﷺ) passed by us, among (a group of) women, and he greeted us with (the greeting of) peace.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 3704,
            "title": "Sunan Ibn Majah 3702",
            "narrator": "It was narrated that Anas bin Malik said:",
            "english_text": "\"O Messenger of Allah! Should we bow to one another?\" He said: \"No.\" We said: \"Should we embrace one another?\" He said: \"No, but shake hands with one another.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 3705,
            "title": "Sunan Ibn Majah 3703",
            "narrator": "It was narrated from Bara bin Azib that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"There are no two Muslims who meet and shake hands, but they will be forgiven before they part.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 3706,
            "title": "Sunan Ibn Majah 3704",
            "narrator": "It was narrated that Ibn Umar said:",
            "english_text": "\"We kissed the hand of the Prophet(ﷺ).\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 3707,
            "title": "Sunan Ibn Majah 3705",
            "narrator": "It was narrated from Safwan bin 'Assal that:",
            "english_text": "\"Some people among the Jews kissed the hands and feet of the Prophet(ﷺ).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 3708,
            "title": "Sunan Ibn Majah 3706",
            "narrator": "It was narrated from Abu Saeed Khudri that Abu Musa asked permission to enter upon 'Umar three times, and he did not give him permission, so he went away.'Umar sent word to him saying:",
            "english_text": "\"Why did you go back?\" He said: \"I asked permission to enter three times, as the Messenger of Allah(ﷺ) enjoined upon us, then if we are given permission we should enter, otherwise we should go back.\" He said: \"You should bring me proof of that, or else!\" Then he came to a gathering of his people and asked them to swear by Allah concerning that, and they did so, so he let him go.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 3709,
            "title": "Sunan Ibn Majah 3707",
            "narrator": "It was narrated that Abu Ayyub Ansari said:",
            "english_text": "\"We said: 'O Messenger of Allah(ﷺ), (we know) this (greeting of) Salam, but what does seeking permission to enter mean?' He said: 'It means a man saying SubhanAllah, and Allahu Akbar and Al Hamdulillah, and clearing his throat, announcing his arrival to the people in the house.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 3710,
            "title": "Sunan Ibn Majah 3708",
            "narrator": "It was narrated that Ali said:",
            "english_text": "\"I had two times of visiting the Messenger of Allah(ﷺ), at night and during the day. If I came to him when he was praying, he would clear his throat (to let me know he was praying).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 3711,
            "title": "Sunan Ibn Majah 3709",
            "narrator": "It was narrated that Jabir said:",
            "english_text": "\"I asked the Prophet(ﷺ) for permission to enter, and he said: 'Who is that?' I said: 'Me'. The Prophet(ﷺ) said \" Me, me?!\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 3712,
            "title": "Sunan Ibn Majah 3710",
            "narrator": "It was narrated that Jabir said:",
            "english_text": "\"I said: 'How are you this morning, O Messenger of Allah?' He said: 'I am better than one who did not get up fasting, and who did not visit and sick.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 3713,
            "title": "Sunan Ibn Majah 3711",
            "narrator": "It was narrated that Abu Usaid Sa'idi said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said to Abbas ibn Abdul Muttalib, when he entered upon them: \"Assalamu alaikum'. They said: 'Wa alaikas salamu wa ahmatullahi wa barakatuhu.' He said: 'How are you this morning?' They said: ' Well, praise is to Allah. And how are you this morning, may our fathers and mothers be ransomed for you, O Messenger of Allah?!' He said: 'I am well, praise is to Allah.'\"(Daif)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 3714,
            "title": "Sunan Ibn Majah 3712",
            "narrator": "It was narrated from Ibn Umar that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If there comes to you a man who is respected among his own people, then honor him.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 3715,
            "title": "Sunan Ibn Majah 3713",
            "narrator": "It was narrated that Anas bin Malik said:",
            "english_text": "\"Two men sneezed in he presence of the Prophet(ﷺ) and he replied (said: YarhamukAllah; may Allah have mercy on you') to one and not to the other. It was said: 'O Messenger of Allah(ﷺ), two men sneezed in your presence and you replied to one and not to the other?' He said: \"'This one praised Allah(said Al-Hamdulillah fter sneezing) but that one did not.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 3716,
            "title": "Sunan Ibn Majah 3714",
            "narrator": "It was narrated from Ilyas bin Salamah bin Akwa' that his father said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: 'The one who sneezes may be responded to three times; if he sneezes more than that, he has a cold.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 3717,
            "title": "Sunan Ibn Majah 3715",
            "narrator": "It was narrated from Ali that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If anyone of you sneezes, let him say: Alhamdulillah (praise be to Allah). Those around him should respond by saying: Yarhamkullah (may Allah have mercy on you). And he should respond by saying: \"Yahdikum Allah wa yuslaha balakum (may Allah Guide you and set right your state).\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 3718,
            "title": "Sunan Ibn Majah 3716",
            "narrator": "It was narrated that Anas bin Malik  said:",
            "english_text": "\"Whenever the Prophet(ﷺ) met a man, he would speak to him, and would not tun away until he (the other man) was the one who turned away. And if he shook hands with him, he would not withdraw his hand until he (the other man) withdrew his hand. And he was never seen sitting with his knees ahead of the knees of the one who was sitting next to him.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 3719,
            "title": "Sunan Ibn Majah 3717",
            "narrator": "It was narrated from Abu Hurairah that the Prophet(ﷺ) said:",
            "english_text": "\"When one of you gets up from his spot, then comes back, he has more right to it.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 3720,
            "title": "Sunan Ibn Majah 3718",
            "narrator": "It was narrated from Jawdan that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If a man makes an excuse to his bother and he does not accept it, he will bear a burden of sin like that of the tax-collector.\"\n\nA hadith similar to the above has been narrated through a chain differing from the first at the 4th level of narrators.",
            "grade": "Da'if, (Darussalam)"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 3721,
            "title": "Sunan Ibn Majah 3719",
            "narrator": "It was narrated that Umm Salamah said:",
            "english_text": "\"Abu Bakr went out to trade in Busra, one year before the Prophet (ﷺ) died, and with him were Nu`aiman and Suwaibit the sons of Harmalah, who had been present at Badr. Nu`aiman was in charge of the provisions, and Suwaibit was a man who joked a lot. He said to Nu`aiman: 'Feed me'. He said: 'Not until Abu Bakr comes'. He said: 'Then I will have to annoy you'. Then they passed by some people, and Suwaibit said to them: 'Will you buy a slave from me?' They said: 'Yes'. He said 'He is a slave who talks a lot and he will tell you, \"I am a free man\". If you are going to let him go when he says that to you, do not bother buying him.' They said: 'We will buy him from you.' So they bought him from him in return for ten young she-camels, then they brought him and tied a turban or a rope around his neck. Nu`aiman said: 'This man is making fun of you. I am a free man, not a slave.' They said: 'He has already told us about you; and they took him off.' Then Abu Bakr came and he (Suwaibit) told him about that. So he followed those people and returned their camels to them, and took Nu`aiman back. When they came to the Prophet (ﷺ) they told him what had happened, and the Prophet (ﷺ) and his companions laughed about it for a year.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 3722,
            "title": "Sunan Ibn Majah 3720",
            "narrator": "It was narrated that Abu Taiyah said:",
            "english_text": "\"I heard Anas Bin Malik say: The Messenger of Allah (ﷺ) used to mix with us so much that he said to a little brother of mine: \"O Abu `Umair, what happened to the Nughair (one of the narrators Waki` said that it means a bird that he used to play with).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 3723,
            "title": "Sunan Ibn Majah 3721",
            "narrator": "It was narrated from 'Amr bin Sh'uaib from his father, that his grandfather said:",
            "english_text": "\"The Messenger of Allah(ﷺ) forbade plucking out white hairs and said: 'It is the light of the believer.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 3724,
            "title": "Sunan Ibn Majah 3722",
            "narrator": "It was narrated from Ibn Buraidah, from his father, that the Prophet(ﷺ) :",
            "english_text": "\"forbade sitting between the shade and sun.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 3725,
            "title": "Sunan Ibn Majah 3723",
            "narrator": "It was narrated from Qais bin Tihfah Al-Ghifari that his father said:",
            "english_text": "\"The Messenger of Allah(ﷺ) found me sleeping in the masjid on my stomach. He nudged me with his foot and said: 'Why are you sleeping like this? This is a kind of sleep that Allah dislikes,' or 'that Allah hates.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 3726,
            "title": "Sunan Ibn Majah 3724",
            "narrator": "It was narrated that Abu Dharr said:",
            "english_text": "\"The Prophet(ﷺ) passed by me and I was lying on my stomach. He nudged me with his foot and said: 'O Junaidib! This is how the people of Hell lie.'\"\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 3727,
            "title": "Sunan Ibn Majah 3725",
            "narrator": "It was narrated that Abu Umamah said:",
            "english_text": "\"The Prophet(ﷺ) passed by a man who was sleeping in the masjid, lying on his face. He struck him with his foot and said: 'Get up' or; 'Sit up, fo this is a hellish kind of sleep.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 3728,
            "title": "Sunan Ibn Majah 3726",
            "narrator": "It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Whoever learns about the stars, he learns a branch of magic; the more he learns (of the former) the more he learns (of the latter).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 3729,
            "title": "Sunan Ibn Majah 3727",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Do not curse the wind, for it is from the mercy of Allah, bringing Rahmah (i.e., rain and breezes), or destruction. But ask Allah for its goodness, and seek refuge with Allah from its evil.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 3730,
            "title": "Sunan Ibn Majah 3728",
            "narrator": "It was narrated from Ibn 'Umar that the Prophet(ﷺ) said:",
            "english_text": "\"The most beloved of names to Allah are 'Abdullah and 'Abdur-Rahman.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 3731,
            "title": "Sunan Ibn Majah 3729",
            "narrator": "It was narrated from 'Umar ibn Al-Khattab that the Prophet(ﷺ) said:",
            "english_text": "\"If I live- if Allah wills - I will forbid the names Rabah(profit), Najih(saved), Aflah (Successful), Nafi (beneficial) and Yasar(prosperity).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 3732,
            "title": "Sunan Ibn Majah 3730",
            "narrator": "It was narrated that Samurah said:",
            "english_text": "\"The Messenger of Allah(ﷺ) forbade giving our slaves four names: Aflah (successful), Nafi' (beneficial), Rabah (profit) and Yasar(prosperity).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 75,
            "hadithNum_inBook": 3733,
            "title": "Sunan Ibn Majah 3731",
            "narrator": "It was narrated that Masruq said:",
            "english_text": "\"I met 'Umar bin Khattab and he said: 'Who are you?' I said: 'Masruq bin Adja'.' 'Umar said: 'I heard the Messenger of Allah(ﷺ) saying,\"Ajda' is a devil.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 76,
            "hadithNum_inBook": 3734,
            "title": "Sunan Ibn Majah 3732",
            "narrator": "It was narrated from Abu Hurairah that:",
            "english_text": "\"Zainab used to be called \"Barrah\" (good), and it was said that she was praising herself. So the Messenger of Allah(ﷺ) changed her name to Zainab.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 77,
            "hadithNum_inBook": 3735,
            "title": "Sunan Ibn Majah 3733",
            "narrator": "It was narrated from Ibn Umar that:",
            "english_text": "\"a daughter of 'Umar was Asiyah(disobedient) then the Messenger of Allah(ﷺ) named her 'Jamilah' (beautiful).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 78,
            "hadithNum_inBook": 3736,
            "title": "Sunan Ibn Majah 3734",
            "narrator": "It was narrated that Abdullah bin Salam said:",
            "english_text": "\"I came to the Messenger of Allah(ﷺ), and my name was not Abdullah bin Salam. The Messenger of Allah(ﷺ) named me Abdullah bin Salam.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 79,
            "hadithNum_inBook": 3737,
            "title": "Sunan Ibn Majah 3735",
            "narrator": "It was narrated from Muhammad that they heard Abu Hurairah say:",
            "english_text": "\"Abul Qasim(ﷺ) said: 'Call yourselves by my name but do not call yourselves by my Kunyah.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 80,
            "hadithNum_inBook": 3738,
            "title": "Sunan Ibn Majah 3736",
            "narrator": "It was narrated from Jabir that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Call yourselves by my name but do not call yourselves by my Kunyah.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 81,
            "hadithNum_inBook": 3739,
            "title": "Sunan Ibn Majah 3737",
            "narrator": "It was narrated that Anas said:",
            "english_text": "\"The Messenger of Allah(ﷺ) was in Baqi', and a man called out to another man: 'O Abul-Qasim!' The Messenger of Allah(ﷺ) turned to him, and he said: 'I didn't mean you.' The Messenger of Allah(ﷺ) said: 'Call yourselves by my name but do not call yourselves by my Kunyah.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 82,
            "hadithNum_inBook": 3740,
            "title": "Sunan Ibn Majah 3738",
            "narrator": "It was narrated from Hamzah bin Suhaib that Umar said to Suhaib:",
            "english_text": "\"Why are you called Abu Yahya when you do not have a son?\" He said: \"The Messenger of Allah(ﷺ) gave me the Kunya of Abu Yahya.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 83,
            "hadithNum_inBook": 3741,
            "title": "Sunan Ibn Majah 3739",
            "narrator": "It was narrated from Aisha that she said to the Prophet(ﷺ):",
            "english_text": "\"All of your wives have a Kunyah except me.\" He said: \"You are Umm Abdullah\".",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 84,
            "hadithNum_inBook": 3742,
            "title": "Sunan Ibn Majah 3740",
            "narrator": "It was narrated that Anas said:",
            "english_text": "\"The Prophet(ﷺ) used to come to us and say to a brother of mine, who was small: 'O Abu Umair.'\".",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 85,
            "hadithNum_inBook": 3743,
            "title": "Sunan Ibn Majah 3741",
            "narrator": "It was narrated that Abu Jabirah bin Dahhak said:",
            "english_text": "\"(Allah's saying) \"Nor insult one another by nicknames(Surah Al Hujarat 49:11)\" was revealed concerning us, the Ansar. When the Prophet(ﷺ) came to us, a man among us would have two or three names, and the Prophet(ﷺ) might call him by one of those names, only to be told: \"O Messenger of Allah(ﷺ), he does not like that name.\" Then:\"Nor insult one another by nicknames.\" was revealed.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 86,
            "hadithNum_inBook": 3744,
            "title": "Sunan Ibn Majah 3742",
            "narrator": "It was narrated that Miqdad bin 'Amr said:",
            "english_text": "\"The Messenger of Allah(ﷺ) commanded us to throw dust in the faces of those who praise others.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 87,
            "hadithNum_inBook": 3745,
            "title": "Sunan Ibn Majah 3743",
            "narrator": "It was narrated that Muawiyah said:",
            "english_text": "\"I heard the Messenger of Allah(ﷺ) say: 'Beware of praising one another, for it is slaughtering (one another).'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 88,
            "hadithNum_inBook": 3746,
            "title": "Sunan Ibn Majah 3744",
            "narrator": "It was narrated from Abdur-Rahman bin Abu Bakrah that his father said:",
            "english_text": "\"A man praised another man in the presence of Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) said: 'Woe to you,you have cut the neck of your companion,'several times. Then he said: 'If anyone of you praises his brother, let him say: \"I think he is lie this, but I do not sanctify anyone before Allah.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 89,
            "hadithNum_inBook": 3747,
            "title": "Sunan Ibn Majah 3745",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"One who is consulted is entrusted.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 90,
            "hadithNum_inBook": 3748,
            "title": "Sunan Ibn Majah 3746",
            "narrator": "It was narrated from Abu Mas'ud that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"One who is consulted is entrusted.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 91,
            "hadithNum_inBook": 3749,
            "title": "Sunan Ibn Majah 3747",
            "narrator": "It was narrated from Jabir that that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If one of you consults his brother, then let him advise him.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 92,
            "hadithNum_inBook": 3750,
            "title": "Sunan Ibn Majah 3748",
            "narrator": "It was narrated that Abdullah bin Amr said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: 'You will conquer the lands of the non-Arabs, where you will find houses called Hammamat (bathhouses). Men Should only enter them wearing a waist wrap, and do not let women enter them unless they are sick or bleeding following childbirth.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 93,
            "hadithNum_inBook": 3751,
            "title": "Sunan Ibn Majah 3749",
            "narrator": "It was narrated from Aisha that the Prophet(ﷺ):",
            "english_text": "forbade men and women to enter bathhouses, then he allowed men to enter them wearing a waist wrap, but he did not make the same allowance for women.",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 94,
            "hadithNum_inBook": 3752,
            "title": "Sunan Ibn Majah 3750",
            "narrator": "It was narrated from Abu Malih AL-HUdhail that some women from the people of Hims asked permission to enter upon Aisha. She said:",
            "english_text": "\"Perhaps you are among those (women) who enter bathhouses? I heard the Messenger of Allah(ﷺ) say: 'Any woman who takes off her clothes anywhere but in her husband's house, has torn the screen between her and Allah.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 95,
            "hadithNum_inBook": 3753,
            "title": "Sunan Ibn Majah 3751",
            "narrator": "It was narrated from Umm Salamah that when the Prophet(ﷺ) would apply (it):",
            "english_text": "he began with his private area, coating it with hair removing chemical. And his wife would do the remainder of his body.",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 96,
            "hadithNum_inBook": 3754,
            "title": "Sunan Ibn Majah 3752",
            "narrator": "It was narrated from Umm Salamah that:",
            "english_text": "\"the Prophet(ﷺ) would coat (with hair removing chemical) and remove the pubic hairs with his hand.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 97,
            "hadithNum_inBook": 3755,
            "title": "Sunan Ibn Majah 3753",
            "narrator": "It was narrated from Amr bin Shuaib, from his father, from his grandfather, that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"No one tells the stories to the people (for the purpose of exhortation) except a ruler, one appointed by a ruler, or a show-off.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 98,
            "hadithNum_inBook": 3756,
            "title": "Sunan Ibn Majah 3754",
            "narrator": "It was narrated that Ibn Umar said:",
            "english_text": "\"Stories (for the purpose of exhortation) were unknown at the time of the Messenger of Allah(ﷺ), the time of Abu Bakr and Umar.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 99,
            "hadithNum_inBook": 3757,
            "title": "Sunan Ibn Majah 3755",
            "narrator": "It was narrated from Ubbay bin Ka'b that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"In some poetry there is wisdom.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 100,
            "hadithNum_inBook": 3758,
            "title": "Sunan Ibn Majah 3756",
            "narrator": "It was narrated from Ibn Abbas that the Prophet(ﷺ) said:",
            "english_text": "\"In some poetry there is wisdom.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 101,
            "hadithNum_inBook": 3759,
            "title": "Sunan Ibn Majah 3757",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The truest of wods spoken by the poet are the words of Labid: Everything except Allah is false.' And Abu Umayyah bin Abu Salt nearly accepted Islam.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 102,
            "hadithNum_inBook": 3760,
            "title": "Sunan Ibn Majah 3758",
            "narrator": "It was narrated from Amr bin Sharid that his father said:",
            "english_text": "\"I recited one hundered verses of the poetry of Umayyah bin Abu Salt to the Messenger of Allah(ﷺ), and after every line he said, \"More\". And he said: \"He nearly accepted Islam.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 103,
            "hadithNum_inBook": 3761,
            "title": "Sunan Ibn Majah 3759",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 104,
            "hadithNum_inBook": 3762,
            "title": "Sunan Ibn Majah 3760",
            "narrator": "It was narrated from Sad bin Abu Waqas that the Prophet(ﷺ) said:",
            "english_text": "\"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 105,
            "hadithNum_inBook": 3763,
            "title": "Sunan Ibn Majah 3761",
            "narrator": "It was narrated from Aisha that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The worst of all people lying is a man who trades insults with another man, disparaging the entire tribe, and a man who denies his father and accuses his mother of adultery.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 106,
            "hadithNum_inBook": 3764,
            "title": "Sunan Ibn Majah 3762",
            "narrator": "It was narrated that Abu Musa said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: 'Whoever plays backgammon has disobeyed Allah and His Messenger.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 107,
            "hadithNum_inBook": 3765,
            "title": "Sunan Ibn Majah 3763",
            "narrator": "It was narrated from Sulaiman bin Buraidah from his father that the Prophet(ﷺ) said:",
            "english_text": "\"Whoever plays backgammon, it is as if he dipped his hand in the flesh and blood of a pig.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 108,
            "hadithNum_inBook": 3766,
            "title": "Sunan Ibn Majah 3764",
            "narrator": "It was narrated from 'Aishah that the Prophet(ﷺ) looked at a man who was chasing a bird and said:",
            "english_text": "\"A devil chasing a devil.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 109,
            "hadithNum_inBook": 3767,
            "title": "Sunan Ibn Majah 3765",
            "narrator": "It was narrated from Abu Hurairah that the Prophet(ﷺ) saw a man chasing a pigeon and said:",
            "english_text": "\"A male devil following a female devil.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 110,
            "hadithNum_inBook": 3768,
            "title": "Sunan Ibn Majah 3766",
            "narrator": "It was narrated from Uthman bin Affan that the Messenger of Allah(ﷺ) saw a man following a pigeon and said:",
            "english_text": "\"A male devil chasing a female devil.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 111,
            "hadithNum_inBook": 3769,
            "title": "Sunan Ibn Majah 3767",
            "narrator": "It was narrated that Anas bin Malik said:",
            "english_text": "\"The Messenger of Allah(ﷺ) saw a man chasing a pigeon and said: 'A devil chasing a devil.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 112,
            "hadithNum_inBook": 3770,
            "title": "Sunan Ibn Majah 3768",
            "narrator": "It was narrated from Ibn 'Umar that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If anyone of you knew what is wrong with being alone, no one would travel at night by himself.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 113,
            "hadithNum_inBook": 3771,
            "title": "Sunan Ibn Majah 3769",
            "narrator": "It was narrated from Salim, from his father, that the Prophet(ﷺ) said:",
            "english_text": "\"Do not leave fire in your houses when you go to sleep.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 114,
            "hadithNum_inBook": 3772,
            "title": "Sunan Ibn Majah 3770",
            "narrator": "It was narrated that Abu Musa said:",
            "english_text": "\"A house burned down in Al-Madinah, with its occupants inside. The Prophet(ﷺ) was told of what had happened, and he said: 'This fire is an enemy to you. When you go to sleep, extinguish it.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 115,
            "hadithNum_inBook": 3773,
            "title": "Sunan Ibn Majah 3771",
            "narrator": "It was narrated that Jabir said:",
            "english_text": "\"The Messenger of Allah(ﷺ) commanded us (to do some things) and forbade us (to do some things), and he commanded us to extinguish our lamps.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 116,
            "hadithNum_inBook": 3774,
            "title": "Sunan Ibn Majah 3772",
            "narrator": "It was narrated from Jabir that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Do not camp on the middle of the road, or relieve yourselves there.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 117,
            "hadithNum_inBook": 3775,
            "title": "Sunan Ibn Majah 3773",
            "narrator": "Abdullah bin Ja'far said:",
            "english_text": "\"Whenever the Messenger of Allah(ﷺ) came back from a journey, he would be met by us(children). (One day) he was met by me and Hasan or Husain. He made one of us ride in front of him and the other behind him, until we came to Al-Madinah.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 118,
            "hadithNum_inBook": 3776,
            "title": "Sunan Ibn Majah 3774",
            "narrator": "It was narrated from Jabir that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Put dust on your writings, because it is better, and dust is blessed (being humble in correspondence brings good results).\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 119,
            "hadithNum_inBook": 3777,
            "title": "Sunan Ibn Majah 3775",
            "narrator": "It was narrated from Abdullah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"When you are three, two should  not converse (privately) to the exclusion of their companion, because that makes him sad.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 120,
            "hadithNum_inBook": 3778,
            "title": "Sunan Ibn Majah 3776",
            "narrator": "It was narrated that Ibn 'Umar said:",
            "english_text": "\"The Messenger of Allah(ﷺ) forbade two to converse (privately) to the exclusion of a third.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 121,
            "hadithNum_inBook": 3779,
            "title": "Sunan Ibn Majah 3777",
            "narrator": "Jabir bin 'Abdullah said:",
            "english_text": "\"A man passed through the masjid with some arrows, and the Messenger of Allah(ﷺ) said: 'Hold them by their heads!' He said: 'Yes(ok).'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 122,
            "hadithNum_inBook": 3780,
            "title": "Sunan Ibn Majah 3778",
            "narrator": "It was narrated from Abu Musa that the Prophet(ﷺ) said:",
            "english_text": "\"When anyone of you passes through our masjid or our marketplace carrying arrows, let him hold them by their heads, lest he hurt any Muslims.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 123,
            "hadithNum_inBook": 3781,
            "title": "Sunan Ibn Majah 3779",
            "narrator": "It was narrated from Aisha that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"The one who is proficient with the Qur'an will be with the noble and righteous scribes (the angels), and the one who reads it and stumbles over it, finding it difficult, will have two rewards.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 124,
            "hadithNum_inBook": 3782,
            "title": "Sunan Ibn Majah 3780",
            "narrator": "It was narrated from Abu Sa`eed Al-Khudri that the Messenger of Allah (ﷺ) said:",
            "english_text": "\"It will be said to the companion of the Qur'an, when he enters Paradise: 'Recite and rise one degree for every Verse,' until he recites the last thing that he knows.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 125,
            "hadithNum_inBook": 3783,
            "title": "Sunan Ibn Majah 3781",
            "narrator": "It was narrated from Ibn Buraidah that his father told that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The Quran will come on the Day of Resurrection, like a pale man, and will say: 'I am the one that kept you awake at night and made you thirsty during the day.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 126,
            "hadithNum_inBook": 3784,
            "title": "Sunan Ibn Majah 3782",
            "narrator": "It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Wouldn't anyone of you like to find three great, fat pregnant she-camels when he returns to his family?\" We said: \"Yes.\" He said: \"Three verses that one of you recites during the praer are better for him than three great, fat pregnant she-camels.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 127,
            "hadithNum_inBook": 3785,
            "title": "Sunan Ibn Majah 3783",
            "narrator": "It was narrated from Ibn Umar that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The likeness of the Quran is that of a hobbled camel. If its owner ties its rope, he will keep it, but if he loosens its rope it will go away.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 128,
            "hadithNum_inBook": 3786,
            "title": "Sunan Ibn Majah 3784",
            "narrator": "It was narrated that Abu Hurairah said, 'I heard the Messenger of Allah(ﷺ) say':",
            "english_text": "\"Allah said: 'I have divided the prayer between Myself and My slave into two halves, and My slave shall have what he has asked for.'When the slave says: 'Al-hamdulillah i rabbil Alameen (All the praise is to Allah, the Lord of all that exists),' Allah says:'My slave has praised Me, and My slave shall have what he has asked for.' And when he says: 'Ar-Rahmanir-Rahim (The Mos Gracious, the Most Merciful),' Allah says: 'My slave has extolled Me, and My slave shall have what he has asked for.' And when he says: 'Maliki yawmiddin [The Only Owner (and he Ruling Judge] if the Day of Recompense],' Allahs says: 'My slave has Glorified Me. This is for Me, and this Verse is between me and My slave in two halves.' And when he says: ' Iyyaka na'budu wa iyyaka nastain [You (Alone) we worship, and You (Alone) we ask for help],' He says: 'This is between Me an My slave, and My slave shall have what he has asked for.' And the end of the Surah is for My slave.' And when he says: 'Ihdinas-siratal-mustaqeema, siratal-alldhina an'amta alayhim a lad-dallin [Guide us to the Straight Way, the way of those on whom You have bestowed Your Grace, not(the way) of those who earned Your Anger, nor of those who went astray],' He says: 'THis is for My slave, and My slave shall have what he has asked for.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 129,
            "hadithNum_inBook": 3787,
            "title": "Sunan Ibn Majah 3785",
            "narrator": "It was narrated that Abu Sa'eed bin Mu'alla said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said to me: 'Shall I not teach you the greatest Surah in the QUran before I leave the masjid?' Then the Propeht(ﷺ) went to leave, so I reminded him, and he said: Al-hamdulillahi Rabbil-Alameen (All the praise is to Allah, the Lord of all that exists). It is the Seven Oft-Recited Verses, and it is the Grand Quran that has been given to me.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 130,
            "hadithNum_inBook": 3788,
            "title": "Sunan Ibn Majah 3786",
            "narrator": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:",
            "english_text": "\"There is a surah in the Qur'an, with thirty verses, which will intercede for its companion (the one who recites it) until he is forgiven: Tabarakal-ladhi bi yadihil mulk (Blessed is He in Whose Hand is the Dominion).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 131,
            "hadithNum_inBook": 3789,
            "title": "Sunan Ibn Majah 3787",
            "narrator": "It was narrated that Abu Hurairah said that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 132,
            "hadithNum_inBook": 3790,
            "title": "Sunan Ibn Majah 3788",
            "narrator": "It was narrated that Anas bin Malik said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 133,
            "hadithNum_inBook": 3791,
            "title": "Sunan Ibn Majah 3789",
            "narrator": "It was narrated that Abu Masud Al Ansari said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: \"Allahu ahad, Al-Wahidus-Samad [Allah (the) One, the One the Self-Sufficient Master] is equivalent to one third of the Quran.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 134,
            "hadithNum_inBook": 3792,
            "title": "Sunan Ibn Majah 3790",
            "narrator": "It was narrated from Abu Darda that the Prophet(ﷺ) said:",
            "english_text": "\"Shall I not tell you of the best of your deeds, the most pleasing to your Sovereign, those that raise you most in status, that are better than your gold and silver, or meeting you enemy (in battle) and you strike their necks and they strike your necks?\" They said: \" WHat is that, O Messenger of Allah?\" He said: \"Remembering Allah(Dhikr).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 135,
            "hadithNum_inBook": 3793,
            "title": "Sunan Ibn Majah 3791",
            "narrator": "It was narrated that Abu Hurairah and Abu Sa'eed bore witness that the Prophet(ﷺ) said:",
            "english_text": "\"No people sit in a gathering remembering Allah, But the angels surround them, mercy covers them, tranquility descends upon them and Allah remembers them before those who are with Him.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 136,
            "hadithNum_inBook": 3794,
            "title": "Sunan Ibn Majah 3792",
            "narrator": "It was narrated from Abu Hurairah that the Prophet(ﷺ) said:",
            "english_text": "\"Allah says: 'I am with My slave when he remembers Me and his lips move saying My Name.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 137,
            "hadithNum_inBook": 3795,
            "title": "Sunan Ibn Majah 3793",
            "narrator": "It was narrated from Abdullah bin Busr that a Bedouin said to the Messenger of Allah(ﷺ) said:",
            "english_text": "\"The laws of Islam are burdensome for me. Tell me of something that I will be able to adhere to. He said: 'Always keep your tongue moist with the remembrance of Allah, the Mighty and Sublime.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 138,
            "hadithNum_inBook": 3796,
            "title": "Sunan Ibn Majah 3794",
            "narrator": "It was narrated from Abu Hurairah and Abu Saeed bore witness that the Messenger of Allah(ﷺ) said:",
            "english_text": "\"If a person says: 'La ilaha illallahu wa Allahu Akbar (None has the right to be worshipped but Allah and Allah is the Most Great),'Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, and I am the Most Great.' If a person says: La ilaha Illallah wahdahu (There is none worthy of worship except Allah alone), Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, alone.' If he says, La ilaha illallahu la sharikalahu (There is none worthy of worship except Allah with no partner or associate),' Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, with no partner or associate.' If he says: 'La illah illallah, lahul mulku wa lahul hamdu (There is none worthy of worship except Allah, all dominion is His and all praise is to Him),' Allah says: 'My slave has spoken the truth; there is none of worthy of worship except I, all dominion Mine and all praise is due to Me.' If he says: ' La illaha illallah, la hawla wa la quwwata illa billah (There is none worthy of worship and there is no power and no strength except with Allah),' Allah says: 'My slave has spoken then truth; there is none worthy of worship except I, and tehre is no power and no strength except with Me.' One of the narrators Abu Ishaq said: \"Then Agharr (another narrator) said something that I did not understand. I said to Abu Jafar: 'What did he say?' He said: 'Whoever is blessed with (the ability to say) them (these words) at the time of death, the Fire will not touch him.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 139,
            "hadithNum_inBook": 3797,
            "title": "Sunan Ibn Majah 3795",
            "narrator": "It was narrated from Yahya bin Talha that :",
            "english_text": "his mother Su'da Al-Murriyyah said: \"Umar bin Khattab passed by Talhah, after the Messenger of Allah(ﷺ) had died, and said: 'Why do you look so sad? Are you upset because your cousin has been appointed leader?' He said: 'No, but I heard the Messenger of Allah(ﷺ) say: \"I know a word which no one says at the time of death but it will be light in his record of deeds, and his body and soul will find comfort in it at the time of death,\" -but I did not ask him about it before he died.' He ('Umar) said: ' I know what it is. It is what he wanted his uncle (Abu Talib) to say, and if he had known anything that would be more effective in saving him, he would have told him to say it.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 140,
            "hadithNum_inBook": 3798,
            "title": "Sunan Ibn Majah 3796",
            "narrator": "It was narrated from Mu'adh bin Jabal that the :",
            "english_text": "Messenger of Allah(ﷺ) said: \"There is no soul that died bearing witness to La ilaha illallah, and that I am the Messenger of Allah, from the heart with certainity, but Allah will forgive it.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 141,
            "hadithNum_inBook": 3799,
            "title": "Sunan Ibn Majah 3797",
            "narrator": "It was narrated that Umm Hani' said:",
            "english_text": "\"The Messenger of Allah(ﷺ) said: (About saying) La ilaha illah - no deed takes precedence over it and it does not leave any sin.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 142,
            "hadithNum_inBook": 3800,
            "title": "Sunan Ibn Majah 3798",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah(ﷺ) said: \"Whoever says one hundered times each day: La ilaha illahu wahdahu la sharikalahu, wa lahul-mulku wa lahul hamduwa huwa ala kulli shayin qadeer (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, and He is able to do all things), it will be equivalent to him freeing ten slaves, and one hundered merits will be recorded for him, and one hundered bad deeds will be erased from (his record), and it will be a protection for him against Satan all day until night comes. No one can do anything better then him except one who says more.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 143,
            "hadithNum_inBook": 3801,
            "title": "Sunan Ibn Majah 3799",
            "narrator": "It was narrated from Abu Saeed that :",
            "english_text": "the Prophet(ﷺ) said: \"Whoever says, following the morning prayer: La ilaha illallahu wahdahu la sahrikalau, lahul mulku wa lahul hamdu, bi yadihil khair, wa huwa ala kulli shay'in qadir (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, in His Hand is all goodness, and He is Able to do all things), it will be as if he freed slave from among the sons of Isma'il.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 144,
            "hadithNum_inBook": 3802,
            "title": "Sunan Ibn Majah 3800",
            "narrator": "Jabir bin 'Abdullah said:",
            "english_text": "\"I heard the Messenger of Allah (ﷺ) say: 'The best of remembrance is La ilaha illallah (None has the right to be worshipped but Allah), and the best of supplication is Al-Hamdu Lillah (praise is to Allah).'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 145,
            "hadithNum_inBook": 3803,
            "title": "Sunan Ibn Majah 3801",
            "narrator": "It was narrated from 'Abdullah bin 'Umar that :",
            "english_text": "the Messenger of Allah (ﷺ) told them: \"One of the slaves of Allah said: 'Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li 'azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of Your Might.)' The angels were uncertain and did not know how to write this down, so they ascended to heaven and said: 'O our Lord, Your slave has said a word that we do not know how to write down.' Allah said - and He knows best what His slave said - 'What did My slave say?' They said: 'O Lord, he said \"Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li'azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of your Might).'\" Allah said to them: 'Write it down as My slave said it, until he meets Me and I shall reward him for it.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 146,
            "hadithNum_inBook": 3804,
            "title": "Sunan Ibn Majah 3802",
            "narrator": "It was narrated from 'Abdul-Jabbar bin Wa'il that :",
            "english_text": "his father said: \"I prayed with the Prophet (ﷺ) and a man said: 'Alhamdu lillahi hamdan kathiran tayyiban mubarakan fihi (Praise is to Allah, much, good and blessed praise).' When the Prophet (ﷺ) finished praying, he said: 'Who said that?' The man said: 'It was me, but I did not mean anything but good.' He said: 'The gates of heaven were opened because of it and nothing prevented it from reaching the Throne.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 147,
            "hadithNum_inBook": 3805,
            "title": "Sunan Ibn Majah 3803",
            "narrator": "It was narrated that 'Aishah said:",
            "english_text": "\"When the Messenger of Allah (ﷺ) saw something he liked, he would say: 'Al-hamdu lillahil-ladhi bi ni'matihi tatimmus-salihat (Praise is to Allah by Whose grace good deeds are completed).' And if he saw something that he disliked, he would say: 'Al-hamdu lillahi 'ala kulli hal (Praise is to Allah in all circumstances).'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 148,
            "hadithNum_inBook": 3806,
            "title": "Sunan Ibn Majah 3804",
            "narrator": "It was narratd from Abu Hurairah that :",
            "english_text": "the Prophet (ﷺ) used to say: \"Al-hamdu lillahi 'ala kulli hal. Rabbi a'udhu bika min hali ahlin-nar (Praise is to Allah in all circumstances, O Allah, I seek refuge with You from the situation of the people of Hell).\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 149,
            "hadithNum_inBook": 3807,
            "title": "Sunan Ibn Majah 3805",
            "narrator": "It was narrated from Anas that :",
            "english_text": "the Messenger of Allah (ﷺ) said: 'Allah does not bestow a blessing upon any slave and he says: 'Al-hamdu Lillah (praise is to Allah),' except that what he gives (the praise) is better than what he received (the blessing).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 150,
            "hadithNum_inBook": 3808,
            "title": "Sunan Ibn Majah 3806",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (ﷺ) said: 'Two words which are light on the tongue and heavy in the Balance, and beloved to the Most Merciful: Subhan-Allah wa bi hamdihi, Subhan-Allahil-'Azim (Glory and praise is to Allah, glory is to Allah the Almighty).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 151,
            "hadithNum_inBook": 3809,
            "title": "Sunan Ibn Majah 3807",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (ﷺ) passed by him when he was planting a plant, and said: \"O Abu Hurairah, what are you planting?\" I said: \"A plant for me.\" He said: \"Shall I not tell you of a plant that is better than this?\" He said: \"Of course, O Messenger of Allah.\" He said: \"Say: 'Subhan-Allah, wal-hamdu-lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great.)' For each one a tree will be planted for you in Paradise.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 152,
            "hadithNum_inBook": 3810,
            "title": "Sunan Ibn Majah 3808",
            "narrator": "It was narrated that Juwairiyah said:",
            "english_text": "\"The Messenger of Allah (ﷺ) passed by her when he prayed the morning prayer, or after he prayed the morning prayer, and she was remembering Allah.  He came back when the sun had risen\" - or he (one of the narrators) said, \"at midday - and she was still doing that. He said: 'I have said four words, three times, since I left you, and they are greater and weigh more heavily than what you have said.  They are: Subhan-Allahi 'adada khalqiha, Subhan-Allahi rida nafsihi, Subhan-Allahi zinata 'arshihi, Subhan-Allah midada kalimatihi (Glory is to Allah, as much as the number of His creation, glory is to Allah as much as pleases Him, glory is to Allah as much as the weight of His Throne, glory is to Allah as much as the ink of His words'.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 153,
            "hadithNum_inBook": 3811,
            "title": "Sunan Ibn Majah 3809",
            "narrator": "It was narrated from Nu'man bin Bashir that :",
            "english_text": "the Messenger of Allah (ﷺ) said: \"What you mention of glory of Allah, of Tabsih (Subhan-Allah), Tahlil (Allahu-Akbar) and Tahmid (Al-Hamdu lillah), revolves around the Throne, buzzing like bees, reminding of the one who said it.  Wouldn't any one of you like to have, or continue to have, something that reminds of him (in the presence of Allah)?'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 154,
            "hadithNum_inBook": 3812,
            "title": "Sunan Ibn Majah 3810",
            "narrator": "It was narrated that Umm Hani' said:",
            "english_text": "\"I came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, tell me of a (good) deed, for I have become old and weak and overweight.' He said: 'Proclaim the greatness of Allah (say Allahu Akbar) one hundred times, praise Allah (say Al-Hamdu Lillah) one hundred times, and glorify Allah (say Subhan-Allah) one hundred times. (That is) better than one hundred horses bridled and saddled for the sake of Allah, better than one hundred sacrificial camels, and better than (freeing) one hundred slaves.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 155,
            "hadithNum_inBook": 3813,
            "title": "Sunan Ibn Majah 3811",
            "narrator": "It was narrated from Samurah bin Jundab that :",
            "english_text": "the Prophet (ﷺ) said: \"(There are) four that are the best of words, and it does not matter with which you begin: Subhan-Allah, wal-Hamdu-Lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great).\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 156,
            "hadithNum_inBook": 3814,
            "title": "Sunan Ibn Majah 3812",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (ﷺ) said: \"Whoever says: Subhan Allahi wa bi hamdihi (Glory and praise is to Allah) one hundred times, his sins will be forgiven even if they were like the foam of the sea.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 157,
            "hadithNum_inBook": 3815,
            "title": "Sunan Ibn Majah 3813",
            "narrator": "It was narrated that Abu Darda' said:",
            "english_text": "\"The Messenger of Allah (ﷺ) said to me: 'You should recite Subhan-Allah, wal-Hamdu-Lillah, wa la ilahah illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, and Allah is the Most Great), for it sheds sins like the tree sheds its leaves.'\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 158,
            "hadithNum_inBook": 3816,
            "title": "Sunan Ibn Majah 3814",
            "narrator": "It was narrated that Ibn `Umar said:",
            "english_text": "\"We used to count that the Messenger of Allah (ﷺ) said one hundred times in a gathering: 'Rabbighfirli wa tub `alayya innaka Antat-Tawwabur-Rahim (O Allah forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful).'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 159,
            "hadithNum_inBook": 3817,
            "title": "Sunan Ibn Majah 3815",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (saas) said: 'I seek the forgiveness of Allah and repent to Him one hundred times each day.'",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 160,
            "hadithNum_inBook": 3818,
            "title": "Sunan Ibn Majah 3816",
            "narrator": "It was narrated from Sa'eed bin Abu Burdah bin Abu Musa, from his father, that :",
            "english_text": "his grandfather said: \"The Messenger of Allah (saas) said: 'I seek the forgivenenss of Allah and repent to Him seventy times each day.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 161,
            "hadithNum_inBook": 3819,
            "title": "Sunan Ibn Majah 3817",
            "narrator": "It was narrated that Hudhaifah said:",
            "english_text": "\"I was harsh in the way I spoke to my family, but not to others.  I mentioned that to the Prophet (saas) and he said: 'Why don't you ask for forgiveness? Ask Allah to forgive you, seventy times each day.'\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 162,
            "hadithNum_inBook": 3820,
            "title": "Sunan Ibn Majah 3818",
            "narrator": "'Abdullah bin Busr said that :",
            "english_text": "the Prophet (saas) said: \"Glad tidings to those who find a lot of seeking forgiveness in the record of their deeds.\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 163,
            "hadithNum_inBook": 3821,
            "title": "Sunan Ibn Majah 3819",
            "narrator": "It was narrated from 'Abdullah bin 'Abbas that :",
            "english_text": "the Messenger of Allah said: \"Whoever persists in asking for forgiveness, Allah will grant him relief from every worry, and a way out from every hardship, and will grant him provision from (sources) he could never imagine.\"",
            "grade": "Da'if (Darussalam)"
        },
        {
            "hadithNum_inChapter": 164,
            "hadithNum_inBook": 3822,
            "title": "Sunan Ibn Majah 3820",
            "narrator": "It was narrated from 'Aishah that :",
            "english_text": "the Prophet (saas) used to say: \"Allahum-maj'alni minal-ladhina idha ahsanu istabsharu, wa idha asa'u istaghfaru (O Allah, make me one of those who, if they do good deeds, they rejoice, and if they do bad deeds, they seek forgiveness).\"",
            "grade": "Hasan (Darussalam)"
        },
        {
            "hadithNum_inChapter": 165,
            "hadithNum_inBook": 3823,
            "title": "Sunan Ibn Majah 3821",
            "narrator": "It was narrated from Abu Dharr that :",
            "english_text": "the Messenger of Allah (saas) said: \"Allah, the Blessed and Exalted, said: 'Whoever does one good deed will have (the reward of) ten like it and more, and whoever does a bad deed will have one like it, or I will forgive him.  Whoever draws near to Me a hand span, I draw near to him an arm's length; whoever comes to Me a forearm's length, I draw near him an arm's length; whoever comes to Me walking, I come to him in a hurry.  Whoever meets Me with an earthful of sins, but does not associate anything in worship with Me, I will meet it (i.e., his sins) with forgiveness equal to that.'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 166,
            "hadithNum_inBook": 3824,
            "title": "Sunan Ibn Majah 3822",
            "narrator": "It was narrated from Abu Hurairah that :",
            "english_text": "the Messenger of Allah (saas) said: \"Allah says, 'I am as My slave thinks I am, and I am with him when he mentions Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it.  And if he draws to Me a hand-span length, I draw near to him a forearm's length.  And if he comes to Me walking, I go to him in a hurry.\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 167,
            "hadithNum_inBook": 3825,
            "title": "Sunan Ibn Majah 3823",
            "narrator": "It was narrated from Abu Hurairah that the Messenger :",
            "english_text": "of Allah (saas) said: \"Every deed of the son of Adam will be multiplied for him, between ten and seven hundred times for each merit. Allah said: 'Except for fasting, for it is for Me and I shall reward for it.'\" (sahih)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 168,
            "hadithNum_inBook": 3826,
            "title": "Sunan Ibn Majah 3824",
            "narrator": "It was narrated that Abu Musa said:",
            "english_text": "\"The Prophet (saas) heard me saying: 'La hawla wa la quwwata illa billah (there is no power and no strength except with Allah).' He said: 'O 'Abdullah bin Qais! Shall I not tell you of a word which is one of the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'Say: La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'\"",
            "grade": "Sahih (Darussalam)"
        },
        {
            "hadithNum_inChapter": 169,
            "hadithNum_inBook": 3827,
            "title": "Sunan Ibn Majah 3825",
            "narrator": "It was narrated that Abu Dharr said:",
            "english_text": "\"The Messenger of Allah (saas) said to me: \"Shall I not tell you of a treasure which is one of the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'\" (sahih)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 170,
            "hadithNum_inBook": 3828,
            "title": "Sunan Ibn Majah 3826",
            "narrator": "It was narrated that Hazim bin Harmalah said:",
            "english_text": "\"I passed by the Prophet (saas) and he said to me: 'O Hazim, say often: \"La hawla wa la quwwata illa billah (there is no power and no strength except with Allah),\" for it is one of the treasures of Paradise.'\"",
            "grade": "Hasan (Darussalam)"
        }
    ]
}