{
    "chapterNum": 31,
    "english_title": "The Book of Judicial Decisions",
    "totalHadiths_inChapter": 28,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 4431,
            "title": "Sahih Muslim 1711 a",
            "narrator": "Ibn Abbas reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "If the people were given according to their claims, they would claim the lives of persons and their properties, but the oath must be taken by the defendant.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 4432,
            "title": "Sahih Muslim 1711 b",
            "narrator": "",
            "english_text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) pronounced judgment on the basis of oath by the defendant.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 4433,
            "title": "Sahih Muslim 1712",
            "narrator": "",
            "english_text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) pronounced judgment on the basis of an oath and a witness (by the plaintiff).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 4434,
            "title": "Sahih Muslim 1713 a",
            "narrator": "Umm Salama reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 4435,
            "title": "Sahih Muslim 1713 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 4436,
            "title": "Sahih Muslim 1713 c",
            "narrator": "Umm Salama, the wife of Allah's Apostle (ﷺ), reported that Allah's Messenger (ﷺ) heard the clamour of contenders at the door of his apartment. He went to them, and said:",
            "english_text": "I am a human being and the claimants bring to me (the dispute) and perhaps some of them are more eloquent than the others. I judge him to be on the right, and thus decide in his favcur. So he whom I, by my judgment, (give the undue share) out of the right of a Muslim,. I give him a portion of Fire; he may burden himself with it or abandon it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 4437,
            "title": "Sahih Muslim 1713 d",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Ma'mar with a slight variation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 4438,
            "title": "Sahih Muslim 1714 a",
            "narrator": "A'isha reported:",
            "english_text": "Hind. the daughter of 'Utba, wife of Abu Sufyan, came to Allah's Messenger (ﷺ) and said: Abu Sufyan is a miserly person. He does not give adequate maintenance for me and my children, but (I am constrained) to take from his wealth (some part of it) without his knowledge. Is there any sin for me? Thereupon Allah's Messenger (ﷺ) said: Take from his property what is customary which may suffice you and your children.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 4439,
            "title": "Sahih Muslim 1714 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Hisham with the same chair of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 4440,
            "title": "Sahih Muslim 1714 c",
            "narrator": "A'isha reported that Hind came to Allah's Apostle (ﷺ) and said:",
            "english_text": "Messenger of Allah, by Allah, there was no other household upon the surface of the earth than your household about which I cherished Allah bringing disgrace upon it, (and now) there is no other household upon the surface of the earth than your household about which I cherish Allah granting it honour. Allah's Apostle (ﷺ) said: It is so, by Him in Whose Hand is my life She said: Allah's Messenger, Abu Sufyan is a niggardly person. Is there any harm for me if I spend upon his children out of his wealth without his permission? Thereupon Allah's Apostle (ﷺ) said: There is no harm for you if you spend upon them what is reasonable.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 4441,
            "title": "Sahih Muslim 1714 d",
            "narrator": "A'isha reported that Hind, daughter of Utba h. Rabi', came to Allah's Messenger (ﷺ) and said:",
            "english_text": "Allah's Messenger, by Allah, there was no household upon the surface of the earth than your household about which I cherished that it should be disgraced. But today there is no household on the surface of the earth than your household about which I cherish that it be honoured Thereupon Allah's Messenger (ﷺ) said. It will increase, by Him in Whose Hand is my life. She then said: Messenger of Allah, Abu Sufyan is a niggardly person; is there any harm for me if I spend out of that which belongs to him on our children? He said to her: No, but only that what is reasonable.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 4442,
            "title": "Sahih Muslim 1715 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Verily Allah likes three things for you and He disapproves three things for you. He is pleased with you that you worship Him and associate nor anything with Him, that you hold fast the rope of Allah, and be not scattered; and He disapproves for you irrelevant talk, persistent questioning ane the wasting of wealth.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 4443,
            "title": "Sahih Muslim 1715 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Suhail with the same chain of transmitters, but with a slight variation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 4444,
            "title": "Sahih Muslim 593 f",
            "narrator": "Mughira b. Shu'ba reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Verity Allah, the Glorious and Majestic, has forbidden for you: disobedience to mothers, and burying alive daughters, withholding the right of others in spite of having the power to return that to them and demanding that (which is not one's legitimate right). And He disapproved three things for you; irrelevant talk, persistent questioning and wasting of wealth.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 4445,
            "title": "Sahih Muslim 593 g",
            "narrator": "",
            "english_text": "A hadith like this has been trransmitted on the authority of Mansur with a slight vairiation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 4446,
            "title": "Sahih Muslim 593 h",
            "narrator": "Sha'bi reported that the scribe of al-Mughira b. Shu'ba said:",
            "english_text": "Mu'awiya wrote to Mughira: Write for me something which you heard from Allah's Messenger (ﷺ) ; and he wrote: I heard Allah's Messenger (ﷺ) as saying. Verily Allah disapproves three thingq for you: irrelevant talk, wasting of wealth and persistent questioning.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 4447,
            "title": "Sahih Muslim 593 i",
            "narrator": "Warrad reported that al-Mughira wrote to Mu'awiya:",
            "english_text": "Peace be upon you, and then coming to the poirt (I should say) that I heard Allah's Messenger (ﷺ) as saying: Verily Allah has Prohibited three things and has forbidden three things. He has declared absolutely haram the disobedience of father, burying of daughters alive, and withholding that which you have power to return, and has forbidden three things: irrelevant talk, persistent questioning, and wasting of wealth.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 4448,
            "title": "Sahih Muslim 1716 a",
            "narrator": "'Amr b. al-'As reported that he heard Allah's Messenger (ﷺ) as saying:",
            "english_text": "When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 4449,
            "title": "Sahih Muslim 1716 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abu Huraira with another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 4450,
            "title": "Sahih Muslim 1716 c",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Usama b. al-Had al-Laithi.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 4451,
            "title": "Sahih Muslim 1717 a",
            "narrator": "Abd al-Rahman b. Abu Bakra reported:",
            "english_text": "My father dictated (and I wrote for him) to Ubaidullah b. Abu Bakra while he was the judge of Sijistan: Do not judge between two persons when you are angry, for I have heard Allah's Messenger (ﷺ) as saying: None of you should judge between two persons when he is angry.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 4452,
            "title": "Sahih Muslim 1717 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of 'Abd al-Rahman b. Abu Bakra through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 4453,
            "title": "Sahih Muslim 1718 a",
            "narrator": "'A'isha reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who innovates things in our affairs for which there is no valid (reason) (commits sin) and these are to be rejected.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 4454,
            "title": "Sahih Muslim 1718 b",
            "narrator": "Sa'd b. Ibrahim reported:",
            "english_text": "I asked Qasim b. Muhammad about a person who had three dwelling houses and he willed away the third part of every one of these houses; he (Qasim b. Muhammad) said: All of them could be combined in one house; and then said: 'A'isha informed me that Allah's Messenger (ﷺ) said: He who did any act for which there is no sanction from our behalf, that is to be rejected.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 4455,
            "title": "Sahih Muslim 1719",
            "narrator": "Zaid b. Khalid al-Juhani reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Should I not tell you of the best witnesses? He is the one who produces his evidence before he is asked for it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 4456,
            "title": "Sahih Muslim 1720 a",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "While two women had been going along witn their two sons, a wolf came and made away with the child of one of them. One of them said to her companion: It is with your child that it (the wolf) has run away The other one said: It has run away with your child. They brought the matter to (Hadrat) Dawud (David) for decision and he made a decision in favour of the elder one. They then went to Sulaiman b. Dawud (may there be peace upon both of them) and told them (the story). He said: Bring me a knife so that I may cut him (the child) (into two parts) for you. The younger one said: No, it can't be, may Allah have mercy upon you, he (the child) belongs to her (the elder). So he gave a decision in favour of the younger one. abu Huraira said: If ever I heard of the word as-sikin at all, it was that day. We called it by no other name but al-Mudya.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 4457,
            "title": "Sahih Muslim 1720 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abu az-Zinad with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 4458,
            "title": "Sahih Muslim 1721",
            "narrator": "Hammim b. Munabbih said:",
            "english_text": "Abu Huraira reported (so many) ahadith of Allah's Messenger (ﷺ), and one of them is this: A person bought from another person a piece of land, and the person who had, bought that land found in it an earthen ware which contained gold. The person who had bought the land said (to the seller of the land): Take your gold from me, for I bought only the land from you and not the gold. The man who had sold the land said: I sold the land to you and whatever was in it. They referred the matter to a person. One who was made as a judge said to them: Have you any issue? One of them said: I have a boy, and the other said: I have a young daughter He (the judge) said: Marry this young boy with the girl, and spend something on yourselves and also give (some) charity out of it.",
            "grade": "none"
        }
    ]
}