{
    "chapterNum": 42,
    "english_title": "The Book of Poetry",
    "totalHadiths_inChapter": 11,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 5826,
            "title": "Sahih Muslim 2255 a, b",
            "narrator": "`Amr b. Sharid reported his father as saying:",
            "english_text": "One day when I rode behind Allah's Messenger (ﷺ), he said (to me): Do you remember any poetry of Umayya b. Abu Salt. I said: Yes. He said: Then go on. I recited a couplet, and he said: Go on. Then I again recited a couplet and he said: Go on. I recited one hundred couplets (of his poetry). This hadith has been reported on the authority of Sharid through another chain of transmitters but with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 5827,
            "title": "Sahih Muslim 2255 c",
            "narrator": "`Amr b. Sharid reported on the authority of his father that Allah's Messenger (ﷺ) asked him to recite poetry, the rest of the hadith is the same, but with this addition:",
            "english_text": "\"He (that is Umayya b. Abu Salt) was about to become a Muslim\", and in the hadith transmitted on the authority of Ibn Mahdi (the words are) \"He was almost a Muslim in his poetry.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 5828,
            "title": "Sahih Muslim 2256 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid: \"Behold! apart from Allah everything is vain.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 5829,
            "title": "Sahih Muslim 2256 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The truest word uttered by a poet is this verse of Labid: \"Behold! apart from Allah everything is vain,\" and Umayya b. Abu Salt was almost a Muslim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 5830,
            "title": "Sahih Muslim 2256 c",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The truest verse recited by a poet is: \"Behold! apart from Allah everything is vain,\" and Ibn Abu Salt was almost a Muslim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 5831,
            "title": "Sahih Muslim 2256 d",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "The truest couplet recited by a poet is: \"Behold! apart from Allah everything is vain,\" and he made no addition to it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 5832,
            "title": "Sahih Muslim 2256 e",
            "narrator": "Abu Huraira reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) as saying: The truest word which the poet stated is the word of Labid: \"Behold! apart from Allah everything is vain.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 5833,
            "title": "Sahih Muslim 2257",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "It is better for a man's belly to be stuffed with pus which corrodes it than to stuff (one's mind) with frivolous poetry. Abu Bakr has reported it with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 5834,
            "title": "Sahih Muslim 2258",
            "narrator": "Sa`d reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "It is better for the belly of any one of you to be stuffed with pus rather than to stuff (one's mind) with poetry.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 5835,
            "title": "Sahih Muslim 2259",
            "narrator": "Abu Sa`id Al-Khudri reported:",
            "english_text": "We were going with Allah's Messenger (ﷺ). As we reached the place (known as) `Arj there met (us) a poet who had been reciting poetry. Thereupon Allah's Messenger (ﷺ) said: Catch the satan or detain the satan, for filling the belly of a man with pus is better than stuffing his brain with poetry.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 5836,
            "title": "Sahih Muslim 2260",
            "narrator": "Buraida reported on the authority of his father that Allah's Apostle (ﷺ) said:",
            "english_text": "He who played Nardashir (a game similar to backgammon) is like one who dyed his hand with the flesh and blood of swine.",
            "grade": "none"
        }
    ]
}