{
    "chapterNum": 49,
    "english_title": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness",
    "totalHadiths_inChapter": 127,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 6731,
            "title": "Sahih Muslim 2675 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, thus stated:",
            "english_text": "I am near to the thought of My servant as he thinks about Me, and I am with him as he remembers Me. And if he remembers Me in his heart, I also remember him in My Heart, and if he remembers Me in assembly I remember him in assembly, better than his (remembrance), and if he draws near Me by the span of a palm, I draw near him by the cubit, and if he draws near Me by the cubit I draw near him by the space (covered by) two hands. And if he walks towards Me, I rush towards him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 6732,
            "title": "Sahih Muslim 2675 b",
            "narrator": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but there is no mention of these words:",
            "english_text": "\" He draws near Me by the space of a hand, I draw near him by the space (covered) by two hands.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 6733,
            "title": "Sahih Muslim 2675 c",
            "narrator": "Hammam b. Munabbih reported so many ahadith from Abu Huraira and one out of them is this that Allah's Messenger (ﷺ) said that Allah thus stated:",
            "english_text": "When My servant draws close to me by the span of a palm, I draw close to him by the space of a cubit, and when he draws close to Me by the space of a cubit, I draw close to him by the space (covered) by two hands, and when he draws close to Me by the space (covered by) two hands, I go in hurry towards him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 6734,
            "title": "Sahih Muslim 2676",
            "narrator": "Abu Huraira reported that Allah's Messenger (ﷺ) was travelling along the path leading to Mecca that he happened to pass by a mountain called Jumdan. He said:",
            "english_text": "Proceed on, it is Jumdan, Mufarradun have gone ahead. They (the Companions of the Holy Prophet) said: Allah's Messenger, who are Mufarradun? He said: They are those males and females who remember Allah much.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 6735,
            "title": "Sahih Muslim 2677 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "There are ninety-nine names of Allah; he who commits them to memory would get into Paradise. Verily, Allah is Odd (He is one, and it is an odd number) and He loves odd number. And in the narration of Ibn 'Umar (the words are):\" He who enumerated them.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 6736,
            "title": "Sahih Muslim 2677 b",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Verily, there are ninety-nine names for Allah, i. e. hundred excepting one. He who enumerates them would get into Paradise. And Hammam has made this addition on the authority of Abu Huraira who reported it from Allah's Apostle (ﷺ) that he said:\" He is Odd (one) and loves odd number.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 6737,
            "title": "Sahih Muslim 2678",
            "narrator": "Anas reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When one of you makes supplication, he should supplicate with a will and should not say: O Allah, confer upon me if Thou likest, for there is none to coerce Allah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 6738,
            "title": "Sahih Muslim 2679 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When one of you makes a supplication (to his Lord) one should not say: O Allah, grant me pardon, if Thou so likest, but one should beg one's (Lord) with a will and full devotion, for there is nothing so great in the eye of Allah which He cannot grant.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 6739,
            "title": "Sahih Muslim 2679 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should say to Allah (like this): O Allah, grant me mercy, if thou so likest. The supplication (of his) should (be permeated with) conviction (that it would be accepted by the Lord), for Allah is the Doer of (everything) He likes to do, and there is none to force Him (to do or not to do this or that).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 6740,
            "title": "Sahih Muslim 2680 a",
            "narrator": "Anas (b. Malik) reported Allah's Messenger (ﷺ) as saying. None of you should make a request for death because of the trouble in which he is involved, but if there is no other help to it, then say:",
            "english_text": "O Allah, keep me alive as long as there is goodness in life for me and bring death to me when there is goodness in death for me.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 6741,
            "title": "Sahih Muslim 2680 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Anas through another chain of transmitters, but with a small variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 6742,
            "title": "Sahih Muslim 2680 c",
            "narrator": "Nadr b. Anas reported, as when Anas was alive, that he said:",
            "english_text": "Had Allah's Messenger (ﷺ) not stated this..\" None should make a request for death,\" I would have definitely done that.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 6743,
            "title": "Sahih Muslim 2681 a",
            "narrator": "Abu Hazim reported:",
            "english_text": "I visited Khabbab who had seven cauteries on his stomach and he said: Had Allah's Messenger (ﷺ) not forbidden us to call for death, I would have done so.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 6744,
            "title": "Sahih Muslim 2681 b",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Isma'il through other chains of narrators.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 6745,
            "title": "Sahih Muslim 2682",
            "narrator": "Hammam b. Munabbih said:",
            "english_text": "Abu Huraira narrated to us ahadith from Allah's Messenger (ﷺ) and out of these one is that Allah's Messenger (ﷺ) said: None amongst you should make a request for death, and do not call for it before it comes, for when any one of you dies, he ceases (to do good) deeds and the life of a believer is not prolonged but for goodness.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 6746,
            "title": "Sahih Muslim 2683 a",
            "narrator": "Ubida b. Samit reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who loves to meet Allah, Allah also loves to meet him, and he who dislikes to meet Allah, Allah also abhors to meet him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 6747,
            "title": "Sahih Muslim 2683 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of 'Ubada b. Samit through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 6748,
            "title": "Sahih Muslim 2684 a",
            "narrator": "A'isha reported that Allah's Messenger (ﷺ) said:",
            "english_text": "He who loves to meet Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I ('A'isha) said: Allah's Apostle, so far as the feeling of aversion against death is concerned, we all have this feeling. Thereupon he (the Holy Prophet) said: It is not that (which you construe), but (this) that when a believer (at the time of death) is given the glad tidings of the mercy of Allah, His Pleasure, and of Paradise, he loves to meet Allah, and Allah also loves to meet him, and when an unbeliever is given the news of the torment at the Hand of Allah, and Hardship to be imposed by Him, he dislikes to meet Allah and Allah also abhors to meet him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 6749,
            "title": "Sahih Muslim 2684 b",
            "narrator": "",
            "english_text": "This hadith has been reported on the authority of Qatida with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 6750,
            "title": "Sahih Muslim 2684 c",
            "narrator": "'A'isha reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who loves to meet Allah, Allah also loves to meet him, and who dislikes to meet Allah, Allah abhors to meet him. There is death before (one is able to) meet Allah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 6751,
            "title": "Sahih Muslim 2684 d",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of A'isha through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 6752,
            "title": "Sahih Muslim 2685 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who loves meeting Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I (Shuraih b. Hani, one of the narrators) came to A'isha and said to her: Mother of the faithful, I heard Abu Huraira narrate from Allah's Messenger (ﷺ) which, if it is actually so, is a destruction to us. Thereupon she said: Those are in fact ruined who are ruined at the words of Allah's Messenger (ﷺ). What are (the words which in your opinion would cause your destruction)? He said that Allah's Messenger (ﷺ) had stated: He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah too abhors to meet him, and there is none amongst us who dons not hate death. Thereupon she said: Allah's Messenger (ﷺ) has in fact stated this, but it does not mean what you construe, but it implies (the time) when one loses the lustre of the eye, and there is rattling in the throat, shudder in the body and convulsion in fingers (at the time of death). (It is about this time) that it has been said: He who loves to meet Allah, Allah would love to meet him, and he who dislikes to meet Allah, Allah would abhor to meet him",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 6753,
            "title": "Sahih Muslim 2685 b",
            "narrator": "",
            "english_text": "This hadith has been reported on the authority of Mutarrif with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 6754,
            "title": "Sahih Muslim 2686",
            "narrator": "Abu Musa reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 6755,
            "title": "Sahih Muslim 2675 d",
            "narrator": "Abu Huraira reported Allah's Messenger (may peace be upon him as saying that Allah thus stated:",
            "english_text": "I live in the thought of My servant as he thinks of Me and with him as he calls Me.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 6756,
            "title": "Sahih Muslim 2675 e",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying that Allah, the Exalted and Glorious, said:",
            "english_text": "When My servant draws close to Me by the span of a palm, I draw close to him by the cubit and when he draws close to Me by the cubit, I draw close to him by the space (covered) by two armspans, and when he comes to me walking, I go in a hurry towards him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 6757,
            "title": "Sahih Muslim 2675 f",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Mu'tamar from his father with the same chain of transmitters, with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 6758,
            "title": "Sahih Muslim 2675 g",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, thus stated:",
            "english_text": "I live in the thought of My servant as he thinks about Me, and I am with him, as he remembers Me. And if he remembers Me in his heart, I also remember him in My Heart, and if he remembers Me in assembly I remember him in the assembly, better than he (does that), and if he draws near Me by the span of a palm I draw near him by the cubit, and if he draws near Me by the cubit I draw near him by the space (covered by) two hands. And if he walks towards Me, I rush towards him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 6759,
            "title": "Sahih Muslim 2687 a",
            "narrator": "Abu Dharr reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, stated:",
            "english_text": "\" He who comes with goodness, there are in store for him ten like those and even more than those: 'And he who comes with vice, ' it is only for that that he is called to account. I even forgive him (as I like) and he who draws close to Me by the span of a palm I draw close to him by the cubit, and he who draws close to Me by the cubit I draw close to him by the space (covered) by two hands, and he who walks towards Me I rush towards him, and he who meets Me in the state that his sins fill the earth, but not associating anything with Me, I would meet Him with the same (vastness) of pardon (on My behalf).\" This hadith has been transmitted on the authority of Waki'.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 6760,
            "title": "Sahih Muslim 2687 b",
            "narrator": "A hadith like this has been transmitted on the authority of A'mash with the same chain of transmitters and he (further) said:",
            "english_text": "There is for him ten like that (the good he performed) or more than that.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 6761,
            "title": "Sahih Muslim 2688 a",
            "narrator": "Anas reported that Allah's Messenger (ﷺ) visited a person from amongst the Muslims in order to inquire (about his health) who had grown feeble like the chicken. Allah's Messenger (ﷺ) said:",
            "english_text": "Did you supplicate for anything or beg of Him about that? He said: Yes. I used to utter (these words): Impose punishment upon me earlier in this world, what Thou art going to impose upon me in the Hereafter. Thereupon Allah's Messenger (ﷺ) said: Hallowed be Allah, you have neither the power nor forbearance to take upon yourself (the burden of His Punishment). Why did you not say this: O Allah, grant us good in the world and good in the Hereafter, and save us from the torment of Fire. He (the Holy Prophet) made this supplication (for him) and he was all right.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 6762,
            "title": "Sahih Muslim 2688 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Humaid with the same chain of transmitters, but with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 6763,
            "title": "Sahih Muslim 2688 c",
            "narrator": "Anas reported that Allah's Messenger (ﷺ) visited a person from amongst his Companions who had grown as feeble as the chicken. The rest of the hadith is the same, but with this variation that he (the Holy Prophet) said:",
            "english_text": "You have not power enough to undergo the torment imposed by Allah. And there is no mention of: He supplicated Allah for him and He cured him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 6764,
            "title": "Sahih Muslim 2688 d",
            "narrator": "",
            "english_text": "This hadith had been transmitted on the authority of Anas through another chain of narrators.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 6765,
            "title": "Sahih Muslim 2689",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying Allah has mobile (squads) of angels, who have no other work (to attend to but) to follow the assemblies of Dhikr and when they find such assemblies in which there is Dhikr (of Allah) they sit in them and some of them surround the others with their wings till the space between them and the sky of the world is fully covered, and when they disperse (after the assembly of Dhikr is adjourned) they go upward to the heaven and Allah, the Exalted and Glorious, asks them although He is best informed about them:",
            "english_text": "Where have you come from? They say: We come from Thine servants upon the earth who had been glorifying Thee (reciting Subhan Allah), uttering Thine Greatness (saying Allah o-Akbar) and uttering Thine Oneness (La ilaha ill Allah) and praising Thee (uttering al-Hamdu Lillah) and begging of Thee. Be would say: What do they beg of Me? They would say: They beg of Thee the Paradise of Thine. He (God) would say: Have they seen My Paradise? They said: No, our Lord. He would say: (What it would be then) if they were to see Mine Paradise? They (the angels) said: They seek Thine protection. He (the Lord) would say: Against what do they seek protection of Mine? They (the angels) would say: Our Lord, from the Hell-Fire. He (the Lord) would say: Have they seen My Fire? They would say: No. He (the Lord) would say: What it would be if they were to see My Fire? They would say: They beg of Thee forgiveness. He would say: I grant pardon to them, and confer upon them what they ask for and grant them protection against which they seek protection. They (the angels) would again say: Our Lord, there is one amongst them such and such simple servant who happened to pass by (that assembly) and sat there along with them (who had been participating in that assembly). He (the Lord) would say: I also grant him pardon, for they are a people the seat-fellows of whom are in no way unfortunate.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 6766,
            "title": "Sahih Muslim 2690 a",
            "narrator": "Qatada asked Anas which Supplication Allah's Apostle (ﷺ) frequently made. He said:",
            "english_text": "The supplication that he (the Prophet made very frequently is this:\" O Allah, grant us the good in this world and the good in the Hereafter and save us from the torment of Hell-Fire.\" He (Qatada) said that whenever Anas had to supplicate he made this very supplication, and whenever he (intended) to make another supplication he (inserted) this very supplication in that.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 6767,
            "title": "Sahih Muslim 2690 b",
            "narrator": "Anas reported that Allah's Messenger (ﷺ) used to supplicate (in these words):",
            "english_text": "\" Our Lord, grant us the good in this world and the good in the Hereafter and save us from the torment of Hell Fire.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 6768,
            "title": "Sahih Muslim 2691",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who uttered these words:\" There is no god but Allah, the One, having no partner with Him. Sovereignty belongs to Him and all the praise is due to Him, and He is Potent over everything\" one hundred times every day there is a reward of emancipating ten slaves for him, and there are recorded hundred virtues to his credit, and hundred vices are blotted out from his scroll, and that is a safeguard for him against the Satan on that day till evening and no one brings anything more excellent than this, except one who has done more than this (who utters these words more than one hundred times and does more good acts) and he who utters:\" Hallowed be Allah, and all praise is due to Him,\" one hundred times a day, his sins are obliterated even if they are equal to the extent of the foam of the ocean.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 6769,
            "title": "Sahih Muslim 2692",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who recites in the morning and in the evening (these words):\" Hallowed be Allah and all praise is due to Him\" one hundred times, he would not bring on the Day of Resurrection anything excellent than this except one who utters these words or utters more than these words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 6770,
            "title": "Sahih Muslim 2693",
            "narrator": "'Amr b. Maimun reported:",
            "english_text": "He who uttered:\" There is no god but Allah, the One, having no partner with Him, His is the Sovereignty and all praise is due to Him and He is Potent over everything\" ten times, he is like one who emancipated four slaves from the progeny of Isma'il. Rabi' b. Khuthaim narrated a hadith like this. Sha'bi reported: I said to Rabi': From whom did you hear it? He said: From 'Amr b. Maimun. I came to 'Amr b. Maimun and said to him: From whom did you hear this hadith? He said: from Ibn Abi Laila. I came to Ibn Abi Laila and said to him: From whom did you hear this hadith? He said: From Abu Ayyub Ansari, who narrated from Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 6771,
            "title": "Sahih Muslim 2694",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Two are the expressions which are light on the tongue, but heavy in scale, dear to the Compassionate One:\" Hallowed be Allah and praise is due to Him\" ;\" Hallowed be Allah, the Great.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 6772,
            "title": "Sahih Muslim 2695",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The uttering of (these words):\" Hallowed be Allah; all praise is due to Allah, there is no god but Allah and Allah is the Greatest,\" is dearer to me than anything over which the sun rises.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 6773,
            "title": "Sahih Muslim 2696",
            "narrator": "Mu'sab b. Sa'd reported on the authority of his father that a desert Arab came to Allah's Messenger (ﷺ) and said to him:",
            "english_text": "Teach me the words which I should (often) utter. He said: Utter,\" There is no god but Allah, the One, having no partner with Him. Allah is the Greatest of the great and all praise is due to Him. Hallowed be Allah, the Lord of the worlds, there is no Might and Power but that of Allah, the All-Powerful and the Wise.\" He (that desert Arab) said: These all (glorify) my Lord. But what about me? Thereupon he (the Holy Prophet) said: You should say:\" O Allah, grant me pardon, have mercy upon me, direct me to righteousness and provide me sustenance.\" Musa (one of the narrators) said: I think he also said:\" Grant me safety.\" But I cannot say for certain whether he said this or not. Ibn Abi Shaiba has not made a mention of the words of Musa in his narration.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 6774,
            "title": "Sahih Muslim 2697 a",
            "narrator": "Abu Malik Ashaja'i reported on the authority of his father that whenever a person embraced Islam, Allah's Messenger (ﷺ) instructed him to recilte:",
            "english_text": "\" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness and provide me sustenance.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 6775,
            "title": "Sahih Muslim 2697 b",
            "narrator": "Abu Malik reported on the authority of his father that when a person embraced Islam, Allah's Messenger (ﷺ) used to teach him how to observe prayer and then commanded him to supplicate in these words:",
            "english_text": "\" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness, grant me protection and provide me sustenance.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 6776,
            "title": "Sahih Muslim 2697 c",
            "narrator": "Abu Malik reported on the authority Of his father that he heard Allah's Messenger (ﷺ) as saying to the person who bad come to him and asked him as to how he should beg his Lord, that he should utter these words:",
            "english_text": "\" O Allah, grant me pardon, have mercy upon me, protect me, provide me sustenance,\" and he collected his fingers together except his thumb and said: It is in these words (that there is supplication) which sums up for you (the good) of this world and that of the Hereafter.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 6777,
            "title": "Sahih Muslim 2698",
            "narrator": "Mus'ab b. Sa'd reported that his father told him that he had been in the company of Allah's Messenger (ﷺ) that he said:",
            "english_text": "Is one amongst you powerless to get one thousand virtues every day. Amongst those who had been sitting there, one asked: How one amongst us can get one thousand virtues every day? He said: Recite:\" Hallowed be Allah\" one hundred times for (by reciting them) one thousand virtues are recorded (to your credit) and one tbousand vices are blotted out.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 6778,
            "title": "Sahih Muslim 2699 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who alleviates the suffering of a brother out of the sufferings of the world, Allah would alleviate his suffering from the sufferings of the Day of Resurrection, and he who finds relief for one who is hard-pressed, Allah would make things easy for him in the Hereafter, and he who conceals (the faults) of a Muslim, Allah would conceal his faults in the world and in the Hereafter. Allah is at the back of a servant so long as the servant is at the back of his brother, and he who treads the path in search of knowledge, Allah would make that path easy, leading to Paradise for him and those persons who assemble in the house among the houses of Allah (mosques) and recite the Book of Allah and they learn and teach the Qur'an (among themselves) there would descend upon them tranquility and mercy would cover them and the angels would surround them and Allah mentions them in the presence of those near Him, and he who is slow-paced in doing good deeds, his (high) lineage does not make him go ahead.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 6779,
            "title": "Sahih Muslim 2699 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 6780,
            "title": "Sahih Muslim 2700 a, b",
            "narrator": "Agharr Abi Muslim reported:",
            "english_text": "I bear witness to the fact that both Abu Huraira and Abu Sa'id Khudri were present when Allah's Messenger may peace be upon him) said: The people do not sit but they are surrounded by angels and covered by Mercy, and there descends upon them tranquillity as they remember Allah, and Allah makes a mention of them to those who are near Him. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 6781,
            "title": "Sahih Muslim 2701",
            "narrator": "Abu Sa'id Khudri reported that Mu'awiya went to a circle in the mosque and said:",
            "english_text": "What makes you sit here? They said: We are sitting here in order to remember Allah. He said: I adjure you by Allah (to tell me whether you are sitting here for this very purpose)? They said: By Allah, we are sitting here for this very purpose. Thereupon, he said: I have not demanded you to take an oath, because of any allegation against you and none of my rank in the eye of Allah's Messenger (ﷺ) is the narrator of so few ahadith as I am. The fact is that Allah's Messenger (ﷺ) went out to the circle of his Companions and said: What makes you sit? They said: We are sitting here in order to remember Allah and to praise Him for He guided us to the path of Islam and He conferred favours upon us. Thereupon he adjured by Allah and asked if that only was the purpose of their sitting there. They said: By Allah, we are not sitting here but for this very purpose, whereupon he (the Messenger) said: I am not asking you to take an oath because of any allegation against you but for the fact that Gabriel came to me and he informed me that Allah, the Exalted and Glorious, was talking to the angels about your magnificence.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 6782,
            "title": "Sahih Muslim 2702 a",
            "narrator": "Al-Agharr al-Muzani, who was one amongst the Companions (of the Holy Prophet) reported that Allah's Messenger (ﷺ) said:",
            "english_text": "There is (at times) some sort of shade upon my heart, and I seek forgiveness from Allah a hundred times a day.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 6783,
            "title": "Sahih Muslim 2702 b",
            "narrator": "Al-Agharr al-Muzani who was from amongst the Companions of Allah's Apostle (ﷺ) reported that Ibn 'Umar stated to him that Allah's Messenger (may peace 'be upon him) said:",
            "english_text": "O people, seek repentance from Allah. Verily, I seek repentance from Him a hundred times a day.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 6784,
            "title": "Sahih Muslim 2702 c",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 6785,
            "title": "Sahih Muslim 2703",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:",
            "english_text": "He who seeks repentance (from the Lord) before the rising of the sun from the west (before the Day of Resurrection), Allah turns to him with Mercy.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 6786,
            "title": "Sahih Muslim 2704 a",
            "narrator": "Abu Musa reported:",
            "english_text": "We were along with Allah's Apostle (ﷺ) on a journey when the people began to pronounce \"Allahu Akbar\" in a loud voice. Thereupon Allah's Messenger (ﷺ) said: O people, show mercy to yourselves for you are not calling One who is deaf or absent. Verily, you are calling One who is All-Hearing (and) Near to you and is with you. Abu Musa said that he had been behind him (the Prophet) and reciting: \"There is neither might nor power but that of Allah.\" He (the Prophet), while addressing 'Abdullah b. Qais, said: Should I not direct you to a treasure from amongst the treasures of Paradise? I ('Abdullah b. Qais) said: Allah's Messenger, do it, of course. Thereupon he (the Prophet) said: Then recite: \"There is no might and no power but that of Allah.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 6787,
            "title": "Sahih Muslim 2704 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of 'Asim with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 6788,
            "title": "Sahih Muslim 2704 c",
            "narrator": "Abu Musa reported that he (and his other companions) were climbing upon the hillock along with Allah's Messenger (ﷺ) and when any person climbed up, he pronounced (loudly):",
            "english_text": "\" There is no god but Allah, Allah is the Greatest.\" Thereupon Allah's Apostle (ﷺ) said: Verily, you are not supplicating One Who is deaf or absent. He said: Abu Musa or Abdullah b Qais, should I not direct you to the words (which form) the treasure of Paradise? I said: Allah's Messenger, what are these? He said:\" There is no might and no power but that of Allah.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 6789,
            "title": "Sahih Muslim 2704 d",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Abu Musa with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 6790,
            "title": "Sahih Muslim 2704 e",
            "narrator": "Abu Musa reported:",
            "english_text": "We were along with Allah's Apostle (ﷺ) on a journey; the rest of the hadith is the same as transmitted by A'sim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 6791,
            "title": "Sahih Muslim 2704 f",
            "narrator": "Abu Musa, reported. We were along with Allah's Messenger (ﷺ) in an expedition. The rest of the hadith is the same (and there is an addi- tion of these words in that):",
            "english_text": "\" He (the Holy Prophet) said: He Whom you are sup- plicating is nearer to every one of you than the neck of his camel.\" And there is no mention of these words:\" There is no might and no power but that of Allah.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 6792,
            "title": "Sahih Muslim 2704 g",
            "narrator": "Abu Musa Ash'ari reported that Allah's Messenger (ﷺ) said to him:",
            "english_text": "Should I not direct you to the words from the treasures of Paradise, or he said: Like a treasure from the treasures of Paradise? I said: Of course, do that. Thereupon he said:\" There is no might and no power but that of Allah.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 6793,
            "title": "Sahih Muslim 2705 a",
            "narrator": "Abu Bakr reported that he said to Allah's Messenger (ﷺ):",
            "english_text": "Teach me a supplication which I should recite in my prayer. Thereupon he (the Holy Prophet) said: Recite:\" O Allah, I have done great wrong to myself.\" According to Qutaiba (the words were: ) much (wrong) -there is none to forgive the sins but Thou only, say:\" Grant me pardon from Thyself, have mercy upon me for Thou art much Forgiving and Compassionate.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 6794,
            "title": "Sahih Muslim 2705 b",
            "narrator": "This hadith has been transmitted on the authority of 'Amr b. al-'As that Abu Bakr Siddiq said to Allah's Messenger (ﷺ) Allah's Messenger, teach me a supplication which I should make in my prayer and in my house. The rest of the hadith is the same except with this variation that he said:",
            "english_text": "Much wrong (Zulman Kathira).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 6795,
            "title": "Sahih Muslim 589 b",
            "narrator": "'A'isha reported that Allah's Messenger (ﷺ) used to make these supplications:",
            "english_text": "\" O Allah, I seek refuge in Thee from the trial of Hell-Fire; and from the torment of Hell-Fire; and from the trial of the grave and torment of the grave; and from the evil of the trial of the affluence and from the evil of the trial of poverty and I seek refuge in Thee from the evil of the turmoil of the Dajjal. O Allah, wash away my sins with snow and hail water, purify my heart from the sins as is purified the white garment from the dirt, and keep away at a distance the sins from me as yawns the distance between the East and the West; O Allah, I seek refuge in Thee from sloth, from senility, from sin, and from debt.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 6796,
            "title": "Sahih Muslim 589 c",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 6797,
            "title": "Sahih Muslim 2706 a",
            "narrator": "Anas b. Malik reported that Allah's Messenger (ﷺ) used to say:",
            "english_text": "\" O Allah, I seek refuge in Thee from incapacity, from indolence, from cowardice, from senility, from miserliness, and I seek refuge in Thee from the torment of the grave and from trial of the life and death.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 6798,
            "title": "Sahih Muslim 2706 b",
            "narrator": "Anas reported from Allah's Messenger (ﷺ) (this suppli- cation) but with this variation that these words are not found in that supplication:",
            "english_text": "\" From the trial of life and death.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 6799,
            "title": "Sahih Muslim 2706 c",
            "narrator": "",
            "english_text": "Anas b. Malik reported that Allah's Apostle (ﷺ) used to seek refuge in Allah from such things as mentioned in the above-mentioned hadith and from 'miserliness\" too.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 6800,
            "title": "Sahih Muslim 2706 d",
            "narrator": "Anas reported that Allah's Messenger (may peace he upon him) wed to make this supplication:",
            "english_text": "\" O Allah, I seek refuge in Thee from miserliness, from sloth and from decrepitude.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 6801,
            "title": "Sahih Muslim 2707",
            "narrator": "It was narrated from Abu Huraira that:",
            "english_text": "Allah's Apostle (ﷺ) used to seek refuge (in Allah) from the evil of what has been decreed, from misery, from the mockery of (triumphant) enemies, and from severe calamity. \n\n`Amr (one of the narrators) said in his narration: \"Sufyan said: 'I fear I may have added one of them (the phrases).\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 6802,
            "title": "Sahih Muslim 2708 a",
            "narrator": "Khaula bint Hakim Sulamiyya reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) as saying: When anyone lands at a place, and then says:\" I seek refuge in the Perfect Word of Allah from the evil of what He has created,\" nothing would harm him until he marches from that stopping place.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 6803,
            "title": "Sahih Muslim 2708 b, 2709 a",
            "narrator": "Khaula bint Hakim Sulamiyya reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) as saying: When any one of you stays at a place, he should say:\" I seek refuge in the Perfect Word of Allah from the evil of that He created.\" Nothing would then do him any harm until he moves from that place. Abu Huraira reported that a person came to Allah's Messenger (ﷺ) and said:\" Allah's Messenger, I was stung by a scorpion during the night. Thereupon he said: Had you recited these words in the evening:\" I seek refuge in the Perfect Word of Allah from the evil of what He created,\" it would not have done any harm to you.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 6804,
            "title": "Sahih Muslim 2709 b",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 75,
            "hadithNum_inBook": 6805,
            "title": "Sahih Muslim 2710 a",
            "narrator": "Al-Bara' b. 'Azib reported that Allah's, Messenger (may peace be upon said:",
            "english_text": "When you go to bed, perform ablution as is done for prayer; then lie down pn the right side and recite:\" O Allah, I turn my face towards Thee and entrust my affair to Thee. I retreat unto Thee for protection with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship) but Thou only. I affirm my faith in Thine books which Thou revealed and in Thine Apostles whom Thou sent.\" Make this as the last word of yours (when you go to sleep) and in case you die during that night, you would die upon Fitra (upon Islam). And as I repeated these words in order to commit them to memory, I said:\" I affirm my faith in Thy Messenger (Rasul) whom Thou sent.\" He said: Say:\" I affirm my faith in the Apostle (Nabi) whom Thou sent.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 76,
            "hadithNum_inBook": 6806,
            "title": "Sahih Muslim 2710 b",
            "narrator": "This hadith has been transmitted on the authority of al-Bara' b. 'Azib with a slight variation of wording and there is this addition in the hadith transmitted on the authority of Husain:",
            "english_text": "\" In case you get up in the morning, you will get up with bliss.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 77,
            "hadithNum_inBook": 6807,
            "title": "Sahih Muslim 2710 c",
            "narrator": "Al-Bara' b. 'Azib reported that Allah's Messenger (in may peace be upon him) commanded a person (in these words):",
            "english_text": "When you go to bed during night, you should say:\" O Allah, I surrender myself to Thee and entrust my affair to Thee, with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship but Thou). I affirm my faith in the Book which Thou revealed and in the Messengers whom Thou sent.\" If you die in this state you would die on Fitra, and Ibn Bashshdr did not make a mention of\" night\" in this hadith.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 78,
            "hadithNum_inBook": 6808,
            "title": "Sahih Muslim 2710 d",
            "narrator": "This hadith has been transmitted on the authority of al-Bara' b. 'Azib that Allah's Messenger (ﷺ) said to a person:",
            "english_text": "O, so and so, as you go to your bed; the rest of the hadith is the same but with this variation of wording that he said:\" Thine Apostle whom Thou sent.\" If you die that night you would die on Fitra and if you get up in the morning you would get up with a bliss.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 79,
            "hadithNum_inBook": 6809,
            "title": "Sahih Muslim 2710 e",
            "narrator": "This hadith has been transmitted on the authority of al-Bara' b. 'Azib that Allah's Messenger (ﷺ) commanded a person (in these words) and there is no mention of this:",
            "english_text": "\" if you get up in the morning you would get up with a bliss.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 80,
            "hadithNum_inBook": 6810,
            "title": "Sahih Muslim 2711",
            "narrator": "Al-Bara' reported that whenever Allah's Messenger (ﷺ) went to bed, he said:",
            "english_text": "\" O Allah, it is with Thine Name that I live and it is with Thine Name that I die.\" And when he got up he used to say:\" Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 81,
            "hadithNum_inBook": 6811,
            "title": "Sahih Muslim 2712",
            "narrator": "Abdullah b. 'Umar commanded a person that as he went to bed, he should say:",
            "english_text": "\" O Allah, Thou created my being and it is for Thee to take it to its ultimate goal. And its death and life is due to Thee, and if Thou givest it life, safeguard it; and if Thou bringst death, grant it pardon. O Allah, I beg of Thee safety.\" A person said to him: Did you hear it from Umar? Thereupon he said: (I have heard from one) who is better than Umar, viz. from Allah's Messenger (ﷺ). Ibn Nafi, reported this on the authority of Abdullah b. Harith but he did not make mention of this\" that he heard it himself\".",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 82,
            "hadithNum_inBook": 6812,
            "title": "Sahih Muslim 2713 a",
            "narrator": "Suhail reported that Abu Salih used to command us (in these words):",
            "english_text": "When any one of you intends to go to sleep, he should lie on the bed on his right side and then say:\" O Allah. the Lord of the Heavens and the Lord of the Earth and Lord of the Magnificent Throne, our Lord, and the Lord of evervthina, the Splitter of the grain of corn and the datestone (or fruit kernal), the Revealer of Torah and Injil (Bible) and Criterion (the Holy Qur'an), I seek refuge in Thee from the evil of every- thing Thou art to sieze by the forelock (Thou hast perfect control over it). O Allah, Thou art the First, there is naught before Thee, and Thou art the Last and there is naught after Thee, and Thou art Evident and there is nothing above Thee, and Thou art Innermost and there is nothing beyond Thee. Remove the burden of debt from us and relieve us from want.\" Abu Salih used to narrate it from Abu Huraira who narrated it from Allah's Apostle (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 83,
            "hadithNum_inBook": 6813,
            "title": "Sahih Muslim 2713 b",
            "narrator": "Abu Huraira reported that Allah's Messenger (ﷺ) used to command us that as we go to our bedo, we should utter the words (as mention- ed above) and he also said (these words):",
            "english_text": "\" From the evil of every animal, Thou hast hold upon its forelock (Thou bast full control over it).\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 84,
            "hadithNum_inBook": 6814,
            "title": "Sahih Muslim 2713 c",
            "narrator": "Abu Huraira reported that Fatima (the daughter of the Holy Prophet) came to Allah's Apostle (ﷺ) and asked for a servant. He said to her:",
            "english_text": "Say:\" O Allah, the Lord of the seven heavens\" ; the rest of the hadith is the same.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 85,
            "hadithNum_inBook": 6815,
            "title": "Sahih Muslim 2714 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:",
            "english_text": "When any one of you goes to bed, he should take hold of the hem of his lower garment and then should clean (his bed) with the help of that and then should recite the name of Allah for he himself does tiot know what he left behind him on his bed, and when he intends to lie on bed, he should lie on his right side and utter these words:\" Hallowed be Allah, my Lord. It is with Thine (grace) that I place my side (upon the bed) and it is with Thee that I take it up (after sleep), and in case Thou withholdst my being (if thou causest me to die), then grant pardon to my being, and if Thou keepst (this process of breathing on), then protect it with that with which Thou protected Thine pious servants.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 86,
            "hadithNum_inBook": 6816,
            "title": "Sahih Muslim 2714 b",
            "narrator": "This hadith has been narrated on the authority of Ubaidullah b. Umar with the same chain of transmitters and he said:",
            "english_text": "Then utter:\" My Lord. with Thine name I place my side and if Thou keepest me alive have mercy upon myself\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 87,
            "hadithNum_inBook": 6817,
            "title": "Sahih Muslim 2715",
            "narrator": "Anas reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When you go to bed, say:\" Praise is due to Allah Who fed us, provided us drink, sufficed us and provided us with shelter, for many a people there is none to suffice and none to provide shelter.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 88,
            "hadithNum_inBook": 6818,
            "title": "Sahih Muslim 2716 a",
            "narrator": "Farwa' b. Naufal Ashja'i reported:",
            "english_text": "I asked: 'A'isha, in what words did Allah's Messenger (ﷺ) supplicate Allah? She said that he used to utter:\" I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 89,
            "hadithNum_inBook": 6819,
            "title": "Sahih Muslim 2716 b",
            "narrator": "Farwa' b. Naufal reported:",
            "english_text": "I asked 'A'isha about the supplication that Allah's Messenger (ﷺ) made. She said that he used to say:\" O Allah, I seek refuge in Thee from the evil of what I have done and from the evil of what I have not done.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 90,
            "hadithNum_inBook": 6820,
            "title": "Sahih Muslim 2716 c",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Muhammad b. ja'far through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 91,
            "hadithNum_inBook": 6821,
            "title": "Sahih Muslim 2716 d",
            "narrator": "Farwa' b. Naufal reported on the authority of 'A'isha that Allah's Mes- senger (ﷺ) used to supplicate (in these words):",
            "english_text": "\" O Allah, I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 92,
            "hadithNum_inBook": 6822,
            "title": "Sahih Muslim 2717",
            "narrator": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) used to say:",
            "english_text": "\" O Allah, it is unto Thee that I surrender myself. I affirm my faith in Thee and repose my trust in Thee and turn to Thee in repentance and with Thy help fought my adversaries. O Allah, I seek refuge in Thee with Thine Power; there is no god but Thou, lest Thou leadest me astray. Thou art ever-living that dieth not, while the Jinn and mankind die.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 93,
            "hadithNum_inBook": 6823,
            "title": "Sahih Muslim 2718",
            "narrator": "Abu Huraira reported that when Allah's Messenger (ﷺ) set out on a journey in the morning, he used to say:",
            "english_text": "\" A listener listened to our praising Allah (for) His goodly trial of us. Our Lord! acompany us, guard us and bestow upon us Thy grace. I am seeker of refuge in Allah from the Fire.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 94,
            "hadithNum_inBook": 6824,
            "title": "Sahih Muslim 2719 a",
            "narrator": "Abu Musa Ash'ari reported on the authority of his father that Allahs Apostle (ﷺ) used to supplicate in these words:",
            "english_text": "\" O Allah, forgive me my faults, my ignorance, my immoderation in my concerns. And Thou art better aware (of my affairs) than myself. O Allah, grant me forgiveness (of the faults which I committed) seriously or otherwise (and which I committed inadvertently and de- liberately. All these (failings) are in me. O Allah, grant me forgiveness from the fault which I did in haste or deferred, which I committed in privacy or in public and Thou art better aware of (them) than myself. Thou art the First and the Last and over all things Thou art Omnipotent.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 95,
            "hadithNum_inBook": 6825,
            "title": "Sahih Muslim 2719 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 96,
            "hadithNum_inBook": 6826,
            "title": "Sahih Muslim 2720",
            "narrator": "Abu Huraira reported that Allah's Messenger (ﷺ) used to supplicate (in these words):",
            "english_text": "\" O Allah, set right for me my religion which is the safeguard of my affairs. And set right for me the affairs of my world wherein is my living. And set right for me my Hereafter on which depends my after-life. And make the life for me (a source) of abundance for every good and make my death a source of comfort for me protecting me against every evil.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 97,
            "hadithNum_inBook": 6827,
            "title": "Sahih Muslim 2721 a",
            "narrator": "Abdullah reported that Allah's Messenger (ﷺ) used to supplicate (in these words):",
            "english_text": "\" O Allah. I beg of Thee the right guidance, safeguard against evils, chastity and freedom from want.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 98,
            "hadithNum_inBook": 6828,
            "title": "Sahih Muslim 2721 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abu Ishaq with the same chain of transmitters but with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 99,
            "hadithNum_inBook": 6829,
            "title": "Sahih Muslim 2722",
            "narrator": "Zaid b. Alqam reported:",
            "english_text": "I am not going to say anything but only that which Allah's Messenger (may peace be upgn him) used to say. He used to supplicate:\" O Allah, I seek refuge in Thee from incapacity, from sloth, from cowardice, from miserliness, decrepitude and from torment of the grave. O Allah, grant to my soul the sense of righteousness and purify it, for Thou art the Best Purifier thereof. Thou art the Protecting Friend thereof, and Guardian thereof. O Allah, I seek refuge in Thee from the knowledge which does not benefit, from the heart that does not entertain the fear (of Allah), from the soul that does not feel contented and the supplication that is not responded.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 100,
            "hadithNum_inBook": 6830,
            "title": "Sahih Muslim 2723 a",
            "narrator": "Abdullah b. Mas'ud reported that when it was evening Allah's Messenger (ﷺ) used to supplicate:",
            "english_text": "\" We entered upon evening and the whole Kingdom of Allah also entered upon evening and praise is due to Allah. There is no god but Allah, the One Who has no partner with Him.\" Hasan said that Zubaid reported to him that he memorised it from Ibrahim in these very words.\" His is the Sovereignty and Praise is due to Him, and He is Potent over everything. O Allah, I beg of Thee the good of this night and I seek refuge in Thee from the evil of this night and the evil which follows it. O Allah, I seek refuge in Thee from sloth, from the evil of vanity. O Allah, I seek refuge in Thee from torment in the Hell-Fire and from torment in the grave.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 101,
            "hadithNum_inBook": 6831,
            "title": "Sahih Muslim 2723 b",
            "narrator": "Abdullah reported that when it was evening Allah's Messenger (ﷺ) used to supplicate:",
            "english_text": "\" We have entered upon evening and so, too, the whole Kingdom of Allah has entered upon evening. Praise is due to Allah. There is no god but Allah, the One having no partner with Him.\" He (the narrator) said: I think that he also uttered (in this supplication these words):\" His is tne Sovercignty and to Him is praise due and He is Potent over everything. My Lord, I beg of Thee good that lies in this night and good that follows it and I seek refuge in Thee from the evil that lies in this night and from the evil of that which follows it. My Lord, I seek refuge in Thee from sloth, from the evil of vanity. My Lord, I seek refuge in Thee from torment of the Hell-Fire and from torment of the grave.\" And when it was morning he said like this:\" We entered upon morning and the whole Kingdom of Allah enter ed upon morning.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 102,
            "hadithNum_inBook": 6832,
            "title": "Sahih Muslim 2723 c",
            "narrator": "Abdullah reported that when it was evening Allah's Messenger (ﷺ) used to supplicate:",
            "english_text": "\" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 103,
            "hadithNum_inBook": 6833,
            "title": "Sahih Muslim 2724",
            "narrator": "This hadith has been transmitted on the authority of Abu Huraira that Allah's Messenge; (ﷺ) used to supplicate thus:",
            "english_text": "\" There is no god but Allah, the One Who conferred upon His armies the honour of victory and helped His servant rout the clans; there is nothing after that.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 104,
            "hadithNum_inBook": 6834,
            "title": "Sahih Muslim 2725 a",
            "narrator": "'Ali reported that Allah's Messenger (ﷺ) said to him:",
            "english_text": "Say,\" O Allah, direct me to the right path and make me adhere to the straight path,\" and when you make a mention of right guidance, keep in mind the right path and when you consider of the straight (path), keep in mind the straightness of the arrow.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 105,
            "hadithNum_inBook": 6835,
            "title": "Sahih Muslim 2725 b",
            "narrator": "This hadith has been narrated on the authority of 'Asim b. Kulaib with the same chain of transmitters that Allah's Messenger (ﷺ) said to me:",
            "english_text": "Say:\" O Allah, I beg of Thee righteousness and adhering to the straight path.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 106,
            "hadithNum_inBook": 6836,
            "title": "Sahih Muslim 2726 a",
            "narrator": "Juwairiya reported that Allah's Messenger (ﷺ) came out from (her apartment) in the morning as she was busy in observing her dawn prayer in her place of worship. He came back in the forenoon and she was still sitting there. He (the Holy Prophet) said to her:",
            "english_text": "You have been in the same seat since I left you. She said: Yes. Thereupon Allah's Apostle (ﷺ) said: I recited four words three times after I left you and if these are to be weighed against what you have recited since morning these would outweigh them and (these words) are:\" Hallowed be Allah and praise is due to Him according to the number of His creation and according to the pleasure of His Self and according to the weight of His Throne and according to the ink (used in recording) words (for His Praise).\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 107,
            "hadithNum_inBook": 6837,
            "title": "Sahih Muslim 2726 b",
            "narrator": "Juwairiya reported that Allah's Messenger (ﷺ) happened to pass by her as she was observing her dawn prayer; or after she had observed her dawn prayer. The rest of the hadith is the same but with this variation that he said:",
            "english_text": "\" Hallowed be Allah according to the number of His creation, hallowed be Allah according to the pleasure of His Self, hallowed be Allah according to the weight of His Throne, hallowed be Allah according to the ink used in recording His words.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 108,
            "hadithNum_inBook": 6838,
            "title": "Sahih Muslim 2727 a",
            "narrator": "It is reported on the authority of Ali that Fatima had corns in her hand because of working at the hand-mill. There had fallen to the lot of Allah's Apostle (ﷺ) some prisoners of war. She (Fatima) came to the Prophet (ﷺ) but she did not find him (in the house). She met A'isha and informed her (about her hardship). When Allah's Apostle (ﷺ) came, she (A'isha) informed him about the visit of Fatima. Allah's Messenger (ﷺ) came to them (Fatima and her family). They had gone to their beds. 'Ali further (reported):",
            "english_text": "We tried to stand up (as a mark of respect) but Allah's Messenger (ﷺ) said: Keep to your beds, and he sat amongst us and I felt the coldness of his feet upon my chest. He then said: May I not direct you to something better than what you have asked for? When you go to your bed, you should recite Takbir (Allah-o-Akbar) thirty-four times and Tasbih (Subhan Allah) thirty-three times and Tahmid (al-Hamdu li-Allah) thirty-three times, and that is better than the servant for you.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 109,
            "hadithNum_inBook": 6839,
            "title": "Sahih Muslim 2727 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but. with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 110,
            "hadithNum_inBook": 6840,
            "title": "Sahih Muslim 2727 c",
            "narrator": "This hadith has been transmitted on the authority of Ibn Abi Laili but with this addition:",
            "english_text": "\" Ali said: Ever since I heard this (supplication) from Allah's Apostle (ﷺ), I never abandoned it. It was said to him, Not even in the night of Siffin (battle of Siffin)? He sad: Yes, not even in the night of Siffin,\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 111,
            "hadithNum_inBook": 6841,
            "title": "Sahih Muslim 2728 a, b",
            "narrator": "Abu Huraira reported that Fatima came to Allah's Apostle (ﷺ) and asked for a servant and told him of the hardship of household work. He said:",
            "english_text": "You would not be able to get a servant from us. May I not direct you to what is better than the servant for you? Recite Subhaana Allah thirty-three times, al- Hamdu li-Allah thirty-three times and Allah-o-Akbar thirty-four times as you go to bed. This hadith has been narrated on the authority of Suhail with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 112,
            "hadithNum_inBook": 6842,
            "title": "Sahih Muslim 2729",
            "narrator": "",
            "english_text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing. When you listen to the crowing of the cock, ask Allah for His favour as it sees Angels and when you listen to the braying of the donkey, seek refuge in Allah from the Satan for it sees Satan.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 113,
            "hadithNum_inBook": 6843,
            "title": "Sahih Muslim 2730 a",
            "narrator": "Ibn 'Abbas reported that Allah's Apostle (ﷺ) used to supplicate during the time of trouble (in these words):",
            "english_text": "\" There is no god but Allah, the Great, the Tolerant, there is no god but Allah, the Lord of the Magnificent Throne There is no god but Allah, the Lord of the Heaven and the earth, the Lord of the Edifying Throne.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 114,
            "hadithNum_inBook": 6844,
            "title": "Sahih Muslim 2730 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 115,
            "hadithNum_inBook": 6845,
            "title": "Sahih Muslim 2730 c",
            "narrator": "Ibn Abbas reported that Allah's Messenger (ﷺ) used to supplicate (with these words) and he (uttered these words) at the time of trouble; the rest of the hadith is the same except with this difference that insted of saying:",
            "english_text": "\" The Lord of heaven and the earth,\" he said:\" The Lord of the heaven and that of the earth.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 116,
            "hadithNum_inBook": 6846,
            "title": "Sahih Muslim 2730 d",
            "narrator": "",
            "english_text": "Ibn 'Abbas reported this hadith through another chain of transmitters with a sliglit variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 117,
            "hadithNum_inBook": 6847,
            "title": "Sahih Muslim 2731 a",
            "narrator": "Abu Dharr reported that Allah's Messenger (ﷺ) was asked as to which words were the best. He said:",
            "english_text": "Those for which Allah made a choice for His Angels and His servants (and the words are):\" Hallowed be Allah and praise is due to Him.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 118,
            "hadithNum_inBook": 6848,
            "title": "Sahih Muslim 2731 b",
            "narrator": "Abu Dharr reported that Allah's Messenger (ﷺ) said:",
            "english_text": "Should I not inform you about the words liked most by Allah? I said: Allah's Mes- senger, do inform me about the words liked most by Allah. He said: Verily, the words liked most by Allah are:\" hallowed be Allah and praise is due to Him.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 119,
            "hadithNum_inBook": 6849,
            "title": "Sahih Muslim 2732 a",
            "narrator": "Abu Dharr reported that Allah's Messenger (ﷺ) said:",
            "english_text": "There is no believing servant who supplicates for his brother behind his back (in his absence) that the Angels do not say: The same be for you too.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 120,
            "hadithNum_inBook": 6850,
            "title": "Sahih Muslim 2732 b",
            "narrator": "Umm Darda' reported:",
            "english_text": "My husband reported that he heard Allah's Mes- senger (ﷺ) as saying: He who supplicates for his brother behind his back (in his absence), the Angel commissioned (for carrying supplication to his Lord) says: Amen, and it is for you also.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 121,
            "hadithNum_inBook": 6851,
            "title": "Sahih Muslim 2733, 2732 c",
            "narrator": "Safwan (and he was Ibn 'Abdullah b. Safwan, and he had been married to Umm Darda') reported:",
            "english_text": "I visited Abu Darda's house in Syria. I did not find him there but Umm Darda' (was present at the house). She said: Do you intend to perform Hajj during this year? I said: Yes. She said: Do supplicate Allah for blessings upon us, for Allah's Apostle (may peace be upon hiin) used to say: The supplication of a Muslim for his brother at his back (in his absence) is responded so long as he makes a supplica- tion for blessings for his brother and the commissioned Angel says: Amen, and says: May it be for you too I I went to the bazar and met Abfi Dardi' and he narrated like this from Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 122,
            "hadithNum_inBook": 6852,
            "title": "Sahih Muslim 2732 d",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Safwan b. 'Abdullah b. Safwan with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 123,
            "hadithNum_inBook": 6853,
            "title": "Sahih Muslim 2734 a",
            "narrator": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:",
            "english_text": "Allah is pleased with His servant who says: Al-Hamdu lillah while taking a morsel of food and while drinking.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 124,
            "hadithNum_inBook": 6854,
            "title": "Sahih Muslim 2734 b",
            "narrator": "",
            "english_text": "This hadith is reported through Ishaaq bin Yusuf Al-Azraq from Zakariyya bin Abi Za'ida through the same chain.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 125,
            "hadithNum_inBook": 6855,
            "title": "Sahih Muslim 2735 a",
            "narrator": "Abu Huraira reported that Allah's Messenger (ﷺ) said:",
            "english_text": "The supplication of every one of you is granted if he does not grow impatient and says: I supplicated but it was not granted.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 126,
            "hadithNum_inBook": 6856,
            "title": "Sahih Muslim 2735 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The supplication of one of you is granted if he does not grow impatient and say- I supplicated my Lord but it was not granted.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 127,
            "hadithNum_inBook": 6857,
            "title": "Sahih Muslim 2735 c",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The supplication of the servant is granted in case he does not supplicate for sin or for severing the ties of blood, or he does not become impatient. It was said: Allah's Messenger, what does:\" If he does not grow impatient\" imply? He said: That he should say like this: I supplicated and I supplicated but I did not find it being responded. and theu he becomes frustrated and abandons supplication.",
            "grade": "none"
        }
    ]
}