{
    "chapterNum": 22,
    "english_title": "The Book of Transactions",
    "totalHadiths_inChapter": 160,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 3764,
            "title": "Sahih Muslim 1511 a",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade (two types of transactions) Mulamasa and Munabadha",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 3765,
            "title": "Sahih Muslim 1511 b",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported like this from Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 3766,
            "title": "Sahih Muslim 1511 c",
            "narrator": "",
            "english_text": "Abu Huraira reported from Allah's Messenger (ﷺ) a hadith like this through another chain cf transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 3767,
            "title": "Sahih Muslim 1511 d",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 3768,
            "title": "Sahih Muslim 1511 e",
            "narrator": "Abu Huraira (Allah be pleased with him) reported:",
            "english_text": "Two types of trarisactions have been forbidden (by the Holy Prophet), al-Mlulamasa and al-Munabadha. As far as Mulamasa transaction is concerned, it is that every one of them (the parties entering into transaction) should touch the garment of the other without careful consideration, and al-Munabadha is that every one of them should throw his cloth to the other and one of them should not see the cloth of his friend.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 3769,
            "title": "Sahih Muslim 1512 a",
            "narrator": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:",
            "english_text": "Allah's Messenger (ﷺ) forbade us (from), two types of business transactions and two ways of dressing. He forbade Mulamasa and Munabadha in transactions. Mulamasa means the touching of another's garment with his hand, whether at night or by day, without turning it over except this much. Munabadha means that a man throws his garment to another and the other throws his garment, and thus confirming their contract without the inspection of mutual agreement.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 3770,
            "title": "Sahih Muslim 1512 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Ibn Shihab through the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 3771,
            "title": "Sahih Muslim 1513",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade a transaction determined by throwing stones, and the type which involves some uncertainty.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 3772,
            "title": "Sahih Muslim 1514 a",
            "narrator": "",
            "english_text": "'Abdullah (b. 'Umar) (Allah be pleased with him) said that Allah's Messenger (ﷺ) forbade the transaction called habal al-habala.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 3773,
            "title": "Sahih Muslim 1514 b",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported that the people of pre-Islamic days used to sell the meat of the slaughtered camel up to habal al-habala. And habal al-habala implies that a she-camel should give birth and then the (born one should grow young) and become pregnant. Allah's Messenger (ﷺ) forbade them that (this transaction).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 3774,
            "title": "Sahih Muslim 1412 e",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as having said this:",
            "english_text": "One amongst you should not enter into a transaction when another is bargaining.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 3775,
            "title": "Sahih Muslim 1412 f",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "A person should not enter into a transaction when his brother is already making a transaction and he should not make a proposal of marriage when his brother has already made a proposal except when he gives permission.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 3776,
            "title": "Sahih Muslim 1515 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "A Muslim should not purchase (in opposition) to his brother.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 3777,
            "title": "Sahih Muslim 1515 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight change of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 3778,
            "title": "Sahih Muslim 1515 c",
            "narrator": "Abu Huraira reported Allah's Messenger (may peace'be upon him) as saying:",
            "english_text": "Do not go out to meet riders to enter into transaction with them; none of you must buy in opposition to another, nor must you bid against one another; a townsman must not sell for a man from the desert, and do not tie up udders of carnels and sheep, and he who buys them after that has been done has two courses open to him: after he has milked them he may keep them if he is pleased with them, or he may return them along with a sit of dates if he is displeased with them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 3779,
            "title": "Sahih Muslim 1515 d",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the (people) meeting the caravan (for entering into business transaction with them), and the selling of goods by a townsman on behalf of a man of the desert, and seeking by a woman the divorce of her sister (from her husband), and outbidding (against one another), and tying up the udders (of animals), and buying of (things) in opposition to one's brother.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 3780,
            "title": "Sahih Muslim 1515 e",
            "narrator": "",
            "english_text": "This hadith has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 3781,
            "title": "Sahih Muslim 1516",
            "narrator": "",
            "english_text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the outbidding (against another).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 3782,
            "title": "Sahih Muslim 1517 a",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not go out to meet merchandise in the way, (wait) until it is brought into the market. This hadith has been reported on the authority of Ibn Numair but with a slight change of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 3783,
            "title": "Sahih Muslim 1517 b",
            "narrator": "",
            "english_text": "This hadith has been reported on the authority of 'Ubaidullah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 3784,
            "title": "Sahih Muslim 1518",
            "narrator": "Abdullah (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Do not meet the traders (in the way).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 3785,
            "title": "Sahih Muslim 1519 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:",
            "english_text": "Do not meet the merchandise (in the way).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 3786,
            "title": "Sahih Muslim 1519 b",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not meet the merchant in the way and enter into business transaction with him, and whoever meets him and buys from him (and in case it is done, see) that when the owner of (merchandise) comes into the market (and finds that he has been paid less price) he has the option (to declare the transaction null and void).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 3787,
            "title": "Sahih Muslim 1520",
            "narrator": "Abu Huraira (Allah be pleased with him) reported it directly from Allah's Apostle (ﷺ):",
            "english_text": "The townsman'should not sell for a man from the desert (with a view to taking advantage of his ignorance of the market conditions of the city). And Zuhair reported from the Prophet (ﷺ) that he forbade the townsman to sell on behalf of the man from the desert.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 3788,
            "title": "Sahih Muslim 1521",
            "narrator": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The riders (carrying merchandise) should not be met in the way, and townsman should not sell for a man of the desert. The narrator reported. I said to Ibn 'Abbas: What do these words really imply-\" The townsman for the man of the desert\"? He said: That he should work as a broker on his behalf.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 3789,
            "title": "Sahih Muslim 1522 a",
            "narrator": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "The townsman should not sell for a man from the desert, leave the people alone, Allah will give them provision from one another. Yahya reported it with a slight change of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 3790,
            "title": "Sahih Muslim 1522 b",
            "narrator": "",
            "english_text": "Jabir (Allah be pleased with him) reported a similar hadith from Allah's Apostle (ﷺ) through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 3791,
            "title": "Sahih Muslim 1523 a",
            "narrator": "Anas b. Malik (Allah be pleased with him) reported:",
            "english_text": "We were forbidden that a townsman should sell for a man of the desert, even if he is his brother or father.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 3792,
            "title": "Sahih Muslim 1523 b",
            "narrator": "Anas b. Malik (Allah be pleased with him) said:",
            "english_text": "We were forbidden that a townsman should sell for a man of the desert.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 3793,
            "title": "Sahih Muslim 1524 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be'upon him) as saying:",
            "english_text": "He who bought a goat having its udder tied up should go back with it, milk it, and, if he is satisfied with its milk, he should retair it, otherwise he should return it along with a sa' of dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 3794,
            "title": "Sahih Muslim 1524 b",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys a goat with its udder tied up has the option to retain the goat if he so desires or return it within three days, and in case he returns it he should do so along with a sa' of dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 3795,
            "title": "Sahih Muslim 1524 c",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "lie who buys a goat having its udder tied up has the option to return it within three days. If he returns it he should pay a sa' of dates. Wheat is not essential.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 3796,
            "title": "Sahih Muslim 1524 d",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys a goat having its udder tied up has two courses left for him. He may retain it, and if he desires may return it along with a sa' of dates and not wheat.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 3797,
            "title": "Sahih Muslim 1524 e",
            "narrator": "Ayyub narrated with the same chain of transmitters but with this change of words:",
            "english_text": "\" He who buys a goat has the option....\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 3798,
            "title": "Sahih Muslim 1524 f",
            "narrator": "Hammam b. Munabbih said:",
            "english_text": "Out of the ahadith which Abu Huraira (Allah be pleased with him) reported to us from Allah's Messenger (ﷺ) one is this that Allah's Messenger (ﷺ) said: If one among you buys a she-camel having its udder tied up he has the two options for him after milking it either (to retain it) or return it with a sa' of dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 3799,
            "title": "Sahih Muslim 1525 a",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys foodgrain should not sell it until he has taken possession of it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 3800,
            "title": "Sahih Muslim 1525 b",
            "narrator": "",
            "english_text": "A hadith like this has been narrated through the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 3801,
            "title": "Sahih Muslim 1525 c",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys food-rain should not sell it until he has taken possession of it. Ibn Abbas (Allah be pleased with them) said: I regard everything like food (so far as this principle is concerned).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 3802,
            "title": "Sahih Muslim 1525 d",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys foodgrain should not sell it, until he has weighed it (and then taken possession of it). I (Tawus) said to Ibn Abbas (Allah be pleased with them): Why is it so? Thereupon he said: Don't you see that they (the people) sell foodgrains against gold for the stipulated time. Abu Kuraib did not make any mention of the stipulated time.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 3803,
            "title": "Sahih Muslim 1526 a",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys foodgrain should not sell it until he has taken full possession of it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 3804,
            "title": "Sahih Muslim 1527 a",
            "narrator": "Ibn Umar (Allah be pleased with them) reported:",
            "english_text": "We used to buy foodgrains during the lifetime of Allah's Messenger (ﷺ). He (the Holy Prophet) would then send to us one who commanded us to take them (the foodgrains) to a place other than the one where we had bought them before we sold it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 3805,
            "title": "Sahih Muslim 1526 b, 1527 b",
            "narrator": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who buys foodgrain should not sell that before taking possession of it. He (the narrator) said: We used to buy foodgrain from the caravans in bulk, but Allah's Messenger (ﷺ) forbade us to re-sell that until we had shifted it to some other place.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 3806,
            "title": "Sahih Muslim 1526 c",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who bought foodgrain should not sell it until he had taken full possession of it (after measuring it).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 3807,
            "title": "Sahih Muslim 1526 d",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying,:",
            "english_text": "He who bought foodgrain should not sell it until he had taken possession of it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 3808,
            "title": "Sahih Muslim 1527 c",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported that they were beaten during the lifetime of Allah's Messenger (ﷺ) if they had bought foodgrains in bulk and then sold them in the spot without shifting them (to some other place).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 3809,
            "title": "Sahih Muslim 1527 d",
            "narrator": "Salim b. 'Abdullah (Allah be pleased with them) reported his father havingsaid this:",
            "english_text": "I saw people being beaten during the lifetime of Allah's Messenger (ﷺ) in case they bought the foodgrain in bulk, and then sold them at that spot before taking it to their places. This hadith is narrated on the authority of 'Ubaidullah b. Abdullah b. 'Umar through another chain of transmitters (and the words are):\" His father (Ibn 'Umar) used to buy foodgrains in bulk and then carried them to his people.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 3810,
            "title": "Sahih Muslim 1528 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who bought foodgrain should not sell it until he had measured it. In the narration of Abu Bakr there the word is Ibta' instead of Ishtara.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 3811,
            "title": "Sahih Muslim 1528 b",
            "narrator": "Abu Huraira (Allah be please with him) is reported to have said to Marwan:",
            "english_text": "Have you made lawful the transactions involving interest? Thereupon Marwan said: I have not done that. Thereupon Abu Huraira (ﷺ) said: You have made lawful the transactions with the help of documents only, whereas Allah's Messenger (ﷺ) forbade the transaction of foodgrains until full possession is taken of them. Marwan then addressed the people and forbade them to enter into such transactions (as are done with the help of documents). Sulaiman said: I saw the sentinels snatching (these documents) from the people.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 3812,
            "title": "Sahih Muslim 1529",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When you purchase foodgrains, do not sell them until you have taken possession of them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 3813,
            "title": "Sahih Muslim 1530 a",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) is reported to have said that Allah's Messenger (ﷺ) forbade the sale of a heap of dates the weight of which is unknown in accordance with the known weight of dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 3814,
            "title": "Sahih Muslim 1530 b",
            "narrator": "",
            "english_text": "This hadith is narrated on the authority of Jabir b. Abdullah (Allah be pleased with them) but with this variation that no mention is made of the dates (which one finds) at the end of the previous hadith.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 3815,
            "title": "Sahih Muslim 1531 a",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Both parties in a business transaction have the right to annul it so long as they have not separated; except in transactions which have been made subject to the right of parties to annul them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 3816,
            "title": "Sahih Muslim 1531 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Ibn 'Umar (Allah be pleased with them) through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 3817,
            "title": "Sahih Muslim 1531 c",
            "narrator": "Ibn 'Umar (Allah be pleased with thcm) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When two persons enter into a transaction, each of them has the right to annul it so long as they are not separated and are together (at the place of transaction) ; or if one gives the other the right (to annul the transaction) But if one gives the other the option, the transaction is made on this condition (i. e. one has the right to annul the transaction), it becomes binding. And if they are separated after they have made the bargain and none of them annulled it, even then the transaction is binding.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 3818,
            "title": "Sahih Muslim 1531 d",
            "narrator": "Abdullah b. 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "When two persons enter into a transac. tion, each one of them has the right to annul it so long as they are not separated, or their transaction gives one another (as a condition) the right of annulling, and if their transaction, has the right of annulling it the transaction becomes binding. Ibn Abi Umar made this addition that whenever he (Ibn Umar) entered into a transaction with a person with the intention of not breaking it, he walked a while and then returned to him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 3819,
            "title": "Sahih Muslim 1531 e",
            "narrator": "Ibn Umar reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "There is no transaction between two persons entering a transaction until they separate, but only when there is an option to annul it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 3820,
            "title": "Sahih Muslim 1532 a",
            "narrator": "Hakim b. Hazim (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Both parties in a business transaction have the right to annul it so long as they have not separated; and if they speak the truth and make everything clear they will be blessed in their transaction; but if they tell a lie and conceal anything the blessing on their transaction will be blotted out.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 3821,
            "title": "Sahih Muslim 1532 b",
            "narrator": "A hadith like this has been transmitted on the authority of Hakim b. Hizam (Imam Muslim) said:",
            "english_text": "Hakim b. Hizam was born inside the Ka'ba and lived for one hundred and twenty years.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 3822,
            "title": "Sahih Muslim 1533 a",
            "narrator": "Abdullah b. Dinar narrated that he heard Ibn 'Umar (Allah be pleased with them) saying:",
            "english_text": "A man mentioned to the Messenger of Allah (ﷺ) that he was deceived in a business transaction, whereupon Allah's Messenger (ﷺ) said: When you enter into a transaction, say: There should be no attempt to deceive.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 3823,
            "title": "Sahih Muslim 1533 b",
            "narrator": "This hadith has been narrated on the authority of 'Abdullah b. Dinar with the same chain of transmitters but these words are not found in it.\" When he buys he should say:",
            "english_text": "There should be no attempt to deceive.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 3824,
            "title": "Sahih Muslim 1534 a",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of fruits until they were clearly in good condition, he forbade it both to the seller and to the buyer.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 3825,
            "title": "Sahih Muslim 1534 b",
            "narrator": "",
            "english_text": "Another chain on the authority of Ibn 'Umar narrated the same as the above hadith.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 3826,
            "title": "Sahih Muslim 1535",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of palm-trees (i. e. their trults) until the dates began to ripen, and ears of corn until they were white and were safe from blight. He forbade the seller and the buyer.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 3827,
            "title": "Sahih Muslim 1534 c",
            "narrator": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not buy fruit until its good condition becomes clear, and (the danger) of blight is no more. He said: Its good condition becoming clear implies that it becomes red or yellow.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 3828,
            "title": "Sahih Muslim 1534 d",
            "narrator": "",
            "english_text": "This hadith is reported or the authority of Yahya with the same chain of transmitters up to\" until its good condition becomes clear,\" but lie did not mention what follows (these words).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 3829,
            "title": "Sahih Muslim 1534 e",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 3830,
            "title": "Sahih Muslim 1534 f",
            "narrator": "",
            "english_text": "Nafi, reported on the authority of Ibn Umar (Allah be pleased with them) a hadith like that narrated before.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 3831,
            "title": "Sahih Muslim 1534 g",
            "narrator": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger' (ﷺ) as saying:",
            "english_text": "Do not buy fruits (on the trees) until their good condition becomes clear.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 3832,
            "title": "Sahih Muslim 1534 h",
            "narrator": "In the hadith transmitted on the authority of Shu'ba it was stated that Ibn Umar (Allah be pleased with them) was asked what good condition implied. He said:",
            "english_text": "When (the danger of) blight is no more.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 3833,
            "title": "Sahih Muslim 1536 a",
            "narrator": "",
            "english_text": "Jabir (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade (or forbade us) the sale of fruits until they are ripe in a good condition.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 3834,
            "title": "Sahih Muslim 1536 b",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) forbidding the sale of fruit until its good condition is obvious.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 3835,
            "title": "Sahih Muslim 1537",
            "narrator": "Abu Bakhtari reported:",
            "english_text": "I asked Ibn 'Abbas (Allah be pleased with them) about the sale of dates. He said: Allah's Messenger (ﷺ) forbade the sale of dates of the trees until one eats them or they are eaten (i. e. they are fit to be eaten) or until they are weighed (or measured). I said: What does it imply:\" Until it is weighed\"? Thereupon a person who was with him (Ibn Abbas) said: Until he is able to keep it with him (after plucking them).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 3836,
            "title": "Sahih Muslim 1538 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not sell the fruits until their good condition becomes evident.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 3837,
            "title": "Sahih Muslim 1534 i",
            "narrator": "",
            "english_text": "Ibn Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) forbidding the sale of fruits until their good condition becomes evident and the purchase of dates for dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 75,
            "hadithNum_inBook": 3838,
            "title": "Sahih Muslim 1539 a",
            "narrator": "",
            "english_text": "Zaid b. Thabit (Allah be pleased with him) said that Allah's Messenger (ﷺ) gave a concession in case of the sale known as al-araya, there is an addition of the word an tuba'a in the hadith transmitted by Ibn Numair.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 76,
            "hadithNum_inBook": 3839,
            "title": "Sahih Muslim 1538 b",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not buy the fruit until their condition is clear, and do not buy the fresh dates. A hadith like this has been reported by Ibn 'Umar through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 77,
            "hadithNum_inBook": 3840,
            "title": "Sahih Muslim 1539 b",
            "narrator": "Sa'id b. al-Musayyib said that Allah's Messenger (ﷺ) forbade the transaction of Af Muzabana and Muhaqala. Muzabana means that fresh dates on the trees should be sold against dry dates. Muhaqala implies that the wheat in the ear should be sold against the wheat and getting the land on rent for the wheat (produced in it). He (the narrator) said that the Prophet (ﷺ) had aid:",
            "english_text": "Do not sell fresh fruits on the trees until their good condition becomes manifest, and do not sell fresh dates on the trees against dry dates. Salim said: Abdullah informed me on the authority of Zaid b. Thabit, Allah's Messenger (ﷺ) having given concession afterwards in case of ariyya transactions by which dry dates can be exchanged with fresh dates, but he did not permit it in other cases.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 78,
            "hadithNum_inBook": 3841,
            "title": "Sahih Muslim 1539 c",
            "narrator": "",
            "english_text": "Zaid b. Thabit (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) having given concession in case of 'ariyya for selling dry dates (with) fresh dates after measuring them out.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 79,
            "hadithNum_inBook": 3842,
            "title": "Sahih Muslim 1539 d",
            "narrator": "",
            "english_text": "Zaid b. Thabit reported that Allah's Messenger (ﷺ) give concession in case of 'ariyya transactions according to which the members of the household give dry dates according to a measure and then eat fresh dates (in exchange for it)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 80,
            "hadithNum_inBook": 3843,
            "title": "Sahih Muslim 1539 e",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of Nafi' with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 81,
            "hadithNum_inBook": 3844,
            "title": "Sahih Muslim 1539 f",
            "narrator": "Yahya b. Sa'id reported this hadith with the same chain of transmitters but with this change:",
            "english_text": "'Ariyya implies that date-palm trees should be donated to the people and then they sell it with a measure of dry dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 82,
            "hadithNum_inBook": 3845,
            "title": "Sahih Muslim 1539 g",
            "narrator": "Zaid b Thabit (Allah be pleased with him) reported that Allah's Messenger (ﷺ) gave concession in case of al-'ariyya transactions (for exchanging dates) for dates with measure. Yahya said:",
            "english_text": "'Ariyya implies that a person should buy fresh dates on the tree for his family to eat against a measure of dry dates.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 83,
            "hadithNum_inBook": 3846,
            "title": "Sahih Muslim 1539 h",
            "narrator": "",
            "english_text": "Zaid b. Thabit (Allah be pleased with him) reported Allah's Messenger (ﷺ) granting concession in case of 'ariyya transactions and that implies selling of (dry dates for fresh dates) according to a measure.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 84,
            "hadithNum_inBook": 3847,
            "title": "Sahih Muslim 1539 i",
            "narrator": "",
            "english_text": "Ubaidullah reported this hadith with a slight change of words on the same authority (as quoted above).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 85,
            "hadithNum_inBook": 3848,
            "title": "Sahih Muslim 1539 j",
            "narrator": "",
            "english_text": "Nafi, reported this hadith with the same chain of transmitters stating that Allah's Messengtr (ﷺ) granted concession in case of 'ariyya transactions (for exchange of the same commodity) with measure.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 86,
            "hadithNum_inBook": 3849,
            "title": "Sahih Muslim 1540 a",
            "narrator": "",
            "english_text": "Bashair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (ﷺ) among the members of his family among whom one was Sahl b. Abu Hathma that Allah's Messenger (ﷺ) forbade buying of fresh dates against dry dates and that it is Riba and this is Muzabana, but he made an exemption of 'ariyya (donations) of a tree or two in which case the members of a family sell dry dates and buy fresh dates for eating them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 87,
            "hadithNum_inBook": 3850,
            "title": "Sahih Muslim 1540 b",
            "narrator": "",
            "english_text": "Bushair b. Yasar reported on the authority of some of the Companion of Allah's Messenger (ﷺ) that he exempted the transactions, of 'ariyya (from the direct exchange of one kind) after measuring the dry dates (in exchange for fresh dates).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 88,
            "hadithNum_inBook": 3851,
            "title": "Sahih Muslim 1540 c",
            "narrator": "",
            "english_text": "Bushair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (may peace be upon hinn) from among the members of his family that he forbade (the direct exchange of a commodity having different qualities) but with the change that Ishaq and Ibn al-Muthanna used the word Zabn in place of Riba and Ibn Abu 'Umar used the word Riba (interest).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 89,
            "hadithNum_inBook": 3852,
            "title": "Sahih Muslim 1540 d",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of Sahl b. Abu Hathma.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 90,
            "hadithNum_inBook": 3853,
            "title": "Sahih Muslim 1540 e",
            "narrator": "",
            "english_text": "Sahl b. Abu Hathma reported Allah's Messenger (ﷺ) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 91,
            "hadithNum_inBook": 3854,
            "title": "Sahih Muslim 1541",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) having given exemption of 'ariyya transactions measuring less than five wasqs or up to five wasqs (the narrator Dawud is in doubt whether it was five or less than five).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 92,
            "hadithNum_inBook": 3855,
            "title": "Sahih Muslim 1542 a",
            "narrator": "",
            "english_text": "Ibn Umar (Allah be pleased them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana implies the selling of fresh dates for dry dates by measuring them out and the selling of raisins by measure for grapes.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 93,
            "hadithNum_inBook": 3856,
            "title": "Sahih Muslim 1542 b",
            "narrator": "",
            "english_text": "'Abdullah (b. Umar) reported that Allah's Apostle (ﷺ) forbade Muzabana, i. e. buying of fresh dates (on) the trees for dry dates by measure, and the buying of grapes for raisins by measure and the selling of field of corn for corn by measure.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 94,
            "hadithNum_inBook": 3857,
            "title": "Sahih Muslim 1542 c",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 95,
            "hadithNum_inBook": 3858,
            "title": "Sahih Muslim 1542 d",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana is the selling of dry dates by measure for fresh dates and the selling of raisins by measure for grapes and selling of all Ports of fruits on the basis of calculation.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 96,
            "hadithNum_inBook": 3859,
            "title": "Sahih Muslim 1542 e",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana implies the selling of dry dates for fresh dates on the tree with a definite measure (making it clear) that in case it increases, it belongs to me and if it is less, it is my responsibility.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 97,
            "hadithNum_inBook": 3860,
            "title": "Sahih Muslim 1542 f",
            "narrator": "",
            "english_text": "A hadith like this has been transmitted on the authority of Ayyub.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 98,
            "hadithNum_inBook": 3861,
            "title": "Sahih Muslim 1542 g",
            "narrator": "",
            "english_text": "Abdullah (b. Umar) (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden Mazabana, and it implies that one should sell the fresh fruits of his orchard (for dry fruits) or, if it is fresh dates, for dry dates with a measure, or if it is grapes for raisins or if it is corn in the field for dry corn with a measure He (the Holy Prophet) in fact forbade all such transactions. Qutaiba has narrated it with a slight variation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 99,
            "hadithNum_inBook": 3862,
            "title": "Sahih Muslim 1542 h",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Nafi with another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 100,
            "hadithNum_inBook": 3863,
            "title": "Sahih Muslim 1543 a",
            "narrator": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "If anyone buys palm-trees after they have been fecundated the fruit belongs to the seller unless the buyer makes a proviso.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 101,
            "hadithNum_inBook": 3864,
            "title": "Sahih Muslim 1543 b",
            "narrator": "Nafi reported on the authority of Ibn Umar (Allah be pleased with them) that the Messenger of Allah (ﷺ) said:",
            "english_text": "Whichever tree is bought with its roots, and if it is fecundatedits fruit would belong to one who has grafted it except when the provision is laid down by the buyer.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 102,
            "hadithNum_inBook": 3865,
            "title": "Sahih Muslim 1543 c",
            "narrator": "Ibn Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Whosoever grafts the tree and then sells its roots, its fruit will belong to one who grafts it except when provision is laid down by the buyer.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 103,
            "hadithNum_inBook": 3866,
            "title": "Sahih Muslim 1543 d",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Nafi, with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 104,
            "hadithNum_inBook": 3867,
            "title": "Sahih Muslim 1543 e",
            "narrator": "Abdullah b. Umar (Allah be pleased with them) reported Allah's Massenger (ﷺ) as saying:",
            "english_text": "He who buys a tree after it has been fecundated, its fruit belongs to one who sells it except when the provision has been laid down by the buyer (that it will belong to him), and he who buys a slave, his property belongs to one who sells him except when a provision has been laid down by the buyer (that it will be transferred to him with the slave).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 105,
            "hadithNum_inBook": 3868,
            "title": "Sahih Muslim 1543 f",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of al Zuhri.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 106,
            "hadithNum_inBook": 3869,
            "title": "Sahih Muslim 1543 g",
            "narrator": "",
            "english_text": "Ibn Umar reported on the authority of his father as Allah's Apostle (ﷺ) saying so.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 107,
            "hadithNum_inBook": 3870,
            "title": "Sahih Muslim 1536 c",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) had forbidden Muhaqala. and Muzabana, Mukhibara and the sale of fruits until their good condition becomes clear, and (he commanded) that (commodities) should not be sold but for the dinar and dirham except in case of araya.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 108,
            "hadithNum_inBook": 3871,
            "title": "Sahih Muslim 1536 d",
            "narrator": "",
            "english_text": "Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the types of sales as described before.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 109,
            "hadithNum_inBook": 3872,
            "title": "Sahih Muslim 1536 e",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade Mukhabara and Muhaqala, and Muzabana, and the sale of the fruit until it is fit for eating, and its sale but with dirham and dinar. Exception is made in case of 'araya. Ata' said:",
            "english_text": "Jabir explained (these terms) for us. As for Mukhabara it is this that a wasteland is given by a person to another and he makes an investment in it and then gets a share in the produce. According to him (Jabir), Muzabana is the sell of fresh dates on the tree for dry dates with a measure, and Muhaqala in agriculture implies that one should sell the standing crop for grains with a measure.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 110,
            "hadithNum_inBook": 3873,
            "title": "Sahih Muslim 1536 f",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) forbidding Muhaqala, and Muzabana, and Mukhabara, and the buying of date-palm until its fruit is ripened (ripening means that its colour becomes red or yellow, or it is fit for being eaten). And Muhaqala implies that crops in the field are bought for grains according to a customary measure. Muzabana implies that date-palm should be sold for dry dates by measuring them with wisqs, and al-Mukhabara is (a share), maybe one-third or one-fourth (in produce) or something like it. Zaid (one of the narrators) said to Ata' b. Abu Rabah (the other narrator):",
            "english_text": "Did You bear Jabir b. Abdullah (Allah be pleased with them) making a mention of it that he had heard it directly from Allah's Messenger (ﷺ)? He said: Yes.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 111,
            "hadithNum_inBook": 3874,
            "title": "Sahih Muslim 1536 g",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) forbidding Muzabana and Muhaqala, and Mukhabara, and the sale of fruits until they are ripe. I (the narrator) said to Sa'id (the other narrator):",
            "english_text": "What does ripening imply? He said: It meant that they become red or become yellow and are fit for eating.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 112,
            "hadithNum_inBook": 3875,
            "title": "Sahih Muslim 1536 h",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) forbidding Muhaqala and Muzabana and Mu'awama and Mukhabara. (One of the narrators) 'said:",
            "english_text": "Sale years ahead is Mu'awama, and making exceptional but he made an exemption of araya.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 113,
            "hadithNum_inBook": 3876,
            "title": "Sahih Muslim 1536 i",
            "narrator": "",
            "english_text": "A hadith like this has been narrated on the authority of Jabir (Allah be pleased with him) from Allah's Apostle (ﷺ). but he made no mention of transactions years (ahead) implying Mu'awama.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 114,
            "hadithNum_inBook": 3877,
            "title": "Sahih Muslim 1536 j",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade leasing of land, and selling ahead for years and selling of fruits before they become ripe.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 115,
            "hadithNum_inBook": 3878,
            "title": "Sahih Muslim 1536 k",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden the renting of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 116,
            "hadithNum_inBook": 3879,
            "title": "Sahih Muslim 1536 l",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who has land should cultivate it himself, but if he does not cultivate it himself, then he should let his brother cultivate it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 117,
            "hadithNum_inBook": 3880,
            "title": "Sahih Muslim 1536 m",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported some of the Companions of Allah's Messenger (ﷺ) had surplus of land. Thereupon Allah's Messenger (ﷺ) said:",
            "english_text": "He, who has surplus land (in his possession) should cultivate it, or he should lend it to his brother for benefit, but if he refuses to accept it, he should retain it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 118,
            "hadithNum_inBook": 3881,
            "title": "Sahih Muslim 1536 n",
            "narrator": "",
            "english_text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) having forbidden taking of rent or share of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 119,
            "hadithNum_inBook": 3882,
            "title": "Sahih Muslim 1536 o",
            "narrator": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who has land should cultivate it, but if he does not find it possible to cultivate it, or finds himself helpless to do so, he should lend it to his Muslim brother, but he should not accept rent from him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 120,
            "hadithNum_inBook": 3883,
            "title": "Sahih Muslim 1536 p",
            "narrator": "Sulaiman b. Musa asked Ata':",
            "english_text": "Did Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:\" He who has land should cultivate it himself, or let his brother cultivate it, and should not give on rent\"? He said: Yes.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 121,
            "hadithNum_inBook": 3884,
            "title": "Sahih Muslim 1536 q",
            "narrator": "",
            "english_text": "Jabir (Allah be pleased with him) reported Allah's Apostle (ﷺ) having forbidden Mukhabara.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 122,
            "hadithNum_inBook": 3885,
            "title": "Sahih Muslim 1536 r",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) heard Allah's Messenger (ﷺ) say:",
            "english_text": "He who has surplus of land should either cultivate it himself, or let his brother cultivate it, an should not sell it. I (the narrator) said to Sa'id: What does his statement\" do not sell it\" mean? Does it imply\" rent\"? He said: Yes.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 123,
            "hadithNum_inBook": 3886,
            "title": "Sahih Muslim 1536 s",
            "narrator": "Jabir b. 'Abdullah reported:",
            "english_text": "We used to cultivate land on rent during the lifetime of Allah's Apostle (ﷺ) and we got a share out of the grain left in the ears after threshing them and something unspecified. Allah's Messenger (ﷺ) said: He who has land should cultivate it or let his brother till it, otherwise he should leave it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 124,
            "hadithNum_inBook": 3887,
            "title": "Sahih Muslim 1536 t",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported:",
            "english_text": "We used to get land (on rent) during the lifetime of Allah's Messeuge, (ﷺ) with a share of one-third or one-fourth (of the produce from the land irrigated) with the help of canals. Thereupon Allah's Messenger (ﷺ) stood up (to address) and said: HRe who has land should cultivate it, and if he does not cultivate it, he should lend it to his brother, and if he does not lend it to his brother, he should then retain it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 125,
            "hadithNum_inBook": 3888,
            "title": "Sahih Muslim 1536 u",
            "narrator": "Jabir (Allah he pleased with him) reported:",
            "english_text": "I heard Allah's Apostle (ﷺ) as saying: He who has (surplus) land should donate it (to others), or lend it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 126,
            "hadithNum_inBook": 3889,
            "title": "Sahih Muslim 1536 v",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters, but with a slight change of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 127,
            "hadithNum_inBook": 3890,
            "title": "Sahih Muslim 1536 w",
            "narrator": "Jabir b. `Abdullah (Allah be pleased with them) reportedthat Allah's Messenger (ﷺ) had forbidden renting of land. Bukair (one of the narrators) said:",
            "english_text": "Nafi` reported to me that he heard Ibn `Umar (Allah be pleased with them) saying: We usedto give land on rent; we then abandoned this practice when we heard the hadith of Rafi` b. Khadij.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 128,
            "hadithNum_inBook": 3891,
            "title": "Sahih Muslim 1536 x",
            "narrator": "",
            "english_text": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) forbidding the selling (renting of) uncultivated land for two years or three.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 129,
            "hadithNum_inBook": 3892,
            "title": "Sahih Muslim 1536 y",
            "narrator": "Jabir (Allah be pleased with him) reported Allah's Apostle (ﷺ) forbidding selling of (produce) in advance for two years, and in the narmtion of Ibu Abd Shaiba (the words are):",
            "english_text": "\" Selling of the fruits (on the tree) in advance for two years.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 130,
            "hadithNum_inBook": 3893,
            "title": "Sahih Muslim 1544",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who has land should cultivate it or lend it to his brother, but if he refuses, he should retain his land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 131,
            "hadithNum_inBook": 3894,
            "title": "Sahih Muslim 1536 z",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) forbidding Muzabana, and Huqul. Jabir b. Abdullah (Allah be pleased with them) said: Muzabana means the selling of fruits for dry dates and Huqul is the renting of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 132,
            "hadithNum_inBook": 3895,
            "title": "Sahih Muslim 1545",
            "narrator": "",
            "english_text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) forbidding Muhaqala and Muzabana.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 133,
            "hadithNum_inBook": 3896,
            "title": "Sahih Muslim 1546",
            "narrator": "",
            "english_text": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) having forbidden Mazabana and Muhaqala. Muzibana means the buying of fruits on the trees and Muhaqala is the renting of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 134,
            "hadithNum_inBook": 3897,
            "title": "Sahih Muslim 1547 a",
            "narrator": "Zaid b. Amr reported:",
            "english_text": "I heard Ibn Umar (Allah be pleased with them) say: We did not see any harm in renting of the land, but as the first year was over Rafi' alleged Allah's Apostle (ﷺ) having forbidden that.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 135,
            "hadithNum_inBook": 3898,
            "title": "Sahih Muslim 1547 b",
            "narrator": "This hadith has been narrated on the authority of Amr b. Dinar with the same chain of transmitters but (in) the hadith transmitted on the authority of 'Uyainah (the words are):",
            "english_text": "\" We abandoned it (renting) on account of that.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 136,
            "hadithNum_inBook": 3899,
            "title": "Sahih Muslim 1547 c",
            "narrator": "Ibn 'Umar (Allah be pleased with them) reported:",
            "english_text": "Rafi forbade us from benefitting from our land (in the form of rent).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 137,
            "hadithNum_inBook": 3900,
            "title": "Sahih Muslim 1547 d",
            "narrator": "Nafi reported that Ibn Umar (Allah be pleased with them) rented his land during the lifetime of Allah's Messenger (ﷺ) and during the caliphate of Abu Bakr and that of Umar and that of Uthman (Allah be pleased with them) and during the early period of Muawiya's caliphate until at the end of Muawiya's reign, it reached him (Ibn 'Umar) that Rafi b. Khadij (Allah be pleased with him) narratted (a hadith) in which (there was a decree) of prohibition by Allah's Apostle (ﷺ). He (Ibn 'Umar) went to him (Rafi b. Khadij) and I was with him and he asked him, whereupon he said:",
            "english_text": "Allah's Messenger (ﷺ) used to forbid the renting of land. So Ibn Umar (Allah be pleased with them) abandoned it, and subsequently whenever he was asked about it, he said: Rafi b. Khadij (Allah be pleased with him) alleged that Allah's Messenger (ﷺ) forbade it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 138,
            "hadithNum_inBook": 3901,
            "title": "Sahih Muslim 1547 e",
            "narrator": "This hadith has been narrated on the authority of Ayyub and he made an addition in the hadith narrated by Ibn Ulayya in which he said:",
            "english_text": "Ibn Umar abandoned it afterwards and he did not rent it (the land).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 139,
            "hadithNum_inBook": 3902,
            "title": "Sahih Muslim 1547 f",
            "narrator": "Nafi reported:",
            "english_text": "I went to Rafi b. Khadij in the company of Ibn 'Umar (All be pleased with them) until he (Ibn 'Umar) came to him at Balat (a place near Prophet's Mosque at Medina) and he (Rafi b. Khadij) informed him that Allah's Messenger (ﷺ) had forbidden the renting of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 140,
            "hadithNum_inBook": 3903,
            "title": "Sahih Muslim 1547 g",
            "narrator": "",
            "english_text": "Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 141,
            "hadithNum_inBook": 3904,
            "title": "Sahih Muslim 1547 h",
            "narrator": "Nafi, reported that Ibn Umar (Allah be pleased with them) used to rent the land, and that he was conveyed the hadith transmitted on the authority of Rafi b. Khadij. He (the narrator) said:",
            "english_text": "He then went to him along with me. He (Rafi) narrated from some of his uncles in which it was mentioned that Allah's Apostle (ﷺ) forbade the renting of land. Ibn 'Umar (Allah be pleased with them) then abandoned this practice of renting.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 142,
            "hadithNum_inBook": 3905,
            "title": "Sahih Muslim 1547 i",
            "narrator": "",
            "english_text": "This hadith has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 143,
            "hadithNum_inBook": 3906,
            "title": "Sahih Muslim 1547 j",
            "narrator": "Salim b. Abdullah reported that AbduUah b. Umar (Allah be pleased with them) used to give land on rent until (this news) reached him that Rafi b. Khadij Ansari used to forbid the renting of land. Abdullah met him and said:",
            "english_text": "Ibn Khadij, what is this that you narrate from Allah's Messenger (ﷺ) pertaining to renting of land? Rafi b. Khadij said to Abdullah: I heard it from two uncles of mine and they had participated in the Battle of Badr who narrated to the members of the family that Allah's Messenger (ﷺ) forbade the renting of land. Abdullah said: I knew it that the land was rented during the lifetime of Allah's Messenger (ﷺ). Abdullah then apprehended that Allah's Messenger (ﷺ) might have said something new in this connection (in regard to prohibition of renting) which I failed to know. So he abandoned the renting of land.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 144,
            "hadithNum_inBook": 3907,
            "title": "Sahih Muslim 1548 a",
            "narrator": "Rafi b. Khadij (Allah be pleased with him) reported:",
            "english_text": "We used to give on rent land during the lifetime of Allah's Messenger (ﷺ). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (ﷺ) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (ﷺ) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 145,
            "hadithNum_inBook": 3908,
            "title": "Sahih Muslim 1548 b",
            "narrator": "Rafi b. Khadij (Allah be pleased with him) reported:",
            "english_text": "We used to give land on rent, and we rented it on one-third or one-fourth share. The rest of the hadith is the same.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 146,
            "hadithNum_inBook": 3909,
            "title": "Sahih Muslim 1548 c",
            "narrator": "",
            "english_text": "Another chain narrated the same as the above hadith.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 147,
            "hadithNum_inBook": 3910,
            "title": "Sahih Muslim 1548 d",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Rafi' b. Khadij with the same chain of transmitters, but in it no mention is made of some of his uncles.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 148,
            "hadithNum_inBook": 3911,
            "title": "Sahih Muslim 1548 e",
            "narrator": "Rafi (Allah be pleased with him) reported that Zuhair b. Rafi (who was his uncle) came to me and said:",
            "english_text": "Allah's Messenger (ﷺ) forbade a practice which was useful for us. I said: What is this? (I believe) that whatrver Allah's Messenger (ﷺ) says is absolutely true. He (Zuhair) said that he (the Holy Prophet) asked me: What do you do with your cultivable lands? I said: Allah's Messenger, we rent those irrigated by canals for dry dates or barley. He said: Don't do that. Cultivate them or let them be cultivated (by others) or retain them yourself.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 149,
            "hadithNum_inBook": 3912,
            "title": "Sahih Muslim 1548 f",
            "narrator": "",
            "english_text": "This hadith has been transmitted on the authority of Rafi from the Prophet (ﷺ) about this, but he did not make mention of his uncle Zuhair.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 150,
            "hadithNum_inBook": 3913,
            "title": "Sahih Muslim 1547 k",
            "narrator": "Hanzala b. Qais reported that he asked Rafi b. Khadij (Allah be pleased with him) about renting of land, whereupon he said:",
            "english_text": "Allah's Messenger (ﷺ) forbade the renting of land. I said: Is it forbidden (even if it is paid) in gold (dinar) and silver (dirham)? Thereupon he said: If it is paid in gold and silver, there is no harm in it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 151,
            "hadithNum_inBook": 3914,
            "title": "Sahih Muslim 1547 l",
            "narrator": "Hanzala b. Qais al-Ansri reported:",
            "english_text": "I asked Rafi' b. Khadij about the renting of land for gold and silver, whereupon he said: There is no harm in it for the people let out land situated near canals and at the ends of the streamlets or portion of fields. (But it so happened) that at times this was destroyed and that was saved. whereas (on other occasions) this portion was saved and the other was destroyed and thus no rent was payable to the people (who let out lands) but for this one (which was saved). It was due to this that he (the Holy Prophet) prohibited it. But if there is something definite and reliable (e. g. money). there is no harm in it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 152,
            "hadithNum_inBook": 3915,
            "title": "Sahih Muslim 1547 m",
            "narrator": "Hanzala reported that he heard Rafi' b. Khadij (Allah be pleased with him) say:",
            "english_text": "We were the major agriculturists of the Ansar and so we let out land (saying): The produce of this (part of land) would be ours and (the produce) of that would be theirs. But it so happened that at times this (land) gave harvest, but the other one produced nothing. So he (the Holy Prophet) forbade this. But so far as the payment in silver (dirham, a coin) is concerned, he did not forbid.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 153,
            "hadithNum_inBook": 3916,
            "title": "Sahih Muslim 1547 n",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Yahya b. Sa'id with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 154,
            "hadithNum_inBook": 3917,
            "title": "Sahih Muslim 1549 a",
            "narrator": "Abdullah b. al Sa'ib reported:",
            "english_text": "I asked Abdullah b. Ma'qil about Muzara'a (cultivating land on share basis in the produce). He said: Thabit b. Dahhak informed me that Allah's Messenger (ﷺ) forbade Muzara'a as Ibn Abu Shaiba forbade it with a slight change of words. He (the narrator) said: I asked Ibn Ma'qil but he did not name 'Abdullah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 155,
            "hadithNum_inBook": 3918,
            "title": "Sahih Muslim 1549 b",
            "narrator": "Abdullah b. al-Sa'ib reported:",
            "english_text": "We visited 'Abdullah b. Ma'qil and asked him about sharing of crops, whereupon he said: Thabit alleged that Allah's Messenger (ﷺ) forbade Muzara'a and commanded leasing it out on rent (for money) and said: There is no harm in it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 156,
            "hadithNum_inBook": 3919,
            "title": "Sahih Muslim 1550 a",
            "narrator": "Mujahid said to Tiwus:",
            "english_text": "Come along with me to Ibn Rafi b. Khadij in order to listen from him the hadith transmitted on the authority of his father (pertaining to the renting of land) from Allah's Apostle (ﷺ). He (Tawus) scolded him and said: By Allah, it I were to know that Allah's Messenger (ﷺ) had forbidden it, I would have never done it. But it has been narrated to me by one who has better knowledge of it amongst them (and he meant Ibn 'Abbas) that Allah's Messenger (ﷺ) said: It is better if a person lends, his land to his brother (for cultivation) than that he gets recognised rent on it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 157,
            "hadithNum_inBook": 3920,
            "title": "Sahih Muslim 1550 b",
            "narrator": "Tawus reported that he let out his land on rent, whereupon Amr said:",
            "english_text": "I said to him: Abu Abd al-Rahrman, I wish if you abandon this renting of land, for they alleged that Allah's Apostle (ﷺ) forbade Mukhabara. He siad: Amr, one who has informed me has the best knowledge of it among them (he meant Ibn Abbas). (He said) that Allah's Apostle (ﷺ) did not prohibit it altogether, but said: Lending of land by one among you to his brother is better for him than getting a specified amount of produce from it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 158,
            "hadithNum_inBook": 3921,
            "title": "Sahih Muslim 1550 c",
            "narrator": "",
            "english_text": "A hadith like this has been transmitted on the authority of Ibn Abbas (Allah be pleased with them).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 159,
            "hadithNum_inBook": 3922,
            "title": "Sahih Muslim 1550 d",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "If one among you lets out land to his brother, that is better for him than if he receives such and such (the definite thing). Ibn 'Abbis (Allah be pleased with them) said: It is Haql, and in the parlance of the Ansr it is Muhaqala.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 160,
            "hadithNum_inBook": 3923,
            "title": "Sahih Muslim 1550 e",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "He who has land, it is better for him that he should let it out to his brother.",
            "grade": "none"
        }
    ]
}