{
    "chapterNum": 12,
    "english_title": "The Book of Prayer - Funerals",
    "totalHadiths_inChapter": 138,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 2101,
            "title": "Sahih Muslim 916 a",
            "narrator": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 2102,
            "title": "Sahih Muslim 916 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 2103,
            "title": "Sahih Muslim 917",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 2104,
            "title": "Sahih Muslim 918 a",
            "narrator": "Umm Salama reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 2105,
            "title": "Sahih Muslim 918 b",
            "narrator": "Umm Salama, the wife of the Messenger of Allah (ﷺ), reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "If any servant (of Allah) who suffers a calamity says:\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" ' Allah will give him reward for affliction, and would give him something better than it in exchange. She (Umm Salama) said: When Abu Salama died. I uttered (these very words) as I was commanded (to do) by the Messenger of Allah (ﷺ). So Allah gave me better in exchange than him. i. e. (I was taken as the wife of) the Messenger of Allah (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 2106,
            "title": "Sahih Muslim 918 c",
            "narrator": "Umm Salama, the wife of the Messenger of Allah (way peace be upon him), reported Allah's Messenger (ﷺ) saying like the hadith transmitted by Abu Usama, but with this addition that she said:",
            "english_text": "\" When Abu Salama died I said: Who is better than Abu Salama, the Companion of the Messenger of Allah (ﷺ), and Allah decided for me and I said (these words contained in the supplication mentioned above) and I was married to the Messenger of Allah (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 2107,
            "title": "Sahih Muslim 919",
            "narrator": "Umm Salama reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 2108,
            "title": "Sahih Muslim 920 a",
            "narrator": "Umm Salama reported:",
            "english_text": "The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 2109,
            "title": "Sahih Muslim 920 b",
            "narrator": "This hadith has been narrated by Khalid al Hadhdha' with the same chain of transmitters but with this alteration that he said:",
            "english_text": "(O Allah! ) let Thee be the caretaker of what is left by him, and he said: Grant him expansion of the grave, but he did not say: Make his grave spacious. Khalid said: He supplicated for the seventh (thing too) which I have forgotten.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 2110,
            "title": "Sahih Muslim 921 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 2111,
            "title": "Sahih Muslim 921 b",
            "narrator": "",
            "english_text": "This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 2112,
            "title": "Sahih Muslim 922",
            "narrator": "Umm Salama reported:",
            "english_text": "When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 2113,
            "title": "Sahih Muslim 923 a",
            "narrator": "Usama b. Zaid reported:",
            "english_text": "While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 2114,
            "title": "Sahih Muslim 923 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 2115,
            "title": "Sahih Muslim 924",
            "narrator": "'Abdullah b. 'Umar said that Sa'd b. Ubada complained of illness. The Messenger of Allah (ﷺ) came to visit him accompanied by 'Abd al-Rahman b. 'Auf, Sa'd b. Abi Waqqas and 'Abdullah b. Mas'ud. As he entered (his room) he found him in a swoon. Upon this he said:",
            "english_text": "Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 2116,
            "title": "Sahih Muslim 925",
            "narrator": "'Abdullah b. 'Umar reported:",
            "english_text": "While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 2117,
            "title": "Sahih Muslim 926 a",
            "narrator": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Endurance is to be shown at the first blow.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 2118,
            "title": "Sahih Muslim 926 b",
            "narrator": "Anas b. Malik reported that Allah's Messenger (ﷺ) came to a woman who had been weeping for her (dead) child, and said to her:",
            "english_text": "Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (ﷺ), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 2119,
            "title": "Sahih Muslim 926 c",
            "narrator": "A hadith like this is narrated with the same chain of transmitters but with the addition of these words:",
            "english_text": "\" The Apostle of Allah (ﷺ) happened to pass by a woman (who was sitting) by the side of a grave.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 2120,
            "title": "Sahih Muslim 927 a",
            "narrator": "'Abdullah b. 'Umar reported that Hafsa wept for 'Umar (when he was about to die). He ('Umar) said:",
            "english_text": "Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 2121,
            "title": "Sahih Muslim 927 b",
            "narrator": "Umar reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "The dead is punished in the grave because of wailing on it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 2122,
            "title": "Sahih Muslim 927 c",
            "narrator": "",
            "english_text": "The same hadith is narrated on the authority of 'Umar through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 2123,
            "title": "Sahih Muslim 927 d",
            "narrator": "Ibn 'Umar reported:",
            "english_text": "When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the weeping of the living\"?",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 2124,
            "title": "Sahih Muslim 927 e",
            "narrator": "Abu Burda narrated on the authority of his father that when 'Umar was wounded Suhaib uttered (loudly in lamentation):",
            "english_text": "O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of the living\"?",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 2125,
            "title": "Sahih Muslim 927 f",
            "narrator": "Abu Musa reported that when 'Umar was wounded, there came Suhaib from his house and went to 'Umar and stood by his side, and began to wail. Upon this 'Umar said:",
            "english_text": "What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (ﷺ) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 2126,
            "title": "Sahih Muslim 927 g",
            "narrator": "Anas reported that when 'Umar b. Khattab was wounded Hafsa lamented for him. Upon this he said:",
            "english_text": "O Hafsa, did you not hear the Messenger of Allah (ﷺ) saying:\" One who is lamented would be punished\"? Suhaib also lamented over him. 'Umar told him also: O Suhaib, didn't you know that one who is lamented is punished?",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 2127,
            "title": "Sahih Muslim 928 a, 927 h, 929 a",
            "narrator": "'Abdullah b. Abu Mulaika reported:",
            "english_text": "I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 2128,
            "title": "Sahih Muslim 928 b, 927 i, 929 b",
            "narrator": "'Abdullah b. Abu Mulaika said:",
            "english_text": "The daughter of 'Uthman b. 'Affan died in Mecca. We came to attend her (funeral). Ibn 'Umar and Ibn 'Abbas were also present there, and I was sitting between them. He added: I (first sat) by the side of one of them, then the other one came and he sat by my side. 'Abdullah b. 'Umar said to 'Amr b. 'Uthman who was sitting opposite to him: Will you not prevent the people from lamenting, for the Messenger of Allah (ﷺ) had said:\" The dead is punished because of the lamenting of his family for him\"? Ibn 'Abbas then said that Umar used to say someting of that nature, and then narrated saying: I proceeded from Mecca along with 'Umar till we reached al-Baida' and there was a party of riders under the shade of a tree. He said (to me): Go and find out who this party is. I cast a glance and there was Suhaib (in that party). So I informed him ('Umar) about it. He said: Call him to me. So I went back to Suhaib and said: Go and meet the Commander of the believers. When 'Umar was wounded, Suhaib came walling: Alas, for the brother! alas for the companion! 'Umar said: O Suhaib, do you wail for me, whereas the Messenger of Allah (ﷺ) said:\" The dead would be punished on account of the lamentation of the (members of his family)\"? Ibn 'Abbas said: When 'Umar died I made a mention of it to 'A'isha. She said: May Allah have mercy upon 'Umar! I swear by Allah that Allah's Messenger (ﷺ) never said that Allah would punish the believer because of the weeping (of any one of the members of his family), but he said that Allah would increase the punishment of the unbeliever because of the weeping of his family over him. 'A'isha said: The Qur'an is enough for you (when it states):\" No bearer of burden will bear another's burden\" (vi. 164). Thereupon Ibn 'Abbas said: Allah is He Who has caused laughter and weeping. Ibn Abu Mulaika said: By Allah, Ibn 'Umar said nothing.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 2129,
            "title": "Sahih Muslim 929 c",
            "narrator": "'Amr reported on the authority of Ibn Abu Mulaika:",
            "english_text": "We were with the bier of Umm Aban, daughter of 'Uthman, and the rest of the hadith is the same, but he did not narrate it as a marfu' hadith on the authority of 'Umar from the Messenger of Allah (ﷺ) as it was narrated by Ayyub and Ibn Juraij, and the hadith narrated by them (Ayyub and Ibn Juraij) is more complete than that of 'Amr.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 2130,
            "title": "Sahih Muslim 930",
            "narrator": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) said:",
            "english_text": "The dead is punished because of the lamentation of the living.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 2131,
            "title": "Sahih Muslim 931",
            "narrator": "Hisham b. 'Urwa narrated on the authority of his father that the saying of Ibn 'Umar, viz.\" The dead would be punished because of the lamentation of his family over him\" was mentioned to 'A'isha. Upon this she said:",
            "english_text": "May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 2132,
            "title": "Sahih Muslim 932 a",
            "narrator": "Hisham narrated on the authority of his father that it was mentioned to 'A'isha that Ibn 'Umar had narrated as marfu' hadith from the Messenger of Allah (ﷺ) that the dead would be punished in the grave because of the lamentation of his family for him. Upon this she said:",
            "english_text": "He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 2133,
            "title": "Sahih Muslim 932 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters. The hadith narrated by Abu Usama is more complete.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 2134,
            "title": "Sahih Muslim 932 c",
            "narrator": "'Amra daughter of 'Abd al Rahman narrated that she heard (from) 'A'isha and made a mention to her about 'Abdullah b. 'Umar as saying:",
            "english_text": "The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (ﷺ) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 2135,
            "title": "Sahih Muslim 933 a",
            "narrator": "'Ali b. Rabi'a reported that the first one who was lamented upon in Kufa was Qaraza b. Ka'b. Mughira b. Shu'ba said:",
            "english_text": "I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 2136,
            "title": "Sahih Muslim 933 b",
            "narrator": "",
            "english_text": "A hadith like this has been narrated by Mughira b. Shu'ba from the Messenger of Allah (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 2137,
            "title": "Sahih Muslim 933 c",
            "narrator": "",
            "english_text": "This hadith has been narrated from the Messenger of Allah (ﷺ) through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 2138,
            "title": "Sahih Muslim 934",
            "narrator": "Abu Malik al-Ash'ari reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 2139,
            "title": "Sahih Muslim 935 a",
            "narrator": "'A'isha reported that when the Messenger of Allah (ﷺ) was told that Ibn Haritha, Ja'far b. Abu Talib and Abdullah b. Rawaha were killed, he sat down, showing signs of grief. She (further) said:",
            "english_text": "I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 2140,
            "title": "Sahih Muslim 935 b",
            "narrator": "This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters like one narrated by 'Abd al-'Aziz (with the change of these words):",
            "english_text": "\" You did not spare the Messenger of Allah (ﷺ) the botheration.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 2141,
            "title": "Sahih Muslim 936 a",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 42,
            "hadithNum_inBook": 2142,
            "title": "Sahih Muslim 936 b",
            "narrator": "",
            "english_text": "Umm 'Atiyya reported that the Messenger of Allah (ﷺ) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 43,
            "hadithNum_inBook": 2143,
            "title": "Sahih Muslim 937",
            "narrator": "Hafsa narrated on the authority of Umm 'Atiyya that she said:",
            "english_text": "When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 44,
            "hadithNum_inBook": 2144,
            "title": "Sahih Muslim 938 a",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "We were forbidden to follow the bier, but it was not made absolute on us.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 45,
            "hadithNum_inBook": 2145,
            "title": "Sahih Muslim 938 b",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "We were refrained from following the bier, but it was not made absolute on us.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 46,
            "hadithNum_inBook": 2146,
            "title": "Sahih Muslim 939 a",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 47,
            "hadithNum_inBook": 2147,
            "title": "Sahih Muslim 939 b",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "We braided her hair in three plaits.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 48,
            "hadithNum_inBook": 2148,
            "title": "Sahih Muslim 939 c",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "One of the daughters of the Messenger of Allah (ﷺ) died. And in the hadith transmitted by Ibn 'Ulayya (the words are): The Messenger of Allah (ﷺ) came to us and we were washing his daughter. And in the hadith transmitted by Malik (the words are): There came in (our apartment) the Messenger of Allah (way peace be upon him) when his daughter died. The rest of the hadith is the same as narrated by Yazid b. Zurai' from Ayyub from Muhammad from Umm 'Atiyya.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 49,
            "hadithNum_inBook": 2149,
            "title": "Sahih Muslim 939 d",
            "narrator": "A hadith like this has been transmitted by Hafsa on the authority of Umm 'Atiyya with the exception (of these words that the Prophet asked them to wash her dead body):",
            "english_text": "\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 50,
            "hadithNum_inBook": 2150,
            "title": "Sahih Muslim 939 e",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "We washed her an odd number of times, i. e. three, five or seven times; and Umm 'Atiyya (further) said: We braided her hair in three plaits.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 51,
            "hadithNum_inBook": 2151,
            "title": "Sahih Muslim 939 f",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "When Zainab the daughter of the Messenger of Allah (ﷺ) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 52,
            "hadithNum_inBook": 2152,
            "title": "Sahih Muslim 939 g",
            "narrator": "Umm 'Atiyya reported:",
            "english_text": "There came to us the Messenger of Allah (ﷺ) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 53,
            "hadithNum_inBook": 2153,
            "title": "Sahih Muslim 939 h",
            "narrator": "",
            "english_text": "Umm 'Atiyya reported that when the Messenger of Allah (ﷺ) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 54,
            "hadithNum_inBook": 2154,
            "title": "Sahih Muslim 939 i",
            "narrator": "",
            "english_text": "Umm 'Atiyya reported that the Messenger of Allah (ﷺ) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 55,
            "hadithNum_inBook": 2155,
            "title": "Sahih Muslim 940 a",
            "narrator": "Khabbab al-Aratt reported:",
            "english_text": "We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 56,
            "hadithNum_inBook": 2156,
            "title": "Sahih Muslim 940 b",
            "narrator": "",
            "english_text": "A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 57,
            "hadithNum_inBook": 2157,
            "title": "Sahih Muslim 941 a",
            "narrator": "'A'isha reported that the Messenger of Allah (ﷺ) was shrouded in three cotton garments of white Yamani stuff from Sahul, among which was neither a shirt nor a turban; and so far as Hullah is concerned there was some doubt about it in the minds of people, that it was brought for him in order to shroud him with it, but it was abandoned, and he was shrouded in three cotton garments of white Yamani stuff from Sahul. Then 'Abdullah b. Abu Bakr got it and said:",
            "english_text": "I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 58,
            "hadithNum_inBook": 2158,
            "title": "Sahih Muslim 941 b",
            "narrator": "'A'isha reported that the Messenger of Allah (ﷺ) was wrapped in a Yamani wrapper which belonged to 'Abdullah b Abu Bakr; then it was removed from him, and he was shrouded in three cotton sheets of white Yamani stuff from Sahul among which was neither a shirt nor a turban. 'Abdullah took up the Hullah and said:",
            "english_text": "I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (ﷺ) was not shrouded! So he gave it in charity.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 59,
            "hadithNum_inBook": 2159,
            "title": "Sahih Muslim 941 c",
            "narrator": "",
            "english_text": "This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 60,
            "hadithNum_inBook": 2160,
            "title": "Sahih Muslim 941 d",
            "narrator": "Abu Salama said:",
            "english_text": "I asked 'A'isha with how many garments the Messenger of Allah (ﷺ) was shourded. She said: With three garments of Sahul.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 61,
            "hadithNum_inBook": 2161,
            "title": "Sahih Muslim 942 a",
            "narrator": "'A'isha reported:",
            "english_text": "When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 62,
            "hadithNum_inBook": 2162,
            "title": "Sahih Muslim 942 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by Zuhri with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 63,
            "hadithNum_inBook": 2163,
            "title": "Sahih Muslim 943",
            "narrator": "Jabir b. 'Abdullah reported:",
            "english_text": "Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 64,
            "hadithNum_inBook": 2164,
            "title": "Sahih Muslim 944 a",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 65,
            "hadithNum_inBook": 2165,
            "title": "Sahih Muslim 944 b",
            "narrator": "This hadith has been narrated by another chain of transmitters except with this variation (of words) that in the hadith narrated by Ma'mar (the words are):",
            "english_text": "\" I do not know whether the hadith is marfu'.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 66,
            "hadithNum_inBook": 2166,
            "title": "Sahih Muslim 944 c",
            "narrator": "Abu Huraira reported Allah's Messenger as saying:",
            "english_text": "Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 67,
            "hadithNum_inBook": 2167,
            "title": "Sahih Muslim 945 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 68,
            "hadithNum_inBook": 2168,
            "title": "Sahih Muslim 945 b",
            "narrator": "This hadith has been narrated on the authority of Abu Huraira through another chain of narrators up to these words:",
            "english_text": "\" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 69,
            "hadithNum_inBook": 2169,
            "title": "Sahih Muslim 945 c",
            "narrator": "This hadith is narrated on thp authority of Abu Huraira through another chain of transmitters (with these words):",
            "english_text": "\" He who followed it (the bier) till he (the dead) is buried.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 70,
            "hadithNum_inBook": 2170,
            "title": "Sahih Muslim 945 d",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 71,
            "hadithNum_inBook": 2171,
            "title": "Sahih Muslim 945 f",
            "narrator": "Nafi' narrated that it was said to Ibn 'Umar that Abu Huraira reported to have heard Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 72,
            "hadithNum_inBook": 2172,
            "title": "Sahih Muslim 945 e",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) said: Abu Huraira, what is a qirat? He said: It is like the hill of Uhud.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 73,
            "hadithNum_inBook": 2173,
            "title": "Sahih Muslim 945 g",
            "narrator": "Dawud b. 'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father that while he was sitting along with 'Abdullah b. 'Umar, Khabbab, the owner of Maqsura, said:",
            "english_text": "Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (ﷺ) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 74,
            "hadithNum_inBook": 2174,
            "title": "Sahih Muslim 946 a",
            "narrator": "Thauban, the freed slave of the Messenger of Allah (ﷺ) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 75,
            "hadithNum_inBook": 2175,
            "title": "Sahih Muslim 946 b",
            "narrator": "This hadith has been narrated by Qatada with the same chain of transmitters. And in the hadith transmitted by Sa'id and Hisham, (the words are):",
            "english_text": "\" The Apostle of Allah (ﷺ) was asked about qirat, and he said: It is equivalent to Uhud.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 76,
            "hadithNum_inBook": 2176,
            "title": "Sahih Muslim 947",
            "narrator": "'A'isha reported Allah's Apostle (ﷺ) saying:",
            "english_text": "If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 77,
            "hadithNum_inBook": 2177,
            "title": "Sahih Muslim 948",
            "narrator": "'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:",
            "english_text": "So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 78,
            "hadithNum_inBook": 2178,
            "title": "Sahih Muslim 949 a",
            "narrator": "Anas b. Malik reported:",
            "english_text": "There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 79,
            "hadithNum_inBook": 2179,
            "title": "Sahih Muslim 949 b",
            "narrator": "",
            "english_text": "This hadith has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 80,
            "hadithNum_inBook": 2180,
            "title": "Sahih Muslim 950 a",
            "narrator": "Qatada b. Rib'i reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 81,
            "hadithNum_inBook": 2181,
            "title": "Sahih Muslim 950 b",
            "narrator": "In the hadith transmitted by Yahya b. Sa'id on the authority of Qatada (the words are):",
            "english_text": "(The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 82,
            "hadithNum_inBook": 2182,
            "title": "Sahih Muslim 951 a",
            "narrator": "",
            "english_text": "Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 83,
            "hadithNum_inBook": 2183,
            "title": "Sahih Muslim 951 b",
            "narrator": "Abu Huraira reported:",
            "english_text": "The Messenger of Allah (ﷺ) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (ﷺ) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 84,
            "hadithNum_inBook": 2184,
            "title": "Sahih Muslim 951 c",
            "narrator": "",
            "english_text": "This hadith is narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 85,
            "hadithNum_inBook": 2185,
            "title": "Sahih Muslim 952 a",
            "narrator": "",
            "english_text": "Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 86,
            "hadithNum_inBook": 2186,
            "title": "Sahih Muslim 952 b",
            "narrator": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "There died today the pious servant of Allah, Ashama. So he stood up and led us in (funeral prayer) over him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 87,
            "hadithNum_inBook": 2187,
            "title": "Sahih Muslim 952 c",
            "narrator": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "A brother of yours has died, so stand up and offer prayer over him. So we stood up and drew ourselves up into two rows.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 88,
            "hadithNum_inBook": 2188,
            "title": "Sahih Muslim 953",
            "narrator": "'Imran b. Husain reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 89,
            "hadithNum_inBook": 2189,
            "title": "Sahih Muslim 954 a",
            "narrator": "Sha'bi reported that the Messenger of Allah (ﷺ) observed prayer over a grave after the dead was buried and he recited four takbirs over him. Shaibani said:",
            "english_text": "I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 90,
            "hadithNum_inBook": 2190,
            "title": "Sahih Muslim 954 b",
            "narrator": "This hadith has been narrated through another chain of transmitters, but in one of them (these words are found):",
            "english_text": "\" The Apostle of Allah (ﷺ) recited four takbirs.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 91,
            "hadithNum_inBook": 2191,
            "title": "Sahih Muslim 954 c",
            "narrator": "",
            "english_text": "The hadith as narrated by Shaibani has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 92,
            "hadithNum_inBook": 2192,
            "title": "Sahih Muslim 955",
            "narrator": "",
            "english_text": "Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 93,
            "hadithNum_inBook": 2193,
            "title": "Sahih Muslim 956",
            "narrator": "It is narrated on the authority of Abu Huraira that a dark-complexioned woman (or a youth) used to sweep the mosque. The Messenger of Allah (ﷺ) missed her (or him) and inquired about her (or him). The people told him that she (or he) had died. He asked why they did not inform him, and it appears as if they had treated her (or him) or her (or his) affairs as of little account. He (the Holy Prophet) said:",
            "english_text": "Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 94,
            "hadithNum_inBook": 2194,
            "title": "Sahih Muslim 957",
            "narrator": "It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:",
            "english_text": "The Messenger of Allah (ﷺ) recited thus.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 95,
            "hadithNum_inBook": 2195,
            "title": "Sahih Muslim 958 a",
            "narrator": "It is narrated on the authority of 'Amir Ibn Rabi'a (may Allah be pleased with him) that the Prophet (ﷺ) said:",
            "english_text": "Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 96,
            "hadithNum_inBook": 2196,
            "title": "Sahih Muslim 958 b",
            "narrator": "It is narrated on the authority of 'Amir ibn Rabi'a (may Allah be pleased with him) that the Prophet (ﷺ) said:",
            "english_text": "Should any one of you come across a funeral procession, and if he does not intend to accompany it, he must stand up until it passes by him or is placed upon the ground before it passes him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 97,
            "hadithNum_inBook": 2197,
            "title": "Sahih Muslim 958 c",
            "narrator": "It is reported on the authority of Ibn Juraij that the Prophet (ﷺ) said:",
            "english_text": "Should anyone amongst you see a bier he must stand up so long as it is within sight in case he does not intend to follow it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 98,
            "hadithNum_inBook": 2198,
            "title": "Sahih Muslim 959 a",
            "narrator": "It is narrated on the authority of Abu Sa'id al-Khudri that the Prophet (ﷺ) said:",
            "english_text": "When you follow a bier, do not sit until it is placed on the (ground).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 99,
            "hadithNum_inBook": 2199,
            "title": "Sahih Muslim 959 b",
            "narrator": "It is narrated on the authority of Abu Sa'id al-Khudri that the Prophet (ﷺ) said:",
            "english_text": "Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 100,
            "hadithNum_inBook": 2200,
            "title": "Sahih Muslim 960 a",
            "narrator": "It is narrated on the authority of Jabir ibn 'Abdullah:",
            "english_text": "There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 101,
            "hadithNum_inBook": 2201,
            "title": "Sahih Muslim 960 b",
            "narrator": "",
            "english_text": "Ibn Juraij told me that Abu Zubair heard Jabir say that the Prophet (ﷺ) kept standing for a bier until it disappeared.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 102,
            "hadithNum_inBook": 2202,
            "title": "Sahih Muslim 960 c",
            "narrator": "",
            "english_text": "Again Abu Zubair heard Jabir say that the Prophet (ﷺ) and his Companions kept standing for a bier of a Jew until it disappeared from sight.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 103,
            "hadithNum_inBook": 2203,
            "title": "Sahih Muslim 961 a, 961 b",
            "narrator": "It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Prophet (ﷺ) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:",
            "english_text": "Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 104,
            "hadithNum_inBook": 2204,
            "title": "Sahih Muslim 962 a",
            "narrator": "It is narrated on the authority of Waqid:",
            "english_text": "Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 105,
            "hadithNum_inBook": 2205,
            "title": "Sahih Muslim 962 b",
            "narrator": "Mas'ud b. al-Hakam al-Ansari informed Nafi' that he had heard Hadrat 'Ali (may Allah be pleased with him), son of Abu Talib, say about the biers:",
            "english_text": "Verily, the Prophet (ﷺ) used to stand first but later on kept sitting; but it is also narrated that Nafi' ibn Jubair saw Waqid b. 'Amr standing for a bier till it was placed down.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 106,
            "hadithNum_inBook": 2206,
            "title": "Sahih Muslim 962 c",
            "narrator": "",
            "english_text": "This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 107,
            "hadithNum_inBook": 2207,
            "title": "Sahih Muslim 962 d",
            "narrator": "It is narrated on the authority of Muhammad b. Munkadir that he said:",
            "english_text": "I heard from Mas'ud b. al-Hakam who narrated it on the authority of Hadrat 'Ali that he said: We saw the Prophet (ﷺ) stood up for a (bier) and we also stood up; he sat down and we too sat down.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 108,
            "hadithNum_inBook": 2208,
            "title": "Sahih Muslim 962 e",
            "narrator": "",
            "english_text": "This hadith has been narrated by Shu'ba with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 109,
            "hadithNum_inBook": 2209,
            "title": "Sahih Muslim 963 a, 963 b",
            "narrator": "Jubair b. Nufair says:",
            "english_text": "I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 110,
            "hadithNum_inBook": 2210,
            "title": "Sahih Muslim 963 c",
            "narrator": "",
            "english_text": "A hadith like this has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 111,
            "hadithNum_inBook": 2211,
            "title": "Sahih Muslim 963 d",
            "narrator": "'Anas b. Malik said:",
            "english_text": "I heard the Prophet (ﷺ) say (while offering prayer on a dead body): O Allah! forgive him, have mercy upon him. Give him peace and absolve him. Receive him with honour and make his grave spacious. Wash him with water, snow and hail, cleanse him from faults as is cleaned a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate, and save him from the trial of the grave and torment of Hell. 'Auf b. Malik said: I earnestly desired that I were the dead person to receive the prayer of the Messenger of Allah (ﷺ) as this dead body had (received).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 112,
            "hadithNum_inBook": 2212,
            "title": "Sahih Muslim 964 a",
            "narrator": "Samura b. Jundub said:",
            "english_text": "I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 113,
            "hadithNum_inBook": 2213,
            "title": "Sahih Muslim 964 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 114,
            "hadithNum_inBook": 2214,
            "title": "Sahih Muslim 964 c",
            "narrator": "Samura b. Jundub said:",
            "english_text": "I was a young boy during the time of the Prophet (ﷺ) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (ﷺ) over a woman who had died in the state of delivery, and the Messenger of Allah (ﷺ) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 115,
            "hadithNum_inBook": 2215,
            "title": "Sahih Muslim 965 a",
            "narrator": "",
            "english_text": "It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 116,
            "hadithNum_inBook": 2216,
            "title": "Sahih Muslim 965 b",
            "narrator": "Jabir ibn Samura reported that the Prophet (ﷺ) said (funeral) prayer on Ibn Dahdah:",
            "english_text": "then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Prophet (ﷺ) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 117,
            "hadithNum_inBook": 2217,
            "title": "Sahih Muslim 966",
            "narrator": "'Amir b. Sa'd b. Abu Waqqas told that Sa'd b. Abu Waqqas said during his illness of which he died:",
            "english_text": "\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 118,
            "hadithNum_inBook": 2218,
            "title": "Sahih Muslim 967",
            "narrator": "",
            "english_text": "Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 119,
            "hadithNum_inBook": 2219,
            "title": "Sahih Muslim 968",
            "narrator": "Thumama b. Shafayy reported:",
            "english_text": "When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 120,
            "hadithNum_inBook": 2220,
            "title": "Sahih Muslim 969 a, 969 b",
            "narrator": "Abu'l-Hayyaj al-Asadi told that 'Ali (b. Abu Talib) said to him:",
            "english_text": "Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 121,
            "hadithNum_inBook": 2221,
            "title": "Sahih Muslim 970 a",
            "narrator": "Jabir said:",
            "english_text": "Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 122,
            "hadithNum_inBook": 2222,
            "title": "Sahih Muslim 970 b",
            "narrator": "",
            "english_text": "A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 123,
            "hadithNum_inBook": 2223,
            "title": "Sahih Muslim 970 c",
            "narrator": "",
            "english_text": "Jabir said that he was forbidden to plaster graves.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 124,
            "hadithNum_inBook": 2224,
            "title": "Sahih Muslim 971 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 125,
            "hadithNum_inBook": 2225,
            "title": "Sahih Muslim 971 b",
            "narrator": "",
            "english_text": "A hadith like this has been narrated by Suhail with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 126,
            "hadithNum_inBook": 2226,
            "title": "Sahih Muslim 972 a",
            "narrator": "Abu Marthad al-Ghanawi reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not sit on the graves and do not pray facing towards them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 127,
            "hadithNum_inBook": 2227,
            "title": "Sahih Muslim 972 b",
            "narrator": "Abu Marthad al-Ghanawi reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not pray facing towards the graves, and do not sit on them.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 128,
            "hadithNum_inBook": 2228,
            "title": "Sahih Muslim 973 a",
            "narrator": "'Abbad b. 'Abdullah b. Zubair reported that 'A'isha ordered the bier of Sa'd b. Abu Waqqas to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said:",
            "english_text": "How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 129,
            "hadithNum_inBook": 2229,
            "title": "Sahih Muslim 973 b",
            "narrator": "'Abbad b. 'Abdullah b. Zubair reported on the authority of 'A'isha that when Sa'd b. Abu Waqqas died, the wives of the Messenger of Allah (ﷺ) sent message to bring his bier into the mosque so that they should offer prayer for him. They (the participants of the funeral) did accordingly, and it was placed in front of their apartments and they offered prayer for him. It was brought out of the door (known as) Bab al-Jana'iz which was towards the side of Maqa'id, and the news reached them (the wives of the Holy Prophet) that the people bad criticised this (i. e. offering of funeral prayer in the mosque) saying that it was not desirable to take the bier inside the mosque. This was conveyed to 'A'isha. She said:",
            "english_text": "How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 130,
            "hadithNum_inBook": 2230,
            "title": "Sahih Muslim 973 c",
            "narrator": "Abu Salama b. 'Abd al-Rahman reported on the authority ot 'A'isha that when Sa'd b. Abu Waqqas died she said:",
            "english_text": "Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (ﷺ) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 131,
            "hadithNum_inBook": 2231,
            "title": "Sahih Muslim 974 a",
            "narrator": "'A'isha reported (that whenever it was her turn for Allah's Messenger [may peace be upon him] to spend the night with her) he would go out towards the end of the night to al-Baqi' and say:",
            "english_text": "Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 132,
            "hadithNum_inBook": 2232,
            "title": "Sahih Muslim 974 b",
            "narrator": "Muhammad b. Qais said (to the people):",
            "english_text": "Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (ﷺ)? We said: Yes. She said: When it was my turn for Allah's Messenger (ﷺ) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 133,
            "hadithNum_inBook": 2233,
            "title": "Sahih Muslim 975",
            "narrator": "Sulaiman b. Buraida narrated on the authority of his father that the Messenger of Allah (ﷺ) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr:",
            "english_text": "\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 134,
            "hadithNum_inBook": 2234,
            "title": "Sahih Muslim 976 a",
            "narrator": "Abu Huraira reported Allah's Messenger, (ﷺ) as saying:",
            "english_text": "I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 135,
            "hadithNum_inBook": 2235,
            "title": "Sahih Muslim 976 b",
            "narrator": "Abu Huraira reported:",
            "english_text": "The Apostle of Allah (ﷺ) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 136,
            "hadithNum_inBook": 2236,
            "title": "Sahih Muslim 977 a",
            "narrator": "Ibn Buraida reported on the authority of his father that the Messenger of Allah (ﷺ) said:",
            "english_text": "I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 137,
            "hadithNum_inBook": 2237,
            "title": "Sahih Muslim 977 b",
            "narrator": "",
            "english_text": "This hadith has been narrated through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 138,
            "hadithNum_inBook": 2238,
            "title": "Sahih Muslim 978",
            "narrator": "Jabir b. Samura reported:",
            "english_text": "(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.",
            "grade": "none"
        }
    ]
}