{
    "chapterNum": 25,
    "english_title": "The Book of Gifts",
    "totalHadiths_inChapter": 41,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 4125,
            "title": "Sahih Muslim 1620 a",
            "narrator": "Umar b. Khattab (Allah be pleased with him) reported:",
            "english_text": "I donated a pedigree horse in the path of Allah. Its possessor made it languish. I thought that he would sell it at a cheap price. I asked Allah's Messenger (ﷺ) about it, whereupon he said: Don't buy it and do not get back your charity, for one who gets back the charity is like a dog who swallows its vomit.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 4126,
            "title": "Sahih Muslim 1620 b",
            "narrator": "This hadith has been narrated on the authority of Malik b. Anas with the same chain of transmitters but with this addition:",
            "english_text": "\" Don't buy that even if he gives you for one dirham.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 4127,
            "title": "Sahih Muslim 1620 c",
            "narrator": "Zaid b. Aslam reported on the authority of his father that 'Umar (Allah be pleased with him) donated a horse in the path of Allah. He found that it had languished in the hand of its possessor, and he was a man of meagre resources He (Hadrat 'Umar) intended to buy it. He came to Allah's Messenger (ﷺ) and made a mention of that to him, whereupon he said:",
            "english_text": "Don't buy that even if you get it for a dirham for he who gets back the charity is like a dog which swallows its vomit.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 4128,
            "title": "Sahih Muslim 1620 d",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters but with this (change) that the hadith transmitted on the authority of Malik and Rauh (he was the son of Qisirn) is more complete and lengthy.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 4129,
            "title": "Sahih Muslim 1621 a",
            "narrator": "Ibn 'Umar reported that 'Umar b. al-Khattib (Allah be pleased with him) donated a horse in the path of Allah and (later on) he found it being sold, and he decided to buy that. He asked the Messenger of Allah (ﷺ) about it. whereupon he (the Holy prophet) said:",
            "english_text": "Don't buy that and do not get back what you gave in charity.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 4130,
            "title": "Sahih Muslim 1621 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Ibn Umar through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 4131,
            "title": "Sahih Muslim 1621 c",
            "narrator": "Salim reported from Ibn Umar (Allah be pleased with them) that 'Umar donated a horse in the path of Allah and then found it being sold, and he decided to buy that. He asked Allah's Apostle (ﷺ) about it, whereupon Allah's Messenger (ﷺ) said:",
            "english_text": "Umar, do not get back what you gave as charity.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 4132,
            "title": "Sahih Muslim 1622 a",
            "narrator": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Apostle (ﷺ) having said this:",
            "english_text": "He who gets back his charity is like a dog which vomits, and then returns to that and eats it.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 4133,
            "title": "Sahih Muslim 1622 b",
            "narrator": "",
            "english_text": "This hadith is also reported through another chain.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 4134,
            "title": "Sahih Muslim 1622 c",
            "narrator": "",
            "english_text": "A hadith like this is reported on the authority of Muhammad son of Fatima (Allah be pleased with her) daughter of Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 4135,
            "title": "Sahih Muslim 1622 d",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) say: The similitude of one who gives a charity and then gets it back is like that of a dog which vomits and then eats its vomit.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 4136,
            "title": "Sahih Muslim 1622 e",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "One who gets back the gift is like one who eats vomit.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 4137,
            "title": "Sahih Muslim 1622 f",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 4138,
            "title": "Sahih Muslim 1622 g",
            "narrator": "Abdullah b. Tawus reported on the authority of his father who reported from Ibn Abas (Allah be pleased with them) who reported from Allah's Messenger 'may peace be upon him) that he said:",
            "english_text": "One who gets back his gift is like a dog which vomits and then swallows that vomit.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 4139,
            "title": "Sahih Muslim 1623 a",
            "narrator": "Nu'man b. Bashir reported that his father brought him to Allah's Messenger (ﷺ) and said:",
            "english_text": "I have donated this slave of mine to my son. Allah's Messenger (ﷺ) said: Have you donated to every one of your sons (a slave) like this? He said: No. Thereupon Allah's Messenger (may peace he upon him) said: Then take him back.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 4140,
            "title": "Sahih Muslim 1623 b",
            "narrator": "Nu'man b. Bashir reported:",
            "english_text": "My father brought me to Allah's Messenger (ﷺ) and said: I have donated this slave to my son. whereupon he said: Have you made (such) donation to every one or your sons? He said: No. Thereupon he (the-Holy Prophet) said: Then take him back.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 4141,
            "title": "Sahih Muslim 1623 c",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Zuhri with different chains of transmitters and a slight variation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 4142,
            "title": "Sahih Muslim 1623 d",
            "narrator": "Nu'man b. Bashir reported that his father had donated a slave to him. Allah's Apostle (may peace he upon him) said:",
            "english_text": "Who is this slave (how have you come to possess it)? Thereupon he (Nu'man b. Bashir) said: My father has donated it to me, whereupon he said: Have all brothers (of yours) been given this gift as given to you? He said: No. Thereupon he (the Holy Prophet) said: Then return him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 4143,
            "title": "Sahih Muslim 1623 e",
            "narrator": "Nu'man b. Bashir reported:",
            "english_text": "My father donated to me some of his property. My mother Amra bint Rawaha said: I shall not be pleased (with this act) until you make Allah's Messenger (ﷺ) a witness to it. My father went to Allah's Apostle (ﷺ) in order to make him the witness of the donation given to me. Allah's Messenger (ﷺ) said to him: Have you done the same with every son of yours? He said: No. Thereupon he (the Holy Prophet) said: Fear Allah, and observe equity in case of your children. My father returned and got back the gift.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 4144,
            "title": "Sahih Muslim 1623 f",
            "narrator": "Nu'man b. Bashir reported that his mother bint Rawaha asked his (Nu'man's) father about donating some gifts from his property to his son. He deferred the matter by one year, and then set forth to do that. She (Nu'man's mother) said:",
            "english_text": "I shall not be pleased unless you call Allah's Messenger (ﷺ) as witness to what you confer as a gift on your son. (Nu'man said): So father took hold of my hand and I was at that time a boy, and came to Allah's Messenger (ﷺ). and said: Allah's Messenger, the mother of this son (of mine), daughter of Rawaha wishes that I should call you witness to what I confer as gift to her son. Allah's Messenger (may pease be upon him) said: Bashir, have you any other son besides this (son of yours)? He said: Yes. He (the Holy Prophet) said: Have you given gifts to all of them like this? He said: No. Thereupon he (the Holy Prophet) said: Then call me not as witness, for I cannot be witness to an injustice.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 4145,
            "title": "Sahih Muslim 1623 g",
            "narrator": "Nu'man b. Bashir, reported that Allah's Messenger (ﷺ) had said:",
            "english_text": "Have you, besides him, other sons? He said: Yes. Thereupon he (the Holy Prophet) said: Have you given gifts to all of them like this (as you have given to Nu'man)? He said: No. Thereupon he (the Holy Prophet) said: I cannot bear witness to an injustice.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 4146,
            "title": "Sahih Muslim 1623 h",
            "narrator": "Nu'man b. Bashir (Allah be pleased with them) reported that Allah's Messenger (ﷺ) said to his father:",
            "english_text": "Call me not as witness to an injustice.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 4147,
            "title": "Sahih Muslim 1623 i",
            "narrator": "Nu'man b. Bashir (Allah be pleased with them) reported:",
            "english_text": "My father took me to Allah's Messenger (ﷺ) and said: Allah's Messenger, bear witness that I have given such and such gift to Nu'man from my property, whereupon he (the Holy Prophet) said: Have you conferred upon all of your sons as you have conferred upon Nu'man? He said: No. Thereupon he (the Holy Prophet) said: Call someone else besides me as a witness. And he further said: Would it, please you that they (your children) should all behave virtuously towards you? He said: Yes. He (the Holy Prophet) said: Then don't do that (i e. don't give gift to one to the exclusion of others).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 24,
            "hadithNum_inBook": 4148,
            "title": "Sahih Muslim 1623 j",
            "narrator": "Nu'man b. Bashir reported:",
            "english_text": "My father conferred a gift upon me, and then brought me to Allah's Messenger (ﷺ) to make him a witness (to it). He (the Holy Prophet) said: Have you given such gift to every son of yours (as you have given to Nu'man)? He said: No. Thereupon he (the Holy Prophet) said: Don't you expect goodness from them as you expect from him? He said: Yes. of course. He (the Holy Prophet) said: I am not going to bear witness to it (as it is injustice). Ibn Aun (one of the narrators) said: I narrated this hadith to Muhammad (the other narrator) who said: Verily we narrated that lie (the Holy Prophet) had said: Observe equity amongst your children.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 25,
            "hadithNum_inBook": 4149,
            "title": "Sahih Muslim 1624",
            "narrator": "Jabir (Allah be pleased with him) reported that the wife of Bashir said (to her husband):",
            "english_text": "Give to my son your slave as a gift, and make for me Allah's Messenger (ﷺ) a witness He came to Allah's Messenger (ﷺ) and said: The daughter of so and so (his wife Amra bint Rawaha) asked me to give my slave as a gift to her son, and call for me Allah's Messenger (ﷺ) as a witness. Thereupon he (the Holy Prophet) said: Has he (Nu'man) brothers? He (Bashir) said: Yes. He (further) said: Have you given to all others as you have given to him? He said: No. He said: Then it is not fair; and verily I cannot bear witness but only to what is just.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 26,
            "hadithNum_inBook": 4150,
            "title": "Sahih Muslim 1625 a",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "\"Any man who is given a\ngift for life, it belongs to him and\nhis heirs. It belongs to the one to\nwhom it is given, and does not go\nback to the one who gave it,\nbecause he has given it in such a\nway that it is subject to the rules\nof inheritance.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 27,
            "hadithNum_inBook": 4151,
            "title": "Sahih Muslim 1625 b",
            "narrator": "Jaber b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upan him) as saying:",
            "english_text": "He who conferred a life grant upon a person, it becomes his possession and that of his successors, for he surrendered his right in that by his declaration. (This property) now belongs to one to whom this lifelong grant has been made, and to his successors. Yahya narrated in the beginning of his narration: Whatever man is given a life grant, then it belongs to him and his posterity.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 28,
            "hadithNum_inBook": 4152,
            "title": "Sahih Muslim 1625 c",
            "narrator": "Jabir b. 'Abdullah al-Ansari (Allah be pleased with him) said:",
            "english_text": "Allah's Messenger (ﷺ) said: Whoever a person conferred Umra (life grant) upon a person and he says: I confer upon you this and upon your descendants and anyone who survives you, and that becomes his possession and that of his posterity. It would become (a permanent possession) of those who were conferred upon this gift, and it would not return to its owner (donor), for he gave that as a gift in which accrued the right of inheritance.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 29,
            "hadithNum_inBook": 4153,
            "title": "Sahih Muslim 1625 d",
            "narrator": "Jabir (Allah be pleased with him) said:",
            "english_text": "The Umra for which Allah's Messenger (ﷺ) gave sanction that a person way say: This (property) is for you and for your descendants. And when he said: That is for you as long as you live, then it will return to its owner (after the death of the donee). Ma'mar said: Zuhri used to give religious verdict according to this.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 30,
            "hadithNum_inBook": 4154,
            "title": "Sahih Muslim 1625 e",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with him) reported that Allah's Messenger (ﷺ) commanded that whoever is conferred upon a life grant along with his descendants is entitled to make use of the property conferred so long as he lives and his successors (also enjoy this privilege). That (property) becomes the their defect belonging. The donor cannot (after declaring Umra) lay down any condition or make any exception. Abu Salama said:",
            "english_text": "For he conferred a grant and as such it becomes heritage. and the right of inheritance abrogated his condition.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 31,
            "hadithNum_inBook": 4155,
            "title": "Sahih Muslim 1625 f",
            "narrator": "Jabir (b. 'Abdullah) (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Life grant is for one upon whom it is bestowed.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 32,
            "hadithNum_inBook": 4156,
            "title": "Sahih Muslim 1625 g",
            "narrator": "",
            "english_text": "Jabir b. 'Abdullah reported a hadith like this through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 33,
            "hadithNum_inBook": 4157,
            "title": "Sahih Muslim 1625 h",
            "narrator": "",
            "english_text": "Jabir reported this hadith directly from Allah's Apostle (ﷺ)",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 34,
            "hadithNum_inBook": 4158,
            "title": "Sahih Muslim 1625 i",
            "narrator": "Jabir (b. 'Abdullah) (Allah be pleased with him) reported Allah's Messenger (ﷺ) having said:",
            "english_text": "Keep your property to yourselves and do not squander it, for he who conferred a life grant upon another that property will belong to him upon whom it is conferred whether he lives or dies, and (would pass on) to his successors (as heritage).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 35,
            "hadithNum_inBook": 4159,
            "title": "Sahih Muslim 1625 j",
            "narrator": "This hadith is narrated on the authority of Jabir through other chains of transmitters, but (with this addition of words) that thehadith transmitted on the authority of Ayyub (these words are found):",
            "english_text": "\" The Helpers (Ansar) conferred the benefit of 'Umra, upon the Emigrants (Muhajirin), whereupon Allah's Messenger (ﷺ) said: Keep your property to yourselves.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 36,
            "hadithNum_inBook": 4160,
            "title": "Sahih Muslim 1625 k",
            "narrator": "Jabir (Allah be pleased with him) reported that a woman gave her garden as a life grant to her son. He died and later on she also died and left a son behind and brothers also, The sons of the woman making life grant said (to those who had been conferred upon this 'Umra):",
            "english_text": "This garden has returned to us. The sons of the one who had been given life grant said: This belonged to our father, during his lifetime and in case of his death. They took their dispute to Tariq, the freed slave of 'Uthman. He called Jabir and he gave testimony of Allah's Messenger (ﷺ) having said: Life grant belongs to one who is conferred upon this (privilege). Tariq gave this decision and then wrote to Abd al-Malik and informed him, Jabir bearing witness to it. Abd al-Malik said: Jabir has told the truth. Then Tariq gave a decree and, as a result thereof, it is to this day that the garden belongs to descendants of one who was conferred upon the life grant.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 37,
            "hadithNum_inBook": 4161,
            "title": "Sahih Muslim 1625 l",
            "narrator": "",
            "english_text": "Sulaiman b. Yasir reported that Jabir gave this verdict. The inheritor has a right (to inherit) the life grant according to the statement of Jabir (b. 'Abdullah) (Allah be pleased with him) which he narrated from Allah's Messenger (ﷺ).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 38,
            "hadithNum_inBook": 4162,
            "title": "Sahih Muslim 1625 m",
            "narrator": "Jabir b. 'Abdullah reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Life grant is permissible.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 39,
            "hadithNum_inBook": 4163,
            "title": "Sahih Muslim 1625 n",
            "narrator": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Life grant is the heritage of one upon whom it is conferred.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 40,
            "hadithNum_inBook": 4164,
            "title": "Sahih Muslim 1626 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Life grant is permissible.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 41,
            "hadithNum_inBook": 4165,
            "title": "Sahih Muslim 1626 b",
            "narrator": "",
            "english_text": "This hadith is narrated on the authority of Qatada with the same chain of transmitters.",
            "grade": "none"
        }
    ]
}