{
    "chapterNum": 15,
    "english_title": "The Book of I'tikaf",
    "totalHadiths_inChapter": 11,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 2755,
            "title": "Sahih Muslim 1171 a",
            "narrator": "",
            "english_text": "Ibn 'Umar (Allah be pleased with both of them) reported that the Messenger of Allah (ﷺ) used to observe i'tikaf in the last ten days of Ramadan.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 2756,
            "title": "Sahih Muslim 1171 b",
            "narrator": "Abdullah b. Umar (Allah be pleased with both of them) reported that the Messenger of Allah (ﷺ) used to observe i'tikaf in the last ten days of Ramadan. Nafi' said:",
            "english_text": "Abdullah (Allah be pleased with him) showed me the place in the mosque where the Messenger of Allah (ﷺ) used to observe i'tikaf.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 2757,
            "title": "Sahih Muslim 1172 a",
            "narrator": "",
            "english_text": "'A'isha (Allah be pleased with her) reported that the Messenger of Allah (ﷺ) used to observe i'tikaf in the last ten days of Ramadan.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 2758,
            "title": "Sahih Muslim 1172 b",
            "narrator": "",
            "english_text": "This hadith has been narrated by 'A'isha (Allah be pleased with her) through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 2759,
            "title": "Sahih Muslim 1172 c",
            "narrator": "",
            "english_text": "'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace he upon him) used to observe i'tikif in the last ten days of Ramadan till Allah called him back (to his heavenly home). Then his wives observed i'tikaf after him.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 2760,
            "title": "Sahih Muslim 1173 a",
            "narrator": "'A'isha (Allah be pleased with her) reported that when the Messenger of Allah (ﷺ) decided to observe i'tikaf, he prayed in the morning and then went to the place of his i'tikaf, and he commanded that a tent should be pitched for him, and it was pitched. He (once) decided to observe i'tikaf in the last ten days of Ramadan. Zainab (the wife of the Holy Prophet) commanded that a tent should be pitched for her. It was pitched accordingly. And some other wives of Allah's Apostle (ﷺ) commanded that tents should be pitched for them too. And they were pitched. When the Messenger of Allah (may peace he upon him) offered the morning prayer, he looked and found (so many) tents. Thereupon he said:",
            "english_text": "What is this virtue that these (ladies) have decided to acquire? He commanded his tent to be struck and abandoned i'tikaf in the month of Ramadan and postponed it to the first ten days of Shawwal.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 2761,
            "title": "Sahih Muslim 1173 b",
            "narrator": "",
            "english_text": "This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 2762,
            "title": "Sahih Muslim 1174",
            "narrator": "",
            "english_text": "'A'isha (Allah be pleased with her) reported that when the last ten nights began Allah's Messenger (ﷺ) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 2763,
            "title": "Sahih Muslim 1175",
            "narrator": "",
            "english_text": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) used to exert himself in devotion during the last ten nights to a greater extent than at any other time.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 2764,
            "title": "Sahih Muslim 1176 a",
            "narrator": "'A'isha (Allah be pleased with her) reported:",
            "english_text": "I never saw the Messenger of Allah (ﷺ) fasting in the ten days of Dhu'I-Hijja.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 2765,
            "title": "Sahih Muslim 1176 b",
            "narrator": "'A'isha (Allah be pleased with her) reported:",
            "english_text": "The Apostle of Allah (ﷺ) did not observe fast in the ten days of Dhul-Hijja.",
            "grade": "none"
        }
    ]
}