{
    "chapterNum": 41,
    "english_title": "The Book Concerning the Use of Correct Words",
    "totalHadiths_inChapter": 23,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 5803,
            "title": "Sahih Muslim 2246 a",
            "narrator": "Abu Huraira reported:",
            "english_text": "I heard Allah's Messenger (ﷺ) as saying: Allah, the Exalted and Glorious, said: The son of Adam abuses Dahr (the time), whereas I am Dahr since in My hand are the day and the night.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 5804,
            "title": "Sahih Muslim 2246 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Allah, the Exalted and Glorious, said: The son of Adam displeases Me by abusing Dahr (time), whereas I am Dahr--I alternate the night and the day.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 5805,
            "title": "Sahih Muslim 2246 c",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Allah, the Exalted and Glorious, said: The son of Adam causes Me pain as he says: Woe be upon the Time. None of you should say this: Woe be upon the Time, as I am the Time (because) I alternate the day and the night, and when I wish I can finish them up.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 5806,
            "title": "Sahih Muslim 2246 d",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should say: Woe be upon the Time, for verily Allah is the Time.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 5807,
            "title": "Sahih Muslim 2246 e",
            "narrator": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "Do not curse Time, for it is Allah Who is Time.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 5808,
            "title": "Sahih Muslim 2247 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should abuse Time for it is Allah Who is the Time, and none of you should call 'Inab (grape) as al-karm, for karm is a Muslim person.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 5809,
            "title": "Sahih Muslim 2247 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not use the word karm (for wine) for worthy of respect is the heart of a believer.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 5810,
            "title": "Sahih Muslim 2247 c",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Do not name grape as karm, for worthy of respect is a Muslim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 5811,
            "title": "Sahih Muslim 2247 d",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should use the word al-harin (for grape) for the heart of a believer is karm (worthy of respect).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 5812,
            "title": "Sahih Muslim 2247 e",
            "narrator": "Abu Huraira reported from Allah's Messenger (ﷺ) various ahadith, one of which is this that he said:",
            "english_text": "None of you should use the word al-karm for 'Inab, for karm (worthy of respect) is a Muslim person.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 5813,
            "title": "Sahih Muslim 2248 a",
            "narrator": "'Alqama b. Wa'il reported, from his father, Allah's Apostle (ﷺ) having said:",
            "english_text": "Do not say al-karm (for the word vine) but say al-habala (that is grape).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 5814,
            "title": "Sahih Muslim 2248 b",
            "narrator": "",
            "english_text": "This hadith has been reported by Alqama b. Wa'il on the authority of his father with a different chain of transmitters and with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 5815,
            "title": "Sahih Muslim 2249 a",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should say: My bondman and my slave-girl, for all of you are the bondmen of Allah, and all your women are the slave-girls of Allah; but say: My servant, my girl, and my young man and my young girl.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 5816,
            "title": "Sahih Muslim 2249 b",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should say: My bondman, for all of you are the bondmen of Allah, but say: My young man, and the servant should not say: My Lord, but should say: My chief.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 5817,
            "title": "Sahih Muslim 2249 c",
            "narrator": "This hadith has been reported on the authority of al-A'mash with the same chain of transmitters, and the words are that the servant should not say to his chief:",
            "english_text": "My Lord, and Abu Mu'awiya made an addition:\" For it is Allah, the Exalted and Glorious, Who is your Lord.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 5818,
            "title": "Sahih Muslim 2249 d",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) so many ahadith and one of them is this that Allah's Messenger (ﷺ) said:",
            "english_text": "None of you should say: Supply drink to your lord, feed your lord, help your lord in performing ablution, and none of you should say: My Lord. He should say: My chief, my patron; and none of you should say: My bondman, my slave-girl, but simply say: My boy, my girl, my servant.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 5819,
            "title": "Sahih Muslim 2250 a",
            "narrator": "'A'isha reported Allah's Messenger (ﷺ) having said:",
            "english_text": "None of you should say: \"My soul has become evil,\" but he should say: \"My soul has become remorseless.\" This hadith has been transmitted on the authority of Abu Bakr with a slight variation of wording.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 5820,
            "title": "Sahih Muslim 2250 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Abia Mu'iwiya with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 5821,
            "title": "Sahih Muslim 2251",
            "narrator": "Abu Umama b. Sahl b. Hunaif, on the authority of his father, reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "None of you should say:\" My soul has become evil,\" but he should say:\" My soul has become remorseless.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 5822,
            "title": "Sahih Muslim 2252 a",
            "narrator": "Abd Sa'id Khudri reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "There was a woman from Bani Isra'il who was short-statured and she walked in the company of two tall women with wooden sandals in her feet and a ring of gold made of plates with musk filled in them and then looked up, and musk is the best of scents; then she walked between two women and they (the people) did not recognise her, and she made a gesture with her hand like this, and Shu'ba shook his hand in order to give an indication how she shook her hand.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 5823,
            "title": "Sahih Muslim 2252 b",
            "narrator": "",
            "english_text": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) made a mention of a woman of Bana Isra'il who had filled her ring with musk and musk is the most fragrant of the scents.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 5824,
            "title": "Sahih Muslim 2253",
            "narrator": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 5825,
            "title": "Sahih Muslim 2254",
            "narrator": "Nafi' reported that when Ibn Umar wanted fumigation he got it from aloeswood without mixing anything with it, or he put camphor along with aloeswood and then said:",
            "english_text": "This is how Allah's Messenger (ﷺ) fumigated.",
            "grade": "none"
        }
    ]
}