{
    "chapterNum": 24,
    "english_title": "The Book of the Rules of Inheritance",
    "totalHadiths_inChapter": 23,
    "hadith_list": [{
            "hadithNum_inChapter": 1,
            "hadithNum_inBook": 4102,
            "title": "Sahih Muslim 1614",
            "narrator": "Usama b. Zaid reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "A Muslim is not entitled to inherit from a non-Muslim, and a non-Muslim is not entitled to inherit from a Muslim.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 2,
            "hadithNum_inBook": 4103,
            "title": "Sahih Muslim 1615 a",
            "narrator": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Give the shares to those who are entitled to them, and what remains over goes to the nearest male heir.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 3,
            "hadithNum_inBook": 4104,
            "title": "Sahih Muslim 1615 b",
            "narrator": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
            "english_text": "Give the shares to those who are entitled to them, and what is left from those wno are entitled to it goes to the nearest male heir.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 4,
            "hadithNum_inBook": 4105,
            "title": "Sahih Muslim 1615 c",
            "narrator": "Tawus reported on the authority of Ibn Abbas (Allah be pleased with them) narrating that Allah's Messenger (ﷺ) said:",
            "english_text": "Distribute the property amongst Ahl al-Fara'id, according to the Book of Allah, and what is left out of them goes to the nearest male heir.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 5,
            "hadithNum_inBook": 4106,
            "title": "Sahih Muslim 1615 d",
            "narrator": "",
            "english_text": "There is another chain of Tawus reporting like the reports that were mentioned before the previous hadith chain through Tawus (the chains of Wuhaib and Rowh bin Qasim).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 6,
            "hadithNum_inBook": 4107,
            "title": "Sahih Muslim 1616 a",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with them) reported:",
            "english_text": "I fell sick and there came to me on foot Allah's Messenger (ﷺ) and Abu Bakr for inquiring after my health. I fainted. He (the Holy Prophet) performed ablution and then sprinkled over me the water of his ablution. I felt some relief and said: Allah's Messenger, how should I decide about my property? He said nothing to me in response until this verse pertaining to the law of inheritance was revealed:\" They ask you for a decision; say: Allah gives you a decision concerning the person who has neither parents nor children\" (iv. 177).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 7,
            "hadithNum_inBook": 4108,
            "title": "Sahih Muslim 1616 b",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with him) reported:",
            "english_text": "Allah's Apostle (ﷺ) and Abi Bakr (Allah be pleased with him) visited me on foot in Banu Salama, and found me unconscious. He (the Holy Prophet) called for water and performed ablution and sprinkled out of it (the water) over me. I felt relieved. I said: Allah's Messenger, what should I do with my property? And this verse was revealed:\" Allah enjoins you concerning your children: for the male is equal of the portion of two females.\"",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 8,
            "hadithNum_inBook": 4109,
            "title": "Sahih Muslim 1616 c",
            "narrator": "Jabir b. 'Abdullah (Allah be pleased with them) reported:",
            "english_text": "While I had been ill Allah's Messenger (ﷺ) visited me and Abu akr (Allah be pleased with him) was with him, and they both came walking on foot. He (the Holy Prophet) found me unconscious. Allahs Messenger (ﷺ) performed ablution and then sprinkled over me the water of his ablution. I felt relieved regained my consciousness) and found Allah's Messenger (ﷺ) there. I said: Allah's Messenger, what should I do with my property? He gave me no reply until the verse (iv. 177) relating to the law of inheritance was revealed.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 9,
            "hadithNum_inBook": 4110,
            "title": "Sahih Muslim 1616 d",
            "narrator": "Jabir b. Abdullah (Allah be pleased with him) reported:",
            "english_text": "Whilo I was ill Allah's Messenger (ﷺ) came to me and found me unconscious. He (the Holy Prophet) performed ablution, and sprinkled over me the water of his ablution. I regained my consciousness and said: Allah's Messenger, my case of inheritance is that of Kalala. Then the verse pertaining to the inheritance ( of Kalala) was revealed. I (one of the narrators) said: I said to Muhammad b. Munkadir: (Do you mean this verse)\" They ask you; say: Allah gives you decision in regard to Kalala\" (iv. 177)? He said: Yes, it was thus revealed.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 10,
            "hadithNum_inBook": 4111,
            "title": "Sahih Muslim 1616 e",
            "narrator": "",
            "english_text": "This hadith is transmitted on the authority of Shu'ba but with a slight variation of words.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 11,
            "hadithNum_inBook": 4112,
            "title": "Sahih Muslim 1617 a",
            "narrator": "Abu Talha reported:",
            "english_text": "'Umar b. al-Khattab (Allah be pleased with him) delivered a sermon on Friday and made a mention of Allah's Apostle (ﷺ) and he also made a mention of Abu Bakr (Allah be pleased with him) and then said: I do not leave behind me any problem more difficult than that of Kalala. I did not refer to Allah's Messenger (ﷺ) more repeatedly than in case of the problem of Kalala, and he (the Holy Prophet) never showed more annoyance to me than in regard to this problem, so much so that he struck my chest with his fingers and said: 'Umar, does the verse revealed in summer season, at the end of Sura al-Nisa' not suffice you? Hadrat 'Umar (then) said: If I live I would give such verdict about (Kalala) that everyone would be able to decide whether he reads the Qur'an or he does not.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 12,
            "hadithNum_inBook": 4113,
            "title": "Sahih Muslim 1617 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 13,
            "hadithNum_inBook": 4114,
            "title": "Sahih Muslim 1618 a",
            "narrator": "Al-Bara' (Allah be pleased with him) reported that the last verse revealed in the Holy Qur'an is:",
            "english_text": "\" They ask thee for a religious verdict; say: Allah gives you a religious verdict about Kalala (the person who has neither parents nor children)\" (iv 177).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 14,
            "hadithNum_inBook": 4115,
            "title": "Sahih Muslim 1618 b",
            "narrator": "Abu Ishaq said that he heard al-Bara' b. 'Azib (Allah be pleased with him say:",
            "english_text": "The last verse revealed (in the Holy Quran) is that pertaining to Kalala, and the last sura revealed is Sura al-Bara'at.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 15,
            "hadithNum_inBook": 4116,
            "title": "Sahih Muslim 1618 c",
            "narrator": "Abu Ishaq said that he heard al-Bara' b. 'Azib (Allah be pleased with him) say:",
            "english_text": "The last complete sura revealed (in the Holy Qur'an) is Sura Tauba (i e. al-Bara'at, ix.), and the last verse revealed is that pertaining to Kalala.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 16,
            "hadithNum_inBook": 4117,
            "title": "Sahih Muslim 1618 d",
            "narrator": "",
            "english_text": "Aba Ishaq reported this hadith on the authority of al-Bara' (Allah be pleased with him) with a slight variation of words, viz. the last sura that was revealed complete.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 17,
            "hadithNum_inBook": 4118,
            "title": "Sahih Muslim 1618 e",
            "narrator": "Al-Bara' (Allah be pleased with him) reported that the last verse revealed was:",
            "english_text": "\" They ask of thee religious verdict..\" (iv. 177).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 18,
            "hadithNum_inBook": 4119,
            "title": "Sahih Muslim 1619 a",
            "narrator": "Abu Huraira (Allah be pleased with him) reported that when the body of a dead person having burden of debt upon him was brought to Allah's Messenger (ﷺ) he would ask whether he had left property enough to clear off his debt, and if the property left had been sufficient for that (purpose), he observed funeral prayer for him, otherwise he said (to his companions):",
            "english_text": "You observe prayer for your companion. But when Allah opened the gateways of victory for him, he said: I am nearer to the believers than themselves, so if anyone dies leaving a debt, its payment is my responsibility, and if anyone leaves a property, it goes to his heirs.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 19,
            "hadithNum_inBook": 4120,
            "title": "Sahih Muslim 1619 b",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of al-Zuhri through another chain of transmitters.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 20,
            "hadithNum_inBook": 4121,
            "title": "Sahih Muslim 1619 c",
            "narrator": "Abn Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) having said this:",
            "english_text": "By Him in Whose Hand is the life of Muhammad, there is no believer on the earth with whom I am not the nearest among all the people. He who amongst you (dies) and leaves a debt, I am there to pay it, and he who amongst you (dies) leaving behind children I am there to look after them. And he who amongst You leaves behind property, that is for the inheritor whoever he is.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 21,
            "hadithNum_inBook": 4122,
            "title": "Sahih Muslim 1619 d",
            "narrator": "Hammam b. Munabbih reported:",
            "english_text": "This is what Abu Huraira (Allah be pleased with him) narrated to us from Allah's Messenger (may peace he upon him). And he narrated many ahadith, and one was this: Allah's Messenger (may peace be upon him said: I am, according to the Book of Allah, the Exalted and Majestic, nearest to the believers of all the human beings. So whoever amongst you dies in debt or leaves behind destitute children, you should call me (for help) ), for I am his guardian. And who amongst you leaves property, his inheritor is entitled to get it, whoever he is.",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 22,
            "hadithNum_inBook": 4123,
            "title": "Sahih Muslim 1619 e",
            "narrator": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
            "english_text": "He who leaves property, that is for the inheritors; and he who leaves behind destitute children, then it is my responsibility (to look after them).",
            "grade": "none"
        },
        {
            "hadithNum_inChapter": 23,
            "hadithNum_inBook": 4124,
            "title": "Sahih Muslim 1619 f",
            "narrator": "",
            "english_text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
            "grade": "none"
        }
    ]
}