{
  "chapterNum": 10,
  "english_title": "The Book on Jana''iz (Funerals)",
  "totalHadiths_inChapter": 115,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 967,
      "title": "Jami` at-Tirmidhi 965",
      "narrator": "Aishah narrated that:",
      "english_text": "The Messenger of Allah said: \"The believer is not afflicted by the prick of a thorn or what is worse (or greater) than that, except that by it Allah raises him in rank and removes sin from him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 968,
      "title": "Jami` at-Tirmidhi 966",
      "narrator": "Abu Sa'eed Al-Khudri (may Allah be pleased with him) narrated that:",
      "english_text": "The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 969,
      "title": "Jami` at-Tirmidhi 967",
      "narrator": "Thawban narrated that :",
      "english_text": "the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 970,
      "title": "Jami` at-Tirmidhi 968",
      "narrator": "(Another chain) from Thawban who narrated that:",
      "english_text": "The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 971,
      "title": "Jami` at-Tirmidhi 969",
      "narrator": "Thuwair [and he is Ibn Abi Fakhitah] narrated that :",
      "english_text": "His father said: \"Ali took me by the hand and said: 'Come with us to pay a visit to Al-Hasan.' So we found that Abu Musa was with him.' Ali - peace be upon him - said: 'O Abu Musa! Did you come to visit (the sick) or merely (stop by to) visit?' He said: 'No, to visit (the sick).' So Ali said: 'I heard the Messenger of Allah saying: \"No Muslim visits (the sick) Muslims in the morning, except that sevety-thousand angels, sent Salat upon him until the evening, and he does not visit at night except that seventy thousand angels sent Salat upon him until the morning, and there will be a garden for him in Paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 972,
      "title": "Jami` at-Tirmidhi 970",
      "narrator": "Harithah bin Mudarrib said:",
      "english_text": "\"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 973,
      "title": "Jami` at-Tirmidhi 971",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "The Prophet said that (a Hadith similar to no. 970).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 974,
      "title": "Jami` at-Tirmidhi 972",
      "narrator": "Abu Sa'eed narrated that:",
      "english_text": "Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 975,
      "title": "Jami` at-Tirmidhi 973",
      "narrator": "Abdul-Aziz bin Suhaib said:",
      "english_text": "\"Thabit Al-Bunani and I entered upon Anas bin Malik, and Thabit said: 'O Abu Hamzah! I am suffering from an illness. So Anas said: 'Shall I not recite the Ruqyah of the Messenger of Allah over you?' He said: 'Why, yes.' He said: 'O Allah! Lord of mankind, removed the harm, and cure (him). Indeed You are the One Who cures, there is none who cures except you, a cure that leaves no disease.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 976,
      "title": "Jami` at-Tirmidhi 974",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Messenger of Allah said: \"A Muslim man has no right to spend two nights while he has something to will, except while his will is recorded with him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 977,
      "title": "Jami` at-Tirmidhi 975",
      "narrator": "Sa'd bin Malik said:",
      "english_text": "\"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 978,
      "title": "Jami` at-Tirmidhi 976",
      "narrator": "Abu Sa'eed Al-Khudri narrated that:",
      "english_text": "The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 979,
      "title": "Jami` at-Tirmidhi 977",
      "narrator": "Umm Salamah narrated:",
      "english_text": "\"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 980,
      "title": "Jami` at-Tirmidhi 978",
      "narrator": "Aishah narrated:",
      "english_text": "\"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 981,
      "title": "Jami` at-Tirmidhi 979",
      "narrator": "Aishah narrated:",
      "english_text": "\"I was not envious of anyone whose death was easy after I saw the severity the death of the Messenger of Allah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 982,
      "title": "Jami` at-Tirmidhi 980",
      "narrator": "[Alqamah narrated:",
      "english_text": "\"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 983,
      "title": "Jami` at-Tirmidhi 981",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "The Messenger of Allah said: \"There is nothing that the two Guardian Angels  raise to Allah that they have preserved in a day or night, and Allah finds good in the beginning of the scroll and in the end of the scroll, except that Allah Most High says: 'Bear witness that I have forgiven my servant for what is included in the scroll.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 984,
      "title": "Jami` at-Tirmidhi 982",
      "narrator": "Abdullah bin Buraidah narrated from his father, that:",
      "english_text": "The Prophet said:  \"The believer dies with sweat on his brow.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 985,
      "title": "Jami` at-Tirmidhi 983",
      "narrator": "Thabit narrated from Anas, that:",
      "english_text": "The Prophet entered upon a young man while he was dying. So he said: \"How do you feel?\" He said: \"By Allah! O Messenger of Allah! Indeed I hope in Allah and I fear from my sins.\" So the Messenger of Allah said: \"These two will not be gathered in a worshipper's heart at a time such as this, except that Allah will grant him what he hopes and make him safe from what he fears.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 986,
      "title": "Jami` at-Tirmidhi 984",
      "narrator": "Abdullah narrated that:",
      "english_text": "The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 987,
      "title": "Jami` at-Tirmidhi 985",
      "narrator": "(Another chain) from Abdullah :",
      "english_text": "(from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 988,
      "title": "Jami` at-Tirmidhi 986",
      "narrator": "Bilal bin Yahya Al-Absiy narrated that:",
      "english_text": "Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 989,
      "title": "Jami` at-Tirmidhi 987",
      "narrator": "Anas narrated that:",
      "english_text": "The Messenger of Allah said: \"(Real) Patience is at the first stroke of the calamity.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 990,
      "title": "Jami` at-Tirmidhi 988",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "The Messenger of Alllah said: \"(Real) Patience is at the first stroke of the calamity.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 991,
      "title": "Jami` at-Tirmidhi 989",
      "narrator": "Al-Qasim bin Muhammad narrated from Aishah:",
      "english_text": "\"The Prophet kissed Uthman bin Maz'un when he died, and he was crying.\" Or, he (one of the narrators) said: \"His eyes were brimming with tears.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 992,
      "title": "Jami` at-Tirmidhi 990",
      "narrator": "Umm Atiyyah narrated:",
      "english_text": "\"One of the daughters of the Prophet died, so he said: 'Wash her an odd number of times, three, or five, or more than that as you see fit. Wash her with water and Sidr, and in the last (washing) add camphor, or something from camphor. When you are finished then inform me.' When we finished we informed him so he gave us his waist-sheet and said 'Wrap her in it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 993,
      "title": "Jami` at-Tirmidhi 991",
      "narrator": "Abu Sa'eed Al-Khudri narrated that:",
      "english_text": "The Messenger of Allah said: \"The best scent is the perfume of musk.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 994,
      "title": "Jami` at-Tirmidhi 992",
      "narrator": "Abu Sa'eed narrated that:",
      "english_text": "The Prophet was asked about musk and he said: \"It is the best of your perfumes.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 995,
      "title": "Jami` at-Tirmidhi 993",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 996,
      "title": "Jami` at-Tirmidhi 994",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 997,
      "title": "Jami` at-Tirmidhi 995",
      "narrator": "Abu Qatadah narrated that:",
      "english_text": "The Messenger of Allah said: \"When one of you shrouds his brother, then let him use the best of his shrouds.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 998,
      "title": "Jami` at-Tirmidhi 996",
      "narrator": "Hisham bin Urwah narrated from his father that:",
      "english_text": "Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 999,
      "title": "Jami` at-Tirmidhi 997",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 1000,
      "title": "Jami` at-Tirmidhi 998",
      "narrator": "Abdullah bin Ja'far said:",
      "english_text": "\"When the news of the death of Ja'far came, the Prophet said: 'Prepare some food for the family of Ja'far, for indeed something has happened to them that will keep them busy.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 1001,
      "title": "Jami` at-Tirmidhi 999",
      "narrator": "Abdullah narrated that:",
      "english_text": "The Prophet said: \"He who slaps (his) cheeks, tears (his) clothes and calls with the call of the Jahliyyah is not one of us.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 1002,
      "title": "Jami` at-Tirmidhi 1000",
      "narrator": "Ali bin Rabi'ah Al-Asadi said:",
      "english_text": "\"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 1003,
      "title": "Jami` at-Tirmidhi 1001",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"There are four matters in my nation that are from the matters of Jahiliyyah which the people will not leave: Wailing, slandering one's lineage, Al-Adwa - a camel gets mange, so one hundred camels get mange - but who gave the first camel mange? And Al-Anwa (saying): \"We got rain because of this or that celestial positioning.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 1004,
      "title": "Jami` at-Tirmidhi 1002",
      "narrator": "Umar bin Al-Khattab narrated that:",
      "english_text": "The Messenger of Allah said: \"The deceased is punished for the crying of his family over him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 1005,
      "title": "Jami` at-Tirmidhi 1003",
      "narrator": "Musa bin Abi Musa Al-Asha'ri narrated from his father that:",
      "english_text": "The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 1006,
      "title": "Jami` at-Tirmidhi 1004",
      "narrator": "Yahya bin Abdur-Rahman narrated from Ibn Umar that:",
      "english_text": "The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 1007,
      "title": "Jami` at-Tirmidhi 1005",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"The Prophet took Abdur-Rahman bin Awf by the hand and went with him to his son Ibrahim. He found him in his last breaths, so he took him and put him on his lap and cried. Abdur-Rahman said to him: 'You cry? Didn't you prohibit (your followers) from crying?' He said: 'No. But I prohibited two foolish immoral voices: A voice during a calamity while clawing at one's face and tearing one's clothes, and Shaitan's scream.'\" And there is more that is stated in the Hadith.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 1008,
      "title": "Jami` at-Tirmidhi 1006",
      "narrator": "Abdullah bin Abi Bakr - and he is Ibn Muhammad bin Amr bin Hazm - narrated from his father, that:",
      "english_text": "Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 1009,
      "title": "Jami` at-Tirmidhi 1007",
      "narrator": "Salim narrated that:",
      "english_text": "His father said: \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 1010,
      "title": "Jami` at-Tirmidhi 1008",
      "narrator": "Salim bin Abdullah narrated that his father said:",
      "english_text": "\"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 1011,
      "title": "Jami` at-Tirmidhi 1009",
      "narrator": "Az-Zuhri said:",
      "english_text": "\"The Prophet, Abu Bakr, and Umar would walk in front of the funeral.\" Az-Zuhri said: \"Salim informed me that his father would walk in front of the funeral.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 1012,
      "title": "Jami` at-Tirmidhi 1010",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Messenger of Allah would walk in front of the funeral, as did Abu Bakr, Umar and Uthman.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 1013,
      "title": "Jami` at-Tirmidhi 1011",
      "narrator": "Yahya, the Imam of Banu Taimillah, narrated from Abu Majid :",
      "english_text": "From Abdullah bin Mas'ud who said: \"We asked the Messenger of Allah about walking behind the funeral. He said: 'Less than a trot. For if he was good, then you will be hastening him to it (goodness), and if he was evil, then it id only an inhabitant of the Fire that is being taken away.\"  The funeral is (to be) followed. The one who precedes it shall not have the reward of those who follow it.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 1014,
      "title": "Jami` at-Tirmidhi 1012",
      "narrator": "Thawban narrated:",
      "english_text": "\"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 1015,
      "title": "Jami` at-Tirmidhi 1013",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "\"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 1016,
      "title": "Jami` at-Tirmidhi 1014",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "\"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 1017,
      "title": "Jami` at-Tirmidhi 1015",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Prophet said: \"Hurry up with the funeral (procession) for if it was good, you are advancing it to good, and if it was evil, then you are taking it off your necks.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 1018,
      "title": "Jami` at-Tirmidhi 1016",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Messenger of Allah came to Hamza on the Day of Uhud, he stood over him and saw that he had been mutilated. He said: Had it not been that Safiyyah would be distressed, then I would have left him to be eaten by the beasts until he was gathered on the Day of Judgment from their stomachs.\" He said: \"Then he called for a Namirah to shroud him with. When it was extended over his head, it left his feet exposed, and when it was extended over his feet, it left his head exposed.\" He said: \"There were many dead and few cloths.\" He said: \"One, two and three men were shrouded in one cloth and buried in one grave.\" He said: \"So the Messenger of Allah was asking which of them knew the most Quran, so he could put him toward the Qibalh.\" He said: \"So the Messenger of Allah buried them and he did not perform (funeral prayers) for them.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 1019,
      "title": "Jami` at-Tirmidhi 1017",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 1020,
      "title": "Jami` at-Tirmidhi 1018",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 1021,
      "title": "Jami` at-Tirmidhi 1019",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Messenger of Allah said: \"Mention good things about your dead, and refrain from (mentioning) their evil.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 1022,
      "title": "Jami` at-Tirmidhi 1020",
      "narrator": "Ubadah bin As-Samit said:",
      "english_text": "\"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 1023,
      "title": "Jami` at-Tirmidhi 1021",
      "narrator": "Abu Sinan said:",
      "english_text": "\"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 1024,
      "title": "Jami` at-Tirmidhi 1022",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Prophet prayed and in the funeral prayer he for An-Najashi, said four Takbir.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 1025,
      "title": "Jami` at-Tirmidhi 1023",
      "narrator": "Abdur-Rahman bin Abi Laila said:",
      "english_text": "\"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 1026,
      "title": "Jami` at-Tirmidhi 1024",
      "narrator": "Abu Ibrahim Al-Ashhali narrated :",
      "english_text": "from his father who said: \"When the Messenger of Allah would perform  the Salat for the funeral he would said: (Allahammaghfir li-hayyina wa mayyittina, wa shahidina wa gha'ibina, wa saghirina wa kabirina, wa dhakarina wa unthana) 'O Allah! Forgive our living and our deceased, our present and our absent, our young and our old, our male and our female.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 1027,
      "title": "Jami` at-Tirmidhi 1025",
      "narrator": "Awf bin Malik said:",
      "english_text": "\"I heard the Messenger of Allah, while he was performing Salat for a deceased person. I could hear him saying in his prayer: (Allahummagfir lahu, war hamhu, waghsilhu bil-baradi (waghsilhu) kama yughsaluth-thawb) 'O Allah! Forgive him, have mercy upon him, and wash him with (snow or ice) (and wash him) just as a garment is washed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 1028,
      "title": "Jami` at-Tirmidhi 1026",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 1029,
      "title": "Jami` at-Tirmidhi 1027",
      "narrator": "Talhah bin Abdullah bin Awf narrated:",
      "english_text": "\"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 1030,
      "title": "Jami` at-Tirmidhi 1028",
      "narrator": "Marthan bin Abdullah Al-Yazani narrated:",
      "english_text": "\"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 1031,
      "title": "Jami` at-Tirmidhi 1029",
      "narrator": "Aishah narrated that:",
      "english_text": "The Prophet said: \"No one among the Muslim dies, and Salat is performed for him by a community of Muslims reaching one hundred, and they intercede (supplicate) for him, except that their intercession for him is accepted.\" In his narration, 'Ali bin Hujr said: \"One hundred or more than that.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 1032,
      "title": "Jami` at-Tirmidhi 1030",
      "narrator": "Uqbah bin Amir Al-Juhni narrated:",
      "english_text": "\"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 1033,
      "title": "Jami` at-Tirmidhi 1031",
      "narrator": "Al-Mughirah bin Shu'bah narrated that:",
      "english_text": "The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 1034,
      "title": "Jami` at-Tirmidhi 1032",
      "narrator": "Jabir narrated that:",
      "english_text": "The Prophet said: \"The child is not prayed over, nor does he inherit, nor is he inherited from until one is sure he was alive at birth.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 1035,
      "title": "Jami` at-Tirmidhi 1033",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah performed Salat over Suhail bin Al-Baida in the Masjid.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 1036,
      "title": "Jami` at-Tirmidhi 1034",
      "narrator": "Abu Ghalib narrated:",
      "english_text": "\"I prayed for the funeral of a man with Anas bin Malik, so he stood parallel to his head. Then they came with the body of a woman from the Quraish. They said: 'O Abu Hamzah perform the prayer for her.' So he stood parallel to her waist. Al-Ala bin Ziyad said to him: 'Is this how you saw the Messenger of Allah standing in the place for the funeral as you did for her, and for a place that you stood for the man?' He said: 'Yes.' When he was finished he said: 'Remember (this).'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 1037,
      "title": "Jami` at-Tirmidhi 1035",
      "narrator": "Samurah bin Jundab narrated:",
      "english_text": "\"The Prophet prayed over a woman, so he stood at her middle.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 1038,
      "title": "Jami` at-Tirmidhi 1036",
      "narrator": "Abdur-Rahman bin Ka'b bin Malik narrated that:",
      "english_text": "Jabir bin Abdullah informed him that the Prophet had put two men together in one cloth from those who were killed at (the battle of) Uhud, then he said: \"Which of them memorized the more of the Qur'an?\" When one of them was indicated to him, he put him in the Lahd (first) and said: \"I am a witness for those people on the Day of Judgment.\" And he ordered that they be buried in their blood, and that they not be prayed over, nor washed.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 1039,
      "title": "Jami` at-Tirmidhi 1037",
      "narrator": "Ash-Shaibani narrated that:",
      "english_text": "Ash-Sha'bi said: \"I was informed by one who saw the Prophet: He (pbuh) saw a solitary grave, s he lined his Companions (behind him) to pray over it.\" It was said to him (Ash-Sha'bi): \"Who informed you?\" He said: \"Ibn Abbas.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 1040,
      "title": "Jami` at-Tirmidhi 1038",
      "narrator": "Sa'eedbin Musayyab narrated:",
      "english_text": "\"Umm Sa'd died while the Prophet was absent. So when he arrived he performed Salat over her, and a month had already passed.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 1041,
      "title": "Jami` at-Tirmidhi 1039",
      "narrator": "Imran bin Husain narrated that :",
      "english_text": "the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 1042,
      "title": "Jami` at-Tirmidhi 1040",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 1043,
      "title": "Jami` at-Tirmidhi 1041",
      "narrator": "Abu Muhazzim said:",
      "english_text": "\"I accompanied Abu Hurairah for ten years, and I heard him saying: 'I heard the Messenger of Allah saying: \"Whoever follows a funeral, and carries it three times, then he has fulfilled the right that is required from him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 1044,
      "title": "Jami` at-Tirmidhi 1042",
      "narrator": "Amir bin Rabi'ah narrated that:",
      "english_text": "The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up until it goes ahead of you or it is put down.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 1045,
      "title": "Jami` at-Tirmidhi 1043",
      "narrator": "Abu Sa'eed Al-Khudri narrated that:",
      "english_text": "The Messenger of Allah said: \"Whenever you see a funeral (procession), stand up (for it). Whoever follows it, then do not sit down until it is put down.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 1046,
      "title": "Jami` at-Tirmidhi 1044",
      "narrator": "Mas'ud bin Al-Hakim narrated that standing for the funeral (procession) until it is put down was mentioned, and 'Ali bin Abi Talib mentioned and 'Ali bin Abi Talib said:",
      "english_text": "\"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)\n\n\nThere are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas. \n\n\nAbu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"\n\n\nAhmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.\n\n\n(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 1047,
      "title": "Jami` at-Tirmidhi 1045",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "The Prophet said: \"The Lahd is for us and the hole is for other than us.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 1048,
      "title": "Jami` at-Tirmidhi 1046",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 1049,
      "title": "Jami` at-Tirmidhi 1047",
      "narrator": "Ja'far bin Muhammad narrated that:",
      "english_text": "His father said: \"The one who made the Lahd in the grave of the Messenger of Allah was Abu Talhah. And the one who placed the velvet cloth under him was Shuqran a freed slave of Messenger of Allah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 1050,
      "title": "Jami` at-Tirmidhi 1048",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"A red velvet cloth was placed in the grave of the Prophet.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 1051,
      "title": "Jami` at-Tirmidhi 1049",
      "narrator": "Abu Wa'il narrated:",
      "english_text": "\"Ali said to Abu Al-Hayyaj Al-Asadi: 'I am dispatching you with what the Prophet dispatched me: \"That you not leave an elevated grave without leveling it, nor an image without erasing it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 1052,
      "title": "Jami` at-Tirmidhi 1050",
      "narrator": "Abu Marthan Al-Ghanawi narrated that:",
      "english_text": "The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 1053,
      "title": "Jami` at-Tirmidhi 1051",
      "narrator": "(Another chain) from Abu Marthad Al-Ghanawi :",
      "english_text": "from the Prophet, similar (to no. 1050), but it does not contain \"From Abu Idris\" and this is what is correct.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 1054,
      "title": "Jami` at-Tirmidhi 1052",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Messenger of Allah prohibited plastering graves, writing on them, building over them, and treading on them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 1055,
      "title": "Jami` at-Tirmidhi 1053",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah passed by the graves of Al-Madinah, so he turned his face towards them and said: (As-Salamu alaikum ya ahlul-qubur! Yaghfirul-lahu lana wa lakun, antum salafuna wa nahnu bil-athar.) 'Peace be upon you O inhabitants of the grave! May Allah forgive us and you; you are our predecessors and we are to follow you.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 1056,
      "title": "Jami` at-Tirmidhi 1054",
      "narrator": "Sulaiman bin Buraidah narrated from his father that:",
      "english_text": "The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 1057,
      "title": "Jami` at-Tirmidhi 1055",
      "narrator": "Abdullah bin Abi Mulaikah said:",
      "english_text": "\"Abdur-Rahman bin Abi Bakr died in Al-Hubshi\" He said: \"He was carried to Makkah to be buried there. So when Aishah arrived she went to the grave of Abdur-Rahman bin Abi Bakr and she said: \"We were like two drinking companions of Jadhimah for such a long time that they would say: 'They will never part.' So when we were separated it was as if I and Malik - due to the length of unity - never spent a night together.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 1058,
      "title": "Jami` at-Tirmidhi 1056",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Indeed the Messenger of Allah cursed the women who visit the graves.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 1059,
      "title": "Jami` at-Tirmidhi 1057",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet entered a grave during the night, so a torch was lit for him. He took it (the deceased) in from the direction of the Qiblah, and he said: 'May Allah have mercy upon you, you were often invoking (Allah) by reciting the Qur'an.' And he said: 'Allahu Akbar four times.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 1060,
      "title": "Jami` at-Tirmidhi 1058",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"A funeral (procession) passed by the Messenger of Allah and they were praising him with good statements. So the Messenger of Allah said: 'Granted.' Then he said: 'You are Allah's witnesses on the earth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 1061,
      "title": "Jami` at-Tirmidhi 1059",
      "narrator": "Abu Al-Aswad Ad-Dill narrated:",
      "english_text": "\"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 1062,
      "title": "Jami` at-Tirmidhi 1060",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 1063,
      "title": "Jami` at-Tirmidhi 1061",
      "narrator": "Abdullah bin Mas'ud narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 1064,
      "title": "Jami` at-Tirmidhi 1062",
      "narrator": "Abdurabbih bin Bariq Al-Hanafi said:",
      "english_text": "\"I heard my grandfather, the father of my mother, Simak bin Al-Walid Al-Hanadi narrating, that he heard Ibn Abbas narrated, that he heard the Messenger of Allah saying: \"Whoever has two predecessors (in death) among my Ummah, then Allah will admit them into Paradise.\"So Aishah said to him: \"What about one from your Ummar who has one precessor?\" He (pbuh) said: \"And whoever has one predecessor O Muwaffaqqah!\" So she said: \"What about one who does not have a predecessor from your Ummah?\" He said: \"I am the predecessor for my Ummah: you will never suffer (in grief) for (the loss of) anyone similar to me.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 1065,
      "title": "Jami` at-Tirmidhi 1063",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 1066,
      "title": "Jami` at-Tirmidhi 1064",
      "narrator": "Abu Ishaq As-Sabi'i said:",
      "english_text": "\"Sulaiman bin Surad said to Khalid bin Urfutah - or, Khalid said to Sulaiman - 'Did you hear the Messenger of Allah saying: \"Whoever is killed by his stomach then he will not be punished in the grave\"?' One of them said to the other: \"Yes.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 1067,
      "title": "Jami` at-Tirmidhi 1065",
      "narrator": "Usamah bin Zaid narrated that:",
      "english_text": "The Prophet mentioned the plague and said: \"It is an abiding punishment or chastisement that was sent upon a group of the children of Isra'il. So when it occurs in a land while you are in it, then do not leave it. And when it occurs in a land while you are not in it, then do not enter it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 1068,
      "title": "Jami` at-Tirmidhi 1066",
      "narrator": "Ubadah bin As-Samit narrated that:",
      "english_text": "The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 1069,
      "title": "Jami` at-Tirmidhi 1067",
      "narrator": "Sa'd bin Hisham narrated that:",
      "english_text": "Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 1070,
      "title": "Jami` at-Tirmidhi 1068",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "\"A man killed himself, so the Prophet did not perform Salat over him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 1071,
      "title": "Jami` at-Tirmidhi 1069",
      "narrator": "Abdullah bin Abi Qatadah narrated from his father that:",
      "english_text": "The Prophet was brought a (deceased) man to perform Salat over. So the Prophet said: \"Pray for your companion; for indeed he had a debt upon him.\" Abu Qatadah said: \"It shall be upon me.\" So the Messenger of Allah said: \"To pay it off?\" (He said: \"To pay it off.\") So he performed the prayer for him.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 1072,
      "title": "Jami` at-Tirmidhi 1070",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"A deceased man would be brought to the Messenger of Allah while a debt was due upon him. So he would say: 'Has he left anything to pay off his debt?' If he was told that he had left something to pay it then he would pray (the funeral prayer) for him. Otherwise he would tell the Muslims: 'Pray for your companion.' So when Allah granted him the victories, he stood and said: 'I am more worthy in the case of the believers than they themselves are. So whoever among the believers dies and leaves a debt behind, then it is up to me to fulfill it. And whoever leaves wealth behind, then it is for his heirs.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 1073,
      "title": "Jami` at-Tirmidhi 1071",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 1074,
      "title": "Jami` at-Tirmidhi 1072",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Messenger of Allah said: \"When a person dies, he is shown his place [both in the morning and the evening]. If he is one of the people of Paradise; he is shown his place among the people of Paradise, and if he one of the people of the Fire; he is shown his place among the people of the Fire. Then it is said to him: 'This is your place until Allah resurrects you on the Day of Judgment.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 1075,
      "title": "Jami` at-Tirmidhi 1073",
      "narrator": "Abdullah narrated that:",
      "english_text": "The Prophet said: \"Whoever consoles a person with an affliction, then he gets the same reward as him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 1076,
      "title": "Jami` at-Tirmidhi 1074",
      "narrator": "Abdullah bin Amr narrated that:",
      "english_text": "The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 1077,
      "title": "Jami` at-Tirmidhi 1075",
      "narrator": "Ali bin Abi Talib narrated that:",
      "english_text": "The Messenger of Allah said to him: \"O Ali! Three are not to be delayed: Salat when it is due, the funeral when it is presented, and (marriage) for the single woman when someone compatible is found.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 1078,
      "title": "Jami` at-Tirmidhi 1076",
      "narrator": "Abu Barzah narrated that :",
      "english_text": "The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 1079,
      "title": "Jami` at-Tirmidhi 1077",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 1080,
      "title": "Jami` at-Tirmidhi 1078",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 1081,
      "title": "Jami` at-Tirmidhi 1079",
      "narrator": "(Another chain) Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"",
      "grade": "Hasan (Darussalam)"
    }
  ]
}