{
  "chapterNum": 2,
  "english_title": "The Book on Salat (Prayer)",
  "totalHadiths_inChapter": 304,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 149,
      "title": "Jami` at-Tirmidhi 149",
      "narrator": "Ibn Abbas narrated that :",
      "english_text": "the Prophet said: \"Jibril (peace be upon him) led me (in Salat) twice at the House. So he prayed Zuhr the first time when the shadow was similar to (the length of) the strap a sandal. Then he prayed Asr when everything was similar (to the length of) its shadow. Then he prayed Maghrib when the sun had set and the fasting person breaks fast. Then he prayed Isha when the twilight had vanished. Then he prayed Fajr when Fajr (dawn) began, and when eating is prohibited for the fasting person. The second time he prayed Zuhr when the shadow of everything was similar to (the length of) it, at the time of Asr the day before. Then he prayed Asr when the shadow of everything was about twice as long as it. Then he prayed Maghrib at the same time as he did the first time. Then he prayed Isha, the later one, when a third of the night had gone. Then he prayed Subh when the land glowed. Then Jibril turned towards me and said: \"O Muhammad! These are the times of the Prophets before you, and the (best) time is what is between these two times.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 150,
      "title": "Jami` at-Tirmidhi 150",
      "narrator": "Jabir bin Abdullah narrated that :",
      "english_text": "Allah's Messenger said: \"Jibril led me (in Salat)\". He mentioned something similar to the Hadith of Ibn Abbas (no. 149) in meaning, but he did not mention: \"At the time of Asr the day before.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 151,
      "title": "Jami` at-Tirmidhi 151",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Indeed for (the time of) Salat (there is a) beginning and an end. The beginning of the time for the Zuhr prayer is when the sun passes the zenith, and the end of its time is when the time for Asr enters. The beginning of the time for the Asr [prayer] is when its time enters, and the end of its time is when the sun yellows (turns pale). The beginning of the time of Maghrib is when the sun as set, and the end of its time is when the twilight has vanished (i.e., the horizon is invisible because of darkness). The beginning of the time for Isha, the later one, is when the horizon has vanished, and the end of its time is when the night is at its half. The beginning of the time for Fajr is when Fajr begins, and its end is when the sun rises.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 152,
      "title": "Jami` at-Tirmidhi 152",
      "narrator": "Sulaiman bin Buraidah narrated that his father said:",
      "english_text": "\"A man came to the Prophet to ask him about the times for Salat. So he said: 'Stay with us, In sha Allah.' So he ordered Bilal to call the Iqamah when Fajr began, then he ordered him to call the Iqamah when the Sun passed the zenith, then he prayed Zuhr. Then he ordered him to call the Iqamah to pray Asr while the sun was elevated and white. Then he ordered him (to call the Iqamah for) Maghrib when the (top) edge of the sun had set. Then he ordered him to call the Iqamah for Isha when the horizon (twilight) had vanished. Then he ordered him in the morning (to give the call for Fajr prayer), when the light of Fajr glowed. Then he ordered (him to call the Iqamah for) Zuhr, so he waited well until it had cooled. Then he ordered (him to call the Iqamah for) Asr, so he calIed the Iqamah while the sun was later in its position than what it was (the day before). Then he ordered him to delay Maghrib until right before the twilight had disappeared. Then he ordered (him to call the Iqamah for) Isha, so he called the Iqamah when a third of the night had passed. Then he said: 'Where is the one who asked about he times for the Salat?' So the man said, 'It is I.' So he said: 'The times [or the Salat are what are between these two.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 153,
      "title": "Jami` at-Tirmidhi 153",
      "narrator": "Aishah narrated:",
      "english_text": "\"Allah's Messenger would pray Subh (at such time that) the women would leave (after the prayer)\" - AI-AnsarI (one of the narrators) said - the women would pass by wrapped in their Mirts and they would not be recognizable due to the darkness.\" And Qutaibah said: \"covered.\" (instead of \"wrapped.\")",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 154,
      "title": "Jami` at-Tirmidhi 154",
      "narrator": "Rafi bin Khadlj said:",
      "english_text": "\"I heard Allah's Messenger saying: 'Perform Fajr at AI-Isfar, for indeed its reward is greater.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 155,
      "title": "Jami` at-Tirmidhi 155",
      "narrator": "Aishah narrated:",
      "english_text": "\"I have not seen anyone who hastened Zuhr more than Allah's Messenger nor Abu Bakr, nor Umar.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 156,
      "title": "Jami` at-Tirmidhi 156",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Allah's Messenger prayed Zuhr when the sun had passed the zenith.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 157,
      "title": "Jami` at-Tirmidhi 157",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"In very hot weather, delay the (Zuhr) prayer until it becomes (a bit) cooler, because the severity of heat is from the raging of the Hell.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 158,
      "title": "Jami` at-Tirmidhi 158",
      "narrator": "Abu Dharr narrated:",
      "english_text": "\"Allah's Messenger was on a journey and Bilal was with him. So he wanted to call for the prayer, but he (the Prophet) said: 'Let it get cooler.' Then he wanted to call for the prayer, so Allah's Messenger said: 'Let it get to the cooler time of Zuhr.'\" He (i.e., Abu Dharr) said: \"Until we saw the shadows of the hillocks, then he commanded that the Iqamah be called and then led the people in prayer. Allah's Messenger said: 'The severity of heat is from the raging of Hell, so wait until it becomes cooler for the (Zuhr) prayer.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 159,
      "title": "Jami` at-Tirmidhi 159",
      "narrator": "Urwah narrated from Aishah:",
      "english_text": "\"Allah's Messenger prayed Asr while the sun was (shining) in her chamber, (and) no shadow appeared in her chamber.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 160,
      "title": "Jami` at-Tirmidhi 160",
      "narrator": "Al-Ala bin Abdur-Raman narrated that :",
      "english_text": "he visited Anas bin Malik in his home in Al Basrah after finishing Zuhr, and his home was next to the Masjid. So he said: 'Stand to pray Asr.\" He (Al-Ala) said: \"So we stood to pray. When we were finished he (Anas) said: 'I heard Allah's Messenger saying: \"That is the prayer of the hypocrite. He sits watching the sun, until when it is between the horns of the Shaitan he stands and pecks out four (units of prayer), not remembering Allah in them but a little.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 161,
      "title": "Jami` at-Tirmidhi 161",
      "narrator": "Umm Salamah narrated:",
      "english_text": "\"Allah's Messenger would hasten Zuhr more than you (people), while you (people) hasten Asr more than him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 162,
      "title": "Jami` at-Tirmidhi 162",
      "narrator": "Narrator not mentioned:",
      "english_text": "[And I have in my book: \"Ali bin Hujr informed me from lsma'il bin Ibrahim, from Ibn Juraij.\"]",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 163,
      "title": "Jami` at-Tirmidhi 163",
      "narrator": "Similar narration is reported by Bishr ibn Mu'adh Al-Bari who said that :",
      "english_text": "Isma'il ibn Ulayyah narrated to him from Ibn Juraij. This latter chain is more correct.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 164,
      "title": "Jami` at-Tirmidhi 164",
      "narrator": "Salmah bin AI-Akwa narrated:",
      "english_text": "\"Allah's Messenger prayed Maghrib when the sun had set and it (the sun) had hidden in the veil (of darkness).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 165,
      "title": "Jami` at-Tirmidhi 165",
      "narrator": "An-Nu'man bin Bashir said:",
      "english_text": "\"I am the most knowledgeable among the people about the prescribed time of this prayer: Allah's Messenger would pray it when the moon set on the third (of the month).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 166,
      "title": "Jami` at-Tirmidhi 166",
      "narrator": "An-Nu'man bin Bashir said:",
      "english_text": "A similar narration (from another chain linking to) this chain is also reported.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 167,
      "title": "Jami` at-Tirmidhi 167",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"If it were not that it would be a hardship on my Ummah, then I would have ordered you to delay Isha until the third of the night, or its half.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 168,
      "title": "Jami` at-Tirmidhi 168",
      "narrator": "Abu Barzah narrated:",
      "english_text": "\"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 169,
      "title": "Jami` at-Tirmidhi 169",
      "narrator": "Umar bin Al-Khattab narrated:",
      "english_text": "\"Allah's Messenger would talk during the night with Abu Bakr about matters concerning the Muslims while I was with them.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 170,
      "title": "Jami` at-Tirmidhi 170",
      "narrator": "Umm Farwah - and she was one of those who gave pledge of allegiance to the Prophet  - narrated:",
      "english_text": "\"The Prophet was asked: 'Which deed is the best?' So he said: 'Salat in the beginning of its time.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 171,
      "title": "Jami` at-Tirmidhi 171",
      "narrator": "Ali bin AbI Talib narrated that :",
      "english_text": "the Prophet said to him: 'Ali! Three are not to be delayed: Salat when its time comes, a funeral whet it (a prepared body) is present, and the (marriage of a) single woman when there is an equal for her.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 172,
      "title": "Jami` at-Tirmidhi 172",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "Allah's Messenger said: \"The beginning of the time for Salat is pleasing to Allah, and the end of its time is pardoned by Allah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 173,
      "title": "Jami` at-Tirmidhi 173",
      "narrator": "Abu Amr Ash-Shaibani narrated:",
      "english_text": "\"A man said to Ibn Mas'ud: 'Which deed is most virtuous?' He said: 'I asked Allah's Messenger (that). He said: \"Salat at the beginning of its time.\" I asked him: \"What is after that O Messenger of Allah?\" He said: \"Being dutiful to one's parents.\" I said: \"What is after that [O Messenger of Allah]?\" He said: \"Jihad in the Way of Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 174,
      "title": "Jami` at-Tirmidhi 174",
      "narrator": "Aishah narrated:",
      "english_text": "\"Allah's Messenger did not pray any Salat at the end of its time two times, until Allah took him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 175,
      "title": "Jami` at-Tirmidhi 175",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "the Prophet said: \"Whoever misses the Asr prayer, then it is as if he was robbed of his family and his property.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 176,
      "title": "Jami` at-Tirmidhi 176",
      "narrator": "Abu Dharr narrated that :",
      "english_text": "the Prophet said: \"O Abu Dharr! There will be leaders after me who cause the Salat to die; so perform the Salat during its time. If you pray (with them) during its time, then that will be voluntary Salat for you, if not, then you will have attained your Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 177,
      "title": "Jami` at-Tirmidhi 177",
      "narrator": "Abu Qatadah narrated:",
      "english_text": "\"They asked the Prophet about when they sIept past the Salat. He said: 'There is no negligence in sleep, negligence is only while one is awake. So when one of you forgets a Salat, or sleeps through it, then let him pray it when he remembers it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 178,
      "title": "Jami` at-Tirmidhi 178",
      "narrator": "Anas (bin Malik) narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever forgets a Salat then he is to pray it when he remembers it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 179,
      "title": "Jami` at-Tirmidhi 179",
      "narrator": "Abdullah (bin Mas'ud] narrated:",
      "english_text": "\"The idolaters kept Allah's Messenger distracted from four prayers on the Day of Al-Khandaq (the battle of the Trench) until as much as Allah willed of the night had passed. So he ordered Bilal to call the Adhan, then he called the Iqamah to Zuhr, then he called the Iqamah to pray Asr, then he called the Iqamah to pray Maghrib, then he called the Iqamah to pray Isha.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 180,
      "title": "Jami` at-Tirmidhi 180",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"On the Day of Al-Khandaq (the battle of the Trench), Umar bin Al-Khattab came cursing the disbelievers of Quraish and said: 'O Allah's Messenger! I could not offer he Asr prayer until the sun was about to set.' The Prophet said: 'By Allah! I too have not offered the Salat.'\" So he said: \"We descended into Buthan, Allah's Messenger performed Wudu and we too performed Wudu. Allah's Messenger prayed Asr after the sun had set, then after it he prayed Maghrib.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 181,
      "title": "Jami` at-Tirmidhi 181",
      "narrator": "Abdullah bin Mas'ud narrated that :",
      "english_text": "Allah's Messenger said: \"Salatul-Wusta is the Asr prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 182,
      "title": "Jami` at-Tirmidhi 182",
      "narrator": "Smurah bin Jundub narrated that :",
      "english_text": "the Prophet said: \"Salatul-wusta is the Asr prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 183,
      "title": "Jami` at-Tirmidhi 183",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"I head more than one of the Companions of the Prophet; Umar bin Al-Khattab among, and he was one of the most beloved among them to me - (narrating) that Allah's Messenger prohibited the Salat after Fajr until the sun had risen, and the Salat after Asr until the sun had set.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 184,
      "title": "Jami` at-Tirmidhi 184",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet only performed the two rak'ah (units of prayer) after Asr because some wealth came to him which distracted him from the two rak'ah after Zuhr, so he prayed them after Asr, then he did not repeat that.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 185,
      "title": "Jami` at-Tirmidhi 185",
      "narrator": "Abdullah bin Mughaffal narrated that :",
      "english_text": "the Prophet said: \"Between every two calls (to prayer) there is a Salat for whoever wills.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 186,
      "title": "Jami` at-Tirmidhi 186",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"Whoever catches a Rak'ah of Subh before the sun has risen, then he has caught Subh. Whoever catches a Rak'ah of Asr before the sun has set, then he has caught Asr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 187,
      "title": "Jami` at-Tirmidhi 187",
      "narrator": "Ibn Abbas said:",
      "english_text": "\"Allah's Messenger combined the Zuhr and Asr (prayers), and the Maghrib and Isha (prayers) in Al-Madinah, without being in a state of fear, nor due to rain.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 188,
      "title": "Jami` at-Tirmidhi 188",
      "narrator": "Ibn Abbas narrated that :",
      "english_text": "the Prophet said: \"Whoever combines two prayers without any excuse then he has committed something from the major sins.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 189,
      "title": "Jami` at-Tirmidhi 189",
      "narrator": "Albdullah bin Zaid narrated:",
      "english_text": "\"When we awoke, we went to Allah's Messenger to inform him of the dream. He said: 'Indeed this dream is true. So go to Bilal, for he has a better and louder voice than you. Convey to him what was said to you, so that he may call (to the prayer) with that.'\" He said: \"When Umar bin Al-Khattab heard Bilal calling for the prayer he went to Allah's Messenger, and he was dragging his Izar, (as he was hurrying) saying: 'O Allah's Messenger! By the One Who sent you with the truth! I dreamt the same as what he said.''' He said: \"So Allah's Messenger said: 'To Allah is the praise, so that confirms it even more.'''",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 190,
      "title": "Jami` at-Tirmidhi 190",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"When the Muslims arrived in AI-Madinah, they used to assemble for the Salat, and guess the time for it there was no one who called for it (the prayer). One day they discussed that and some of them said that they should use a bell like the bell the Christians use. Others said they should use a trumpet like the horn the Jews use. But Umar [bin Al-Khattab] said: 'Wouldn't it better if we had a man call for the prayer?'\" He said: \"So Allah's Messenger said: 'O Bilal! Stand up and call for the Salat.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 191,
      "title": "Jami` at-Tirmidhi 191",
      "narrator": "Abu Mahdhurah narrated that :",
      "english_text": "Allah's Messenger sat with him and taught him the Adhan word for word. Ibrahim said, \"It is the same as our Adhan.\" Bishr said: \"So I said to him, 'Repeat it to me.' So he described the Adhan with At-Tarjl'.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 192,
      "title": "Jami` at-Tirmidhi 192",
      "narrator": "Abu Mahdhurah narrated that :",
      "english_text": "the Prophet taught him the Adhan with nineteen phrases, and the Iqamah with seventeen phrases.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 193,
      "title": "Jami` at-Tirmidhi 193",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Bilal was ordered to make the phrases of the Adhan even, and the phrases of the Iqamah odd.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 194,
      "title": "Jami` at-Tirmidhi 194",
      "narrator": "Abdullah bin Zaid said:",
      "english_text": "\"Allah's Messenger would say each phrase of the call (for prayer) two times, for the Adhan and the Iqamah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 195,
      "title": "Jami` at-Tirmidhi 195",
      "narrator": "Jabir [bin Abdullah] narrated:",
      "english_text": "\"Allah's Messenger said to Bilal: \"O Bilal! When you call the Adhan then do so deliberately and slowly, and when you call the Iqamah then be quick. Allow enough time between your Adhan and Iqamah for the person eating to finish what he is eating, the person drinking to finish what he is drinking, and the one who needs time to relive himself, and do not stand until you see me.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 196,
      "title": "Jami` at-Tirmidhi 196",
      "narrator": "Jabir [bin Abdullah] narrated:",
      "english_text": "(Another chain for) a similar narration (as no. 195).",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 197,
      "title": "Jami` at-Tirmidhi 197",
      "narrator": "Abu Juhaifah narrated:",
      "english_text": "\"I saw Bilal calling the Adhan, and turning, and his (face) was following here and there, and his (index) fingers were in his ears, and Allah's Messenger was in a small red tent\" - \"I think,\" he (one of the narrators) said, \"it was made from a hide\" - so Bilal went out in front of him with an Anazah which he planted (in the ground) at Batha. Allah's Messenger prayed facing it, and a dog and a donkey passed in front of him; he was wearing a red Hullah, and it is as if I am now looking at the radiance of his shins.\" Sufyan said: \"We think that it was a Hibrah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 198,
      "title": "Jami` at-Tirmidhi 198",
      "narrator": "Bilal narrated:",
      "english_text": "\"Allah's Messenger said [to me]: 'Do not say the Tathwib for any prayer except the Fajr prayer.'\"\n\n[He said:] There is something on this topic from Abu Mahdhurah.\nAbu `Eisa said: We do not know of the Hadith of Bilal except as a narration of Abu Isra'il Al-Mula'i. Abu Isra'il did not hear this Hadith from Al-Hakam bin `Utaibah.\n\nHe said: He only reported it from Al-Hasan bin `Umarah, from Al-Hakam bin `Utaibah. Abu Isra'il's name is [Isma`il bin Abi Ishaq, and he is not strong according to the people of Hadith.\n\nThe people of knowledge have differed over the interpretation of At-Tathwib.\n\nSome of them say that At-Tathwib is when one says \"As-Salatu Khairummin An-Nawm, (prayer is better than sleep)\" for the Adhan\nof Fajr. This is the saying of Ibn Al-Mubarak and Ahmad.\n\nIshaq said something different about At-Tathwib, he said: \"[The disliked Tathwib] is something that the people started after the Prophet; when the Mu'adh-dhin\ncalls the Adhan and the people are slow in coming, so between the Adhan and the Iqamah he says:\n'Qad Qamatis-Salat, Hayya `Alasalat, Hayya `AlalFalah. (Prayer is ready, come to prayer, come to success.)\"\n\n[He said:] This Tathwib, which Ishaq mentioned, is the one that the people of knowledge dislike, which they innovated after the Prophet.\n\nBut Ibn Al-Mubarak and Ahmad explained that At-Tathwib is when the Mu'adh-dhin says: \"As-Salatu Khairum minan-Nawm, (prayer is better than sleep)\" for the Adhan of Fajr.\nAnd this is the correct saying, and it is called At-Tathawwub as well, and this is the one chosen by the people of knowledge, and it is their opinion.\n\nIt has been reported from `Abdullah bin `Umar that he would say: \"As-Salatu Khairum-minan-Nawm, (prayer is better than sleep)\" for Fajr.\n\nIt has been reported from Mujahid that he said: \"I entered a Masjid with `Abdullah bin `Umar in which the Adhan was called, and we wanted to pray in it. Then the Mu'adh-dhin said the Tathwib. So `Abdullah bin `Umar left the Masjid and said: 'Let us leave the place of this innovator' And he did not pray in it.\"\n\n[He said:] `Abdullah only disliked the Tathwib that the people invented later on.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 199,
      "title": "Jami` at-Tirmidhi 199",
      "narrator": "Ziyad bin Al-Harith As-Suda'i narrated:",
      "english_text": "\"Allah's Messenger ordered me to call the Adhan for the Fajr prayer. I called the Adhan, then Bilal wanted to call the lqamah. Allah's Messenger said: 'Indeed the brother from Suda' has called the Adhan, and whoever calls the Adhan he calls the Iqamah.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 200,
      "title": "Jami` at-Tirmidhi 200",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"None should call the Adhan except for one with Wudu.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 201,
      "title": "Jami` at-Tirmidhi 201",
      "narrator": "Ibn Shihab narrated that :",
      "english_text": "Abu Hurairah said: \"None should call (for the prayer except for one with Wudu.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 202,
      "title": "Jami` at-Tirmidhi 202",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "The Mu'adh-dhin of Allah's Messenger would wait and he would not call the Iqamah until he saw the Allah's Messenger had come out, he would call the Iqamah when he saw him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 203,
      "title": "Jami` at-Tirmidhi 203",
      "narrator": "Salim narrated from his father (Ibn Umar) that :",
      "english_text": "the Prophet said: \"Indeed Bilal calls the Adhan in the night, so eat and drink until you hear the Adhan of Ibn Umm Maktum.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 204,
      "title": "Jami` at-Tirmidhi 204",
      "narrator": "Abu Ash-Sha'tha said:",
      "english_text": "\"A man exited the Masjid after the Adhan for Asr had been called. So Abu Hurairah said: 'As for this person, he has indeed disobeyed Abul Qasim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 205,
      "title": "Jami` at-Tirmidhi 205",
      "narrator": "Malik bin Al-Huwairih said:",
      "english_text": "\"A cousin of mine and I arrived as guests of Allah's Messenger. He said to us: 'When you travel then call the Adhan and Iqamah and let the eldest of you lead the prayer.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 206,
      "title": "Jami` at-Tirmidhi 206",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet said: 'Whoever calls the Adhan for seven years, seeking reward for it, salvation from the Fire is written for him.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 207,
      "title": "Jami` at-Tirmidhi 207",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"The Imam is answerable and the Mu'adh-dhin is entrusted. O Allah! Guide the Imams and pardon the Mu'adh-dhins.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 208,
      "title": "Jami` at-Tirmidhi 208",
      "narrator": "Abu Sa'eed narrated that :",
      "english_text": "Allah's Messenger said: \"Whenyou hear the call (to prayer) then say the similar to what the Mu'adh-dhin says\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 209,
      "title": "Jami` at-Tirmidhi 209",
      "narrator": "Uthman bin Abi Al-As narrated:",
      "english_text": "\"Indeed, amount the last (of orders) Allah's Messenger ordered me with was to employ a Mu'adh-dhin who would not take a wage for his Adhan.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 210,
      "title": "Jami` at-Tirmidhi 210",
      "narrator": "Sa'd bin Abi Waqqas narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever says, when he hears the Mu'adh-dhin: (Wa Ana Ashadu An La Ilaha Illallah, Wahdahu La Sharika Lahu, Wa Anna Muhammadan Abduhu Wa Rasuluhu, Radittu Billahi Rabban Wa Bil-Islam Dinan, Wa Bi Muhammadin Rasulan) 'I too testify that none has the right to be worshiped but Allah, Alone without partners, and that Muhammad is His slave and Messenger, I am pleased with Allah as my Lord, with Islam as my religion and Muhammad as a Messenger.' - Allah will pardon his sins for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 211,
      "title": "Jami` at-Tirmidhi 211",
      "narrator": "Jabir bin Abdullah narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever says, when he hears the call: (Allahumma, rabba hadhihidda 'watit-tammati was Salatilqa'imah, ati Muhammadanil wasilata wal-Fadilata, wab'athhu Maqamun Mahmudan alladhi wa'adtahu) 'O Allah! Lord of this perfect call and established prayer, grant Muhammad Al-Wasilah and Al-Fadilah, and raise him to the praised station that you promised him' - then intercession on the Day of Resurrection is made lawful for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 212,
      "title": "Jami` at-Tirmidhi 212",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "Allah's Messenger said: \"The supplication made between the Adhan and Iqamah is not rejected.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 213,
      "title": "Jami` at-Tirmidhi 213",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"On the Night of Isra, fifty prayers were made obligatory upon the Prophet. Then it was decreased until it was made five. Then it was called out: 'O Muhammad! Indeed My Word does not change; these five prayers will be recorded for you as fifty.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 214,
      "title": "Jami` at-Tirmidhi 214",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"The five prayers, and Al-Jumuah (the Friday prayer) to Al-Jumuah are atonement for what is between them, as long as the major sins have not been committed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 215,
      "title": "Jami` at-Tirmidhi 215",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "Allah's Messenger said: \"Salat in congregation is twenty-seven degrees more virtuous than a man's Salat alone.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 216,
      "title": "Jami` at-Tirmidhi 216",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Indeed a man's Salat in the congregation is increased by twenty five rewards over his Salat alone.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 217,
      "title": "Jami` at-Tirmidhi 217",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"I was about to order my boys to collect bundles of firewood, then order Salat to be held, then burn (the homes) of the people who did not attend the Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 218,
      "title": "Jami` at-Tirmidhi 218",
      "narrator": "Mujahid said:",
      "english_text": "\"Ibn Abbas was asked about a man who fasted during the day and stood (in prayers) during the night, but he did not attend the Friday prayer nor congregational prayer. He replied: 'He is in the Fire.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 219,
      "title": "Jami` at-Tirmidhi 219",
      "narrator": "Jabir hin Yazid hin Al-Aswad [Al-Amir] narrated that his father said:",
      "english_text": "\"I attended Hajj with the Prophet. I prayed the Subh (Fajr) prayer with him in Masjid AI-Khaif.\" He said: \"When the Prophet finished, he turned (from the Qiblah) and saw two men at the back of the people who had not prayed with him. He said, 'Bring them to me.' So I brought then while they were shuddering with fear. He said: 'What prevented you from praying with us?\" They said: 'O Messenger of Allah!' We prayed at our camp.' So he said: 'Do not do that; when you pray in your camp then you come to a Masjid with a congregation, then pray with them. That will be a voluntary prayer for you.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 220,
      "title": "Jami` at-Tirmidhi 220",
      "narrator": "Abu Sa'eed narrated:",
      "english_text": "\"A man came when Allah's Messenger had already prayed, so he said: 'Which of you will give some reward to this person?' So a man stood to pray with him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 221,
      "title": "Jami` at-Tirmidhi 221",
      "narrator": "Uthman bin Affan narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever attends Isha (prayer) in congregation, then he has (the reward as if he had) stood half of the night. And whoever prays Isha and Fajr in congregation, then he has (the reward as if he had) spend the entire night standing (in prayer).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 222,
      "title": "Jami` at-Tirmidhi 222",
      "narrator": "Jundub bin Sufyan narrated that :",
      "english_text": "the Prophet said: \"Whoever prays the Subh then he is under the protection of Allah's covenant, so do not be treacherous with Allah in his covenant.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 223,
      "title": "Jami` at-Tirmidhi 223",
      "narrator": "Buraidah Al-Aslami narrated that :",
      "english_text": "the Prophet said: \"Give glad tiding to those who walk to the Masajid in the dark; of a complete light on the Day of Resurrection.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 224,
      "title": "Jami` at-Tirmidhi 224",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"The best rows for the men are the first of them, and the worst are the last of them. And the best rows for the women are the last of them, and the worst are the first of them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 225,
      "title": "Jami` at-Tirmidhi 225",
      "narrator": "Narrator not mentioned:",
      "english_text": "And the Prophet said: \"If the people knew what (reward) is in the call (Adhan) and the first row, and they found no other way to get that except drawing lots, then they would draw lots.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 226,
      "title": "Jami` at-Tirmidhi 226",
      "narrator": "Narrator not mentioned:",
      "english_text": "A Similar narration",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 227,
      "title": "Jami` at-Tirmidhi 227",
      "narrator": "An-Nu'man bin Bashir said:",
      "english_text": "\"Allah's Messenger would straighten our lines. One day he came out and saw a man whose chest was protruding from the people, so he said: 'You must straighten your lines, or Allah will cause disagreement to occur among your faces.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 228,
      "title": "Jami` at-Tirmidhi 228",
      "narrator": "Abdullah (Ibn Masud) narrated that :",
      "english_text": "the Prophet said: \"Let those among you with understanding and reason be close to me, then those after them, then those after them. And do not separate or dissention will occur among your hearts, and beware of the commotion of the markets.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 229,
      "title": "Jami` at-Tirmidhi 229",
      "narrator": "Abdul-Hamid bin Mahmud said:",
      "english_text": "\"We prayed behind one of the Amirs, the people compelled us such that we prayed between two columns. When we had prayed, Anas bin Malik said: 'We would be prevented from this during the time of Allah's Messenger.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 230,
      "title": "Jami` at-Tirmidhi 230",
      "narrator": "Hilal bin Yasar said:",
      "english_text": "\"Ziyad bin Abi Al-Ja'd took me by the hand while we were in Ar Raqqah, he made me stand before a Shaikh who was called Wabisah bin Ma'bad, from Bani Asad. Ziyad said: 'This Shaikh narrated to me that a prayed alone behind the row' - and the Shaikh was listening - 'so Allah's Messenger ordered him to repeat the Salat.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 231,
      "title": "Jami` at-Tirmidhi 231",
      "narrator": "Wabisah bin Ma'bad narrated:",
      "english_text": "\"A man prayed alone behind the row s the Prophet ordered him to repeat the Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 232,
      "title": "Jami` at-Tirmidhi 232",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"I prayed with the Prophet one night. I stood at his left, so Allah's Messenger took me by my head, from behind me, to put me on his right (side).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 233,
      "title": "Jami` at-Tirmidhi 233",
      "narrator": "Samurah bin Jundub narrated:",
      "english_text": "\"Allah's Messenger ordered us that when we were three, then one of us should stand forward.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 234,
      "title": "Jami` at-Tirmidhi 234",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"My grandmother Mutalikah invited Allah's Messenger to a meal that she prepared. He ate from it, then said: 'Stand so tht we may lead you in prayer.'\" He said: \"I got a Hasir of our which had become dark because of prolonged use, so I washed it with water. Allah's Messenger stood on it, and the orphan and I aligned behind him and the only lady stood behind us. He (Allah's Messenger) led us in two Rak'ah of prayer and then left.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 235,
      "title": "Jami` at-Tirmidhi 235",
      "narrator": "Abu Mas'ud narrated that :",
      "english_text": "Allah's Messenger said: \"The one who recites most of the Book of Allah is to lead the people (in prayers). If they are equal in recitation, then the most knowledgeable in the Sunnah among them. If they are equal regarding the Sunnah, then the earliest of them to emigrate. If they are equal in their emigration then the eldest among them. And a man is not to be led in prayer in the place of his authority, and his spot of esteem in his home is not to be sat on without his permission.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 236,
      "title": "Jami` at-Tirmidhi 236",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"When one of you leads the people in prayer then let him be brief, for indeed here are among them the young and the old, the weak and the ill. When one of you prays alone, then let him pray as he wishes.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 237,
      "title": "Jami` at-Tirmidhi 237",
      "narrator": "Anas [bin Malik] narrated:",
      "english_text": "\"Allah's Messenger was among the lightest of people in Salat with its completeness.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 238,
      "title": "Jami` at-Tirmidhi 238",
      "narrator": "Abu Sa'eed narrated that :",
      "english_text": "Allah's Messenger said: \"the key to Salat is the purification, its Tahrim is the Takbir, and its Tahlilis the Taslim, and there is no Salat for one who did not recite Al-Hamd and a Surah in the obligatory (prayer) or other prayers.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 239,
      "title": "Jami` at-Tirmidhi 239",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"When Allah's Messenger performed the Takbir for Salat he would spread his fingers.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 240,
      "title": "Jami` at-Tirmidhi 240",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"When Allah's Messenger would enter the Salat he would raise his hands while they were extended.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 241,
      "title": "Jami` at-Tirmidhi 241",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever performs Salat for Allah for forty days in congregation, catching the first Takbir, two absolutions are written for him: absolution from the Fire, and absolution from the Fire, and absolution from hypocrisy.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 242,
      "title": "Jami` at-Tirmidhi 242",
      "narrator": "Abu Sa'eeed Al Khudri narrated:",
      "english_text": "\"When Allah;s Messenger stood for Salat during the night, he would say the Takbir (Allahu Akbar), then say: (Subhanaka Allahumma wa bihamdika wa Tabarakasmuka wa Ta'ala Jadduka wa la ilaha ghairuk.) 'Glorious You are O Allah, and with Your praise, and blesses is Your Name, and exalted is Your majesty, and none has the right to be worshipped but You' Then he would say: (A'udhu Bilahi As-Sami'il-Alimi min Ash-Shaitanir-Rajimi, min Hamzihi Wa Nafkhihi wa Nafthihi.)\" 'Allah is undoubtedly the greatest.' (Allahu Akbaru Kabira). Then he would say: 'I seek refuge in Allah the All-Hearing, the All-Knowing, from the cursed Shaitan, from his madness, his arrogance, and his poetry.'",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 243,
      "title": "Jami` at-Tirmidhi 243",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Prophet opened the Salat he would say: (Subhanaka Allahumma wa bihamdika wa tabarakasmuka, wa ta'ala jadduka wa la ilaha ghairuk)\" 'Glorious You are O Allah, and with Your praise, and blessed is Your Name, and exalted is Your majesty, and none has the right to be worshipped but You.'",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 244,
      "title": "Jami` at-Tirmidhi 244",
      "narrator": "Ibn Abdullah bin Mughaffal narrated:",
      "english_text": "\"While I was praying, I said: Bismillahir-Rahmanir-Rahim \"In the Name of Allah, the Merciful, the Beneficent.\" My father heard me and said: \"O my son this is a newly invented matter, beware of the newly-invented.'\" He (Ibn Abdullah) said: \"I have not seen any one of the Companions of Allah's Messenger who hated a newly invented matter in Islam more than him. And he said: 'Ihave performed Salat with the Prophet, and with Abu Bakr, and Umar, and with Uthman. I did not hear any one of them saying it. So do not say it. When you are performing Salat say: Al-Hamdu lilahi Rabbil-Alamin \"All praise is due to Allah the Lord of all that exists.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 245,
      "title": "Jami` at-Tirmidhi 245",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet would open his Salat with (Bismillahir-Rahmanir-Rahim).\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 246,
      "title": "Jami` at-Tirmidhi 246",
      "narrator": "Anas narrated:",
      "english_text": "\"Allah's Messenger, Abu Bakr, Umar and Uthman opened the Salat with (Al-Hamdu-lillahi rabbil-alamin).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 247,
      "title": "Jami` at-Tirmidhi 247",
      "narrator": "Ubadah bin As-Samil narrated that :",
      "english_text": "the Prophet said: \"There is no Salat for the one who does not recite Fatihatil-Kitab.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 248,
      "title": "Jami` at-Tirmidhi 248",
      "narrator": "Wa'il bin Hujr narrated:",
      "english_text": "\"I heard the Prophet recite: (Not (the way) of those who earned Your anger, nor those who went astray) and he said: 'Amin.' And he stretched it out with his voice.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 249,
      "title": "Jami` at-Tirmidhi 249",
      "narrator": "(Another chain) from Wa'il bin Hujr who narrated it from :",
      "english_text": "the Prophet, and it is similar to the narrations of Sufyan from Salamah bin Kuhail",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 250,
      "title": "Jami` at-Tirmidhi 250",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said \"When the Imam says 'Amin' then (all of you) say 'Amin.' For whoever's 'Amin' concurs with the 'Amin' of the angels, then his past sins will be forgiven.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 251,
      "title": "Jami` at-Tirmidhi 251",
      "narrator": "Al-Hasan narrated that :",
      "english_text": "Samurah said: \"there are two pauses that I preserved from Allah's Messenger.\" But Imran bin Husain rejected that and said: \"We preserved one pause.\" \"So we wrote to Ubayy bin Ka'b in Al-Madinah. Ubayy wrote that Samurah was correct.\" Sa'eed said: \"We said to Qatadah: 'What are those two pauses?' He said: 'When he entered into his Salat, and when he finished his recitation.' Then he (Qatadah) said after that: 'And when he recited (Nor those who went astray.)' And he said: 'He liked to pause when he finished the recitation until he caught his breath.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 252,
      "title": "Jami` at-Tirmidhi 252",
      "narrator": "Qabisah bin Hulb narrated from :",
      "english_text": "his father who said: \"Allah's Messenger lead us in prayer and hold his left hand with his right.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 253,
      "title": "Jami` at-Tirmidhi 253",
      "narrator": "Abdullah bin Mas'ud narrated:",
      "english_text": "\"Allah's Messenger would say the Takbir for every lowering and raising, standing and sitting, and (so did) Abu Bakr and Umar.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 254,
      "title": "Jami` at-Tirmidhi 254",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger would say the Takhir while he was going down.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 255,
      "title": "Jami` at-Tirmidhi 255",
      "narrator": "Salim narrated from :",
      "english_text": "his father (Ibn Umar) who said: \"I saw Allah's Messenger when he opened the Salat, raising his hands to the level of his shoulders, and (again) when he bowed, and when he raised his head from bowing.\" In his narration, Ibn Abi Umar added: \"And he wuld not raise them between the two prostrations.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 256,
      "title": "Jami` at-Tirmidhi 256",
      "narrator": "Salim narrated:",
      "english_text": "Same as 255 (above) with a different chain",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 257,
      "title": "Jami` at-Tirmidhi 257",
      "narrator": "Alqamah narrated that :",
      "english_text": "Abdullah bin Mas'ud said: \"Shall I not demonstrate the Salat of Allah's Messenger to you?\" Then he offered Salat and he did not raise his hands except while saying the first Takbir.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 258,
      "title": "Jami` at-Tirmidhi 258",
      "narrator": "Abu Abdur-Rahman As-Sulami said:",
      "english_text": "\"Umar bin Al-Khattab [may Allah be pleased with him] said to us: 'The knees are the Sunnah for you, so hold the knees.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 259,
      "title": "Jami` at-Tirmidhi 259",
      "narrator": "Sa'd bin Abi Waqas said:",
      "english_text": "\"We would do that, but then we were prohibited from it, and we were ordered to put our hands on our knees.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 260,
      "title": "Jami` at-Tirmidhi 260",
      "narrator": "Abbas bin Sahl [bin Sa'd] narrated:",
      "english_text": "\"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: 'I am the most knowledgeable among you of the Salat of Allah's Messenger: Allah's Messenger would bow and place his hands on his knees as if he was grasping them, and he would draw his forearms to hold them away from his sides.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 261,
      "title": "Jami` at-Tirmidhi 261",
      "narrator": "Ibn Mas'ud narrated that :",
      "english_text": "the Prophet said: \"When one of you bows then says while he is bowing: (Subhana Rabbiyal Azim) 'Glorious is my Lord the Magnificent' three times, then he has completed his bowing. And that is the least of it. And when he prostrates and says while prostrating: (Subhana Rabbiyal A'la) 'Glorious is my Lord the Most High' three times, then he has completed his prostrations, and that is the least of it.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 262,
      "title": "Jami` at-Tirmidhi 262",
      "narrator": "Hudhaifah narrated that :",
      "english_text": "he performed Salat with the Prophet, and that while he was bowing he would say: (Subhana Rabbiyal Azim); \"Glorious is my Lord the Magnificent\" and while prostrating: (Subhana Rabbiyal A'la) 'Glorious is my Lord the Most High.' And he would not recite an Ayah mentioning mercy, except that he would stop and ask (for mercy), and he would not recite an Ayah mentioning punishment, except that he would stop and seek refuge (with Allah from it).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 263,
      "title": "Jami` at-Tirmidhi 263",
      "narrator": "(Another similar narration) This Hadith has been narrated from Hudhaifah :",
      "english_text": "from another route: \"That he performed Salat during the night with the Prophet\" and he mentioned the Hadith.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 264,
      "title": "Jami` at-Tirmidhi 264",
      "narrator": "Ali bin Abi Talib narrated:",
      "english_text": "\"The Prophet prohibited wearing Qassi, and that which is dyed with safflower, and from the gold ring, and from reciting the Quran while bowing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 265,
      "title": "Jami` at-Tirmidhi 265",
      "narrator": "Abu Mas'ud Al-Ansari [Al-Badri] narrated that :",
      "english_text": "Allah's Messenger said: \"The Salat is not acceptable if a man is not at rest - meaning his back - while bowing and prostrating.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 266,
      "title": "Jami` at-Tirmidhi 266",
      "narrator": "Ali bin Abi Talib narrated:",
      "english_text": "\"When Allah's Messenger would raise his head from bowing he would say: (Sami Allahi liman hamidal. Rabba na lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'a ma bainahuma wa mil'a ma shi'ia min shay'in ba'd) 'Allah listens to those who praise Him. O our Lord! And to You is the praise that fills the heavens and fills the earth, and fills what is between them, and fills whatever there is beyond that You will.' He said: There are narrations on this topic from Ibn Umar, Ibn Abbas, Ibn Abi Awfa, Abu Juhaifa, and Abu Sa'eed.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 267,
      "title": "Jami` at-Tirmidhi 267",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"When the Imam says:  (Sami Allahu liman hamidah) 'Allah listens to those who praise Him. Then (all of you) say: (Rabbana wa lakal-hamd) 'O our Lord! And to You is the praise for whoever's saying concurs with the saying of the angels, then his past sins will be forgiven.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 268,
      "title": "Jami` at-Tirmidhi 268",
      "narrator": "Wa'il bin Hujr narrated:",
      "english_text": "\"I saw Allah's Messenger when he prostrated placing his knees (on the ground) before his hands, and when he got up, he raised his hands before his knees.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 269,
      "title": "Jami` at-Tirmidhi 269",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said; \"Is it that one of you intends to kneel in his Salat with the kneeling of the camel?\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 270,
      "title": "Jami` at-Tirmidhi 270",
      "narrator": "Abu Humaid As-Sa'idi narrated:",
      "english_text": "\"When the Prophet would prostrate, he placed his nose and his forehead on the ground, and he held his forearms away from his sides, and he placed his hands parallel to his shoulders.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 271,
      "title": "Jami` at-Tirmidhi 271",
      "narrator": "Abu Ishaq narrated:",
      "english_text": "\"I said to Al-Bara bin Azib: 'Where would the Prophet place his face when he prostrated?' He said: 'Between his hands.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 272,
      "title": "Jami` at-Tirmidhi 272",
      "narrator": "Al-Abbas bin Abdul-Muttalib narrated that he heard :",
      "english_text": "Allah's Messenger Saying: \"When the worshipper prostrates with him: His face, his hands, his knees, and his feet.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 273,
      "title": "Jami` at-Tirmidhi 273",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet ordered that one prostrate on seven bones and that he not gather his hair nor his garment.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 274,
      "title": "Jami` at-Tirmidhi 274",
      "narrator": "Ubaidallah bin Abdullah bin Arqam Al-Khuza'I narrated from his father (Abdullah bin Arqam), who said:",
      "english_text": "\"I was with my father at the plains of Namirah. I passed by a mount and saw Allah's Messenger standing in Salat.\" He said: \"I was looking at the earthiness of his armpits when he prostrated.\" [That is]: \"Whiteness.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 275,
      "title": "Jami` at-Tirmidhi 275",
      "narrator": "Jabir narrated that :",
      "english_text": "the Prophet said: \"When one of you prostrates, then let him be balanced, and let him not lay his forearms down like the lying of the dog.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 276,
      "title": "Jami` at-Tirmidhi 276",
      "narrator": "Anas narrated that :",
      "english_text": "Allah's Messenger said: \"Be balanced in the prostration, and let one of you not spread his forearms (on the ground) in the Salat like the spreading of the dog.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 277,
      "title": "Jami` at-Tirmidhi 277",
      "narrator": "Amir bin Sa'd [bin Abi Waqqas] narrated from his father:",
      "english_text": "\"The Prophet ordered placing the hands (on the ground) keeping the feet erect. (by resting feet on the toes and making the tips of the toes facing the Qiblah).\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 278,
      "title": "Jami` at-Tirmidhi 278",
      "narrator": "(Another chain that) Amir bin Sa'd narrated:",
      "english_text": "\"The Prophet ordered placing the hands (on the ground).\" And he mentioned in it: \"From his father.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 279,
      "title": "Jami` at-Tirmidhi 279",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "\"The Salat of Allah's Messenger (was such that) when he bowed, and when he raised his head from bowing, and when he prostrated, and when he raised his head from prostration it (all) was nearly the same.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 280,
      "title": "Jami` at-Tirmidhi 280",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "(Another chain) which is similar.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 281,
      "title": "Jami` at-Tirmidhi 281",
      "narrator": "Al-Bara said:",
      "english_text": "\"When we performed Salat behind Allah's Messenger, he would raise his head from bowing, and no man among us would bend his back until Allah's Messenger prostrated, then we prostrated.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 282,
      "title": "Jami` at-Tirmidhi 282",
      "narrator": "Ali narrated:",
      "english_text": "\"Allah's Messenger said to me: 'O Ali! I love for you what I love for myself, and I dislike for you what I dislike for myself. Do not squat between prostrations.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 283,
      "title": "Jami` at-Tirmidhi 283",
      "narrator": "Tawus said:",
      "english_text": "\"We asked Ibn Abbas about squatting (sitting) on the heels. He said: 'It is the Sunnah.' We said: 'We think that it is difficult for a man.' He said: 'Rather, it is Sunnah of your Prophet.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 284,
      "title": "Jami` at-Tirmidhi 284",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Between the two prostrations, the Prophet would say: (Allahummaghfir li, warhamni, wajburni, wahdini, warzuqni). 'O Allah! Pardon me, have mercy on me, help me, guide me, and grant me sustenance.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 285,
      "title": "Jami` at-Tirmidhi 285",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "(Another chain) which is similar.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 286,
      "title": "Jami` at-Tirmidhi 286",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"[Some of] the Companions of the Prophet complained [to the Prophet] about the hardship of the prostration on them, when they were so spread out, so he said: 'Use your knees.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 287,
      "title": "Jami` at-Tirmidhi 287",
      "narrator": "Malik bin Al-Huwairith Al-Laithi narrated that he saw :",
      "english_text": "Allah's Messenger performing Salat. When he was in an odd number of his Salat, he would not get up until he had sat completely.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 288,
      "title": "Jami` at-Tirmidhi 288",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger would get up during his Salat on the tips of his feet.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 289,
      "title": "Jami` at-Tirmidhi 289",
      "narrator": "Abdullah bin Mas'ud narrated:",
      "english_text": "\"Allah's Messenger taught us, that when we sit for every two Rak'ah we should say: (At-Tahyyatulillah, was-salawatu wattayybaat. As-salamu alaika ayyuhannabiyyu wa rahmatullahi wa barakatuhu, as-salamu alaina wa ala ibadillahis-salihin. Ashhadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh.) 'All greetings, prayers, and pure words are Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that nne has the right to be worshipped but Allah, and I testify that Muhammad is Allah's servant and Messenger.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 290,
      "title": "Jami` at-Tirmidhi 290",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Allah's Messenger would teach us the Tashah-hud just as he would teach us the Qur'an. He would say: (At-Tahiyyatu, al mubarakatu, as-salawatu at-tayyibatulillah. Salamun alaika ayyuhan-naibiyyu wa rahmatullahi wa barakatuhu, salamun alaina wa ala ibadalillahis-salihin. Ashhadu an la ilaha illallah, wa ashhadu anna Muhammadan abduhu wa Raduluh.) 'All greetings, goodness, prayers, and pure words are for Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings, Peace be upon us and all of the righteous worshippers of Allah. I testify that there is none worthy of worship except Allah, and I testify that Muhammad is Allah's worshipper and Messenger.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 291,
      "title": "Jami` at-Tirmidhi 291",
      "narrator": "`Abdullah bin Mas`ud said:",
      "english_text": "\"It is from the Sunnah to say the Tashahhud quietly\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 292,
      "title": "Jami` at-Tirmidhi 292",
      "narrator": "Wa'il bin Hujr said:",
      "english_text": "\"I arrived in Al-Madinah and I said, 'Let me look at the Salat of Allah's Messenger.' When he sat - meaning for At-Tashah-hud - he spread his left foot, and placed his left hand - meaning on his left thigh - and held his right foot erect.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 293,
      "title": "Jami` at-Tirmidhi 293",
      "narrator": "Abbas bin SAhl [bin Sa'd] narrated:",
      "english_text": "\"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: \"I am the most knowledgeable among you of the Salat of Allah's Messenger: Indeed Allah's Messenger sat - meaning for Tashah-hud - he spread his left foot, and made the top of his right (foot) face the Qiblah, and he placed his right hand on his right knee, and his left hand on his left knee, and indicated with his finger - meaning the index finge.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 294,
      "title": "Jami` at-Tirmidhi 294",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"When the Prophet would sit during the Salat, he would place his right hand on his knee, and raise his finger, the one that is next to the [right] thumb, supplicating with it, and his left hand was spread flat on his left knee.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 295,
      "title": "Jami` at-Tirmidhi 295",
      "narrator": "Abdullah narrated:",
      "english_text": "\"The Prophet would say the Salam from his right and from his left (saying): (As-Salamu alaikum wa rahmatullah, as-Salamu alaikum wa rahmatullah) 'Peace be upon you, and Allah's mercy. Peace be upon you, and Allah's mercy.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 296,
      "title": "Jami` at-Tirmidhi 296",
      "narrator": "Aishah narrated:",
      "english_text": "\"Allah's Messenger would say one Taslim for the Salat while facing forward and turning to his right side a little.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 297,
      "title": "Jami` at-Tirmidhi 297",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Hadhf the Salam is a Sunnah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 298,
      "title": "Jami` at-Tirmidhi 298",
      "narrator": "Aishah narrated:",
      "english_text": "\"When Allah's Messenger said the Salam he would not remain seated except long enough to say: (Allahumma antas-salam, wa minkas-salam, tabarakta dhal jalali wal-Ikram) 'O Allah! You are the One free of defects, and perfection is from You. Blessed are You, Possessor of Majesty and Honor.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 299,
      "title": "Jami` at-Tirmidhi 299",
      "narrator": "Aishah narrated:",
      "english_text": "(Another chain) which is similar, but he said: (Tabarakta ya dhal-jalali wal-ikram) \"Blessed are You, O Possessor of Majesty and Honor.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 300,
      "title": "Jami` at-Tirmidhi 300",
      "narrator": "Thawban, the freed slave of Allah's Messenger, narrated that :",
      "english_text": "Allah's Messenger said: \"When Allah's Messenger wanted to turn from his Salat, he would seek forgiveness from Allah three times, then say: (Allahumma Antas-Salam, wa minkas-salam, tabarakta ya dhal-jalali wal-Ikram) 'O Allah! You are the One free of defects and perfection is from You. Blessed are You, O Possesor of Majesty and Honor.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 301,
      "title": "Jami` at-Tirmidhi 301",
      "narrator": "Qabisah bin Hulb narrated that his father said:",
      "english_text": "\"When Allah's Messenger would lead us in Salat he would turn (to leave) from both sides, on his right and on his left.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 302,
      "title": "Jami` at-Tirmidhi 302",
      "narrator": "Rifa`ah bin Rafi` narrated:",
      "english_text": "\"One day Allah's Messenger was sitting in the Masjid\" Rifa'ah said: \"And we were with him. Then what appeared to be a Bedouin man entered to pray, but he performed his Salat in a very brief manner. He then got up and greeted the prophet with Salam. The Prophet said (returning the greeting): 'And upon you. Go back and perform Salat, for indeed you have no prayed.' So he returned to perform Salat then came and greeted the Prophet with Salam. So he (the Prophet) said (returning the greeting): 'And upon you. Go back and perform Salat, for indeed you have not prayed.' [He did that] two or three times, each time coming to the Prophet, greeted the Prophet with Salam and the Prophet saying: 'And upon you. Go back and perform Salat, for indeed you have not prayed.' - until the people got scared and became very worried that one whose prayer was so brief had not actually prayed. Then in the end the man said: 'Then show me, and teach me, for I am a human who has suffered and is mistaken.' So he said: 'Alright. When you stand for Salat then perform Wudu as Allah ordered you. Then say the Tashahhud, and the Iqamah as well. If you know any Quran then recite it, if not then praise Allah, mention His greatness, and the Tahlil. Then bow such that you are at rest in your bowing, then stand completely, then prostrate completely, then sit such that you are at rest while sitting them stand. When you have done that, then you have completed your Salat, and if you leave out something, then you have made your Salat deficient.' And this was easier on them than the first matter, because if some of this was deficient, It would only reduce the reward of his Salat, it would not have gone entirely. \"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 303,
      "title": "Jami` at-Tirmidhi 303",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger entered the Masjid, and a man entered and offered Salat. Then he came to give Salam to the Propet. He returned the Salam to him and said: 'Go back and perform Salat, for indeed you have not prayed.' So the man returned to pray as he had prayed. Then he came to give Salam to the Prophet. He returned Salam to him, then [Allah's Messenger] said: 'Go back and perform Salat, for indeed you have not prayed' until he had done that three times. So the man said to him: 'By the One who sent you with the Truth, I do not know any better than this, so teach me.' So he said [to him]: 'When you stand for Salat then say the Takbir, then recite what is easy for you of the Quran. Then bow until you are at rest while bowing, then rise up until you are at rest sitting. Do that in all of your Salat.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 304,
      "title": "Jami` at-Tirmidhi 304",
      "narrator": "Muhammad bin Amr bin Ata' narrated from Abu Humaid As-Saidi, :",
      "english_text": "he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi - 'I am the most knowledgeable among you of the Salat of the Allah's Messenger.' They said: 'You did not precede us in his companionship, nor were you in his company more than us.' He said: 'Even still.\" They said: 'Go ahead.' So he said: 'When Allah's Messenger stood for Salat he would stand with his back straight and raise his hands until they were at the level of his shoulder. Then he would say: (Allahu Akbar) \"Allah is Most Great\" and bow. Then he would straighten (his back) so that he would not lower his head, nor raise it, and he placed his hands on his knees. Then he said: (Sami Allahu liman hamidah) \"Allah listens to those who praise Him.\" And he raised his hands and stood up straight until all of his bones completely returned to their places. Then he went down to the ground prostrating, then he said: (Allahu Akbar) \"Allah is Most Great.\" Then he held his upper arms away from his midsection, and opened his toes on his feet (facing the Qiblah), then he bend his left foot and sat on it then straightened up until all of his bones completely returned to their placed, then he went down to prostrate. Then he said: (Allahu Akbar) \"Allah is Most Great,\" then he bent his foot and sat and straightened up until all of his bones completely returned to their places. Then he got up. Then in the second Rak'ah he did the same as that, such that when he stood from the two prostrations, he sad the Takbir and raised his hands until they were at the level of his shoulders as he did when he opened the Salat. Then he did like that until it was the Rak'ah in which his Salat was to end, when he moved his left foot over and sat on his side (in the Mutawarrik postion). Then he said the Taslim.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 305,
      "title": "Jami` at-Tirmidhi 305",
      "narrator": "(Another chain) that Muhammad bin Amir bin Ata narrated from Abu Humaid As-Saidi,:",
      "english_text": "he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 306,
      "title": "Jami` at-Tirmidhi 306",
      "narrator": "Qutbah bin Malik narrated:",
      "english_text": "\"I heard Allah's Messenger reciting for Fajr: And tall date palms in the first Rak'ah.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 159,
      "hadithNum_inBook": 307,
      "title": "Jami` at-Tirmidhi 307",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "\"For Zuhr and Asr, Allah's Messenger would recite: By the heavens, holding the Buruj and (By the heavens and At-Tariq) and similar to them.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 160,
      "hadithNum_inBook": 308,
      "title": "Jami` at-Tirmidhi 308",
      "narrator": "Umm Al-Fadl narrated:",
      "english_text": "\"Allah's Messenger came out to us with his head bandaged from his illness. He prayed Maghrib, reciting (Surat) Al-Mursalat.\" [She said:] \"He did not pray it again until he met Allah the Might and Sublime.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 161,
      "hadithNum_inBook": 309,
      "title": "Jami` at-Tirmidhi 309",
      "narrator": "Abdullah bin Buraidah narrated that his father (Buraidah) said:",
      "english_text": "\"Allah's Messenger would recite: By the sun and its brightness, or similar Surah for the latter Isha (prayer).\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 162,
      "hadithNum_inBook": 310,
      "title": "Jami` at-Tirmidhi 310",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "\"The Prophet would recite: By the fig and the olive for Isha.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 163,
      "hadithNum_inBook": 311,
      "title": "Jami` at-Tirmidhi 311",
      "narrator": "Ubadah bin As-Samit narrated:",
      "english_text": "\"Allah's Messenger prayed the Subh prayer, and he had difficulty with the recitation. When turned (after finishing) he said: 'I think that you are reciting behind your Imam?'\" He said: \"We said: 'Yes, Messenger of Allah, by Allah!' He said: 'Do not do that, except for Umm Al-Kitab, for there is no Salat for one who does not recite it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 164,
      "hadithNum_inBook": 312,
      "title": "Jami` at-Tirmidhi 312",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger turned (after praying) from a Salat in which he recited aloud and said: 'Has any one of you recite along with me just now?' A man said: 'Yes, O Messenger of Allah.' He said: 'Indeed I said to myself: Why was I being contended with for the Quran?'\" He (Az-Zuhri one of the narrators) said: \"So when they heard that from Allah's Messenger, the people stopped reciting with Allah's Messenger in the prayers that Allah's Messenger recited aloud.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 165,
      "hadithNum_inBook": 313,
      "title": "Jami` at-Tirmidhi 313",
      "narrator": "Abu Nu'aim Wahb bin Kaisan narated that he heard Jabir bin  'Abdullah saying:",
      "english_text": "\"Whoever prayed a Rak'ah in which he did not recite Umm Al-Qur'an, then he did not pray except if he was behind an Imam.\"\n\n[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 166,
      "hadithNum_inBook": 314,
      "title": "Jami` at-Tirmidhi 314",
      "narrator": "Fatimah the Great narrated:",
      "english_text": "\"When Allah's Messenger entered the Masjid he said Salat and Salam upon Muhammad and then said: (Rabbighfirli dhunubi, waftahli abwaba rahmatik) 'O pardon my sins, and open the gates of Your mercy for me.' And when he exited he said Salat and Salam upon Muhammad, and then said: (Rabbighfirli dunubi, waftahli abwaba rakmatik) 'O Lord pardon my sins, and open the gates of Your blessings for me.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 167,
      "hadithNum_inBook": 315,
      "title": "Jami` at-Tirmidhi 315",
      "narrator": "Ismail bin Ibrahim (a narrator in the chain of Hadith no. 314) said:",
      "english_text": "\"I met Abdullah bin al Husain in Makkah, so I asked him about this Hadith, so he narrated it to me, he said: 'When Allah's Messenger entered, he said (Rabbi aftahli abwaba rahmatik) 'O Lord, open the gates of Your mercy for me.' And when he exited he said: (Rabbi iftahli abwaba fadlik) 'O Lord, open the gates of Your blessings for me.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 168,
      "hadithNum_inBook": 316,
      "title": "Jami` at-Tirmidhi 316",
      "narrator": "Abu Qatadah narrated that :",
      "english_text": "Allah's Messenger said: \"When one of you comes to the Masjid, then let him perform two Rak'ah before sitting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 169,
      "hadithNum_inBook": 317,
      "title": "Jami` at-Tirmidhi 317",
      "narrator": "Abu Sa'eed Al-Khudri narrated that :",
      "english_text": "Allah's Messenger said: \"All of the earth is a Masjid except for the graveyard and the washroom.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 170,
      "hadithNum_inBook": 318,
      "title": "Jami` at-Tirmidhi 318",
      "narrator": "Uthman bin Affan narrated that :",
      "english_text": "he heard Allah's Messenger say: \"Whoever builds a Masjid for (the sake of) Allah, then Allah will build a similar house for him in Paradise.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 171,
      "hadithNum_inBook": 319,
      "title": "Jami` at-Tirmidhi 319",
      "narrator": "It has been related that :",
      "english_text": "the Prophet said: \"Whoever builds a Masjid for (the sake of) Allah, be it small or large, then Allah will build a house for him in Paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 172,
      "hadithNum_inBook": 320,
      "title": "Jami` at-Tirmidhi 320",
      "narrator": "Ibn Abbbas narrated:",
      "english_text": "\"Allah's Messenger cursed the women who visit the graves, and those who use them as Masajid and put torches on them.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 173,
      "hadithNum_inBook": 321,
      "title": "Jami` at-Tirmidhi 321",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"We would sleep in the Masjid during the time of Allah's Messenger and we were young men.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 174,
      "hadithNum_inBook": 322,
      "title": "Jami` at-Tirmidhi 322",
      "narrator": "Amr bin Shu'aib narrated from his father, from his grandfather (Abdullah bin Amr Al-As), that :",
      "english_text": "Allah's Messenger prohibited the recitation of poetry in the Masjid, and from selling and buying in it, and (he prohibited) the people from forming circles in it on Friday before the Salat.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 175,
      "hadithNum_inBook": 323,
      "title": "Jami` at-Tirmidhi 323",
      "narrator": "Abu Sa'eed Al-Khudri narrated:",
      "english_text": "\"A man from Banu Khudrah and a man from Banu Amr bin Awf were disputing about the Masjid that was founded upon Taqwa. The man from Banu Khudrah said: 'It is the Masjid of Allah's Messenger.' The other one said that it was Masjid Qub. So they went to ask Allah's Messenger about that. He said: 'It is this - meaning his Masjid - 'and in that one (Masjid Quba) there is much good.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 176,
      "hadithNum_inBook": 324,
      "title": "Jami` at-Tirmidhi 324",
      "narrator": "Abu Al-Abrad the freed slave of Banu Khatmah narrated that he heard Usaid bin Zuhair Al-Ansari - and he was one of the Companions of the Prophet - narrated that :",
      "english_text": "the Prophet said: \"The Salat in Masjid Quba is like Umrah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 177,
      "hadithNum_inBook": 325,
      "title": "Jami` at-Tirmidhi 325",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Salat is this Masjid of mine is better than a thousand Salat in another, except for Masjid Al-Haram.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 178,
      "hadithNum_inBook": 326,
      "title": "Jami` at-Tirmidhi 326",
      "narrator": "Abu Sa'eed Al-Khudri narrated that :",
      "english_text": "Allah's Messenger said: \"A mount is not saddled (for a journey) except to three Masajid: Al-Masjid Al-Haram, this Masjid of mine, and Masjid Al-Aqsa.\"\n\n[Abu `Eisa said:] This Hadith is Hasan Sahih.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 179,
      "hadithNum_inBook": 327,
      "title": "Jami` at-Tirmidhi 327",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"When the Iqamah is called for Salat do not come to it rushing, rather come to it walking, and while you have tranquility. What you catch of it then pray it, and what you missed of it, then complete it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 180,
      "hadithNum_inBook": 328,
      "title": "Jami` at-Tirmidhi 328",
      "narrator": "(Another chain with a similar narration) from Abu Hurairah :",
      "english_text": "[from the Prophet]. And this is more correct than the Hadith of Yazid bin Zurai. (no. 327)",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 181,
      "hadithNum_inBook": 329,
      "title": "Jami` at-Tirmidhi 329",
      "narrator": "(Another chain with a similar narration) from Abu Hurairah, :",
      "english_text": "from the Prophet.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 182,
      "hadithNum_inBook": 330,
      "title": "Jami` at-Tirmidhi 330",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"One of you does not cease to be in Salat as long as he is waiting for it. And the angels do not cease praying for one of you as long as he remains in the Masjid (saying): 'Allah! Forgive him. O Allah! Have mercy upon him' - as long as he does not commit Hadath.\" A man from Hadramawt said: \"And just what is Hadath Abu Hurairah?\" He said: \"Breaking wind, or passing gas.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 183,
      "hadithNum_inBook": 331,
      "title": "Jami` at-Tirmidhi 331",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Allah's Messenger performed Salat on a Khumrah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 184,
      "hadithNum_inBook": 332,
      "title": "Jami` at-Tirmidhi 332",
      "narrator": "Abu Sa'eed narrated:",
      "english_text": "\"The Prophet performed Salat on a Hasir.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 185,
      "hadithNum_inBook": 333,
      "title": "Jami` at-Tirmidhi 333",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Allah's Messenger used to mingle with us such that he said to my younger brother: 'O Abu Umair! What did the Nughair do?'\" He (Anas) said: \"A Bisat of ours would be sprinkled (with water) to perform Salat on.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 186,
      "hadithNum_inBook": 334,
      "title": "Jami` at-Tirmidhi 334",
      "narrator": "Mu'adh ibn Jabal narrated:",
      "english_text": "\"The Prophet liked to perform Salat in Al-Hitan.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 187,
      "hadithNum_inBook": 335,
      "title": "Jami` at-Tirmidhi 335",
      "narrator": "Muba bin Talhah narrated from his father (Talhah) that :",
      "english_text": "Allah's Messenger said: \"When one of you placed something like the post (handle) of the camel saddle in front of him, then let him perform Salat and not concern himself with who passes beyond that.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 188,
      "hadithNum_inBook": 336,
      "title": "Jami` at-Tirmidhi 336",
      "narrator": "Zaid bin Khalid Al-Juhni sent a message to Abu Juhaim asking him what he had heard from Allah's Messenger about passing in front of a person who was performing Salat. Abu Juhaim said :",
      "english_text": "that Allah's Messenger said: \"If the one who passed in front of the person performing Salat knew what he was doing, then for him to stop (and wait for forty) would be better for him than to pass in front of him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 189,
      "hadithNum_inBook": 337,
      "title": "Jami` at-Tirmidhi 337",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"I was a companion rider on a female donkey with Al-Fadl. We came while the Prophet and his Companions were performing Salat at Mina.\" He said: \"We dismounted from it and joined the row. The donkey then passed in front of them, and this did not invalidate their Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 190,
      "hadithNum_inBook": 338,
      "title": "Jami` at-Tirmidhi 338",
      "narrator": "Abu Dharr said that :",
      "english_text": "Allah's Messenger said: \"When a man performs Salat, and there is nothing in front of him like the post of a saddle, or a camel saddle, then his Salat is severed by (passing of) a black dog, a woman, and a donkey.\" It was said to Abu Dharr: \"What is the problem with the black dog rather than the red or white one?\" He said: \"O my nephew! I asked Allah's Messenger just as you have asked me. He said: 'The black dog is a Shaitan (devil).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 191,
      "hadithNum_inBook": 339,
      "title": "Jami` at-Tirmidhi 339",
      "narrator": "Umar bin Abi Salamah narrated that he saw :",
      "english_text": "Allah's Messenger performing Salat in the house of Umm Salamah wrapped in one garment.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 192,
      "hadithNum_inBook": 340,
      "title": "Jami` at-Tirmidhi 340",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "\"When Allah's Messener arrived in Al-Madinah, he faced Bait Al-Maqdis in Salat for sixteen or seventeen months. Allah's Messenger longed to face the direction of the Ka'bah, so Allah Most High revealed: Verily! We have seen the turning of your face towards the heaven. Surely We shall turn you o a Qiblah that shall please you. So turn  your face in the direction of Al-Masjid Al-Haram.So he faced the Ka'bah, and he liked that. A man performed the Asr prayer with him, then passed by some of the Ansar who were bowing in Salat for Asr while facing Bait Al-Maqdis.\" He told them that he had faced the direction of the Ka'bah, so they changed (their direction) while they were bowing.\" \n[He said:] There are narrations on this topic from Ibn Umar, Ibn Abbas, Umarah bin Aws, Amr bin Awf Al-Muzani and Anas.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 193,
      "hadithNum_inBook": 341,
      "title": "Jami` at-Tirmidhi 341",
      "narrator": "Ibn Umar said:",
      "english_text": "\"They were bowing during the Subh (Fajr) Prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 194,
      "hadithNum_inBook": 342,
      "title": "Jami` at-Tirmidhi 342",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"What is between the east and the west is Qiblah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 195,
      "hadithNum_inBook": 343,
      "title": "Jami` at-Tirmidhi 343",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "(Another chain with a similar narration)",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 196,
      "hadithNum_inBook": 344,
      "title": "Jami` at-Tirmidhi 344",
      "narrator": "(Another chain narrating that) Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"What is between the east and the west is Qiblah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 197,
      "hadithNum_inBook": 345,
      "title": "Jami` at-Tirmidhi 345",
      "narrator": "Abdullah bin Amir bin Rabi'ah narrated from his father who said:",
      "english_text": "\"We were with the Prophet on a journey on a very dark night and we did not know the direction of the Qiblah. So each man among us prayed in his own direction. In the morning when we mentioned that to the Prophet, then the following was revealed: So where ever you turn, there is the Face of Allah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 198,
      "hadithNum_inBook": 346,
      "title": "Jami` at-Tirmidhi 346",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet prohibited Salat from being performed in seven places: the dung heap, the slaughtering area, the graveyard, the commonly used road, the wash area, in the area that camels rest at, and above the House of Allah (the Ka'bah).\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 199,
      "hadithNum_inBook": 347,
      "title": "Jami` at-Tirmidhi 347",
      "narrator": "Ibn Umar narrated:",
      "english_text": "(Another chain with a similar narration)",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 200,
      "hadithNum_inBook": 348,
      "title": "Jami` at-Tirmidhi 348",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Perform Salat in sheep pens but do not perform Salat in the camels' resting area.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 201,
      "hadithNum_inBook": 349,
      "title": "Jami` at-Tirmidhi 349",
      "narrator": "(Another chain) from Abu Hurairah, :",
      "english_text": "from the Prophet and it is the same or similar.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 202,
      "hadithNum_inBook": 350,
      "title": "Jami` at-Tirmidhi 350",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Prophet would perform Salat in sheep pens.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 203,
      "hadithNum_inBook": 351,
      "title": "Jami` at-Tirmidhi 351",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Prophet dispatched me for something he needed. I came to him while he was performing Salat on his mount, heading east, he made the prostrations lower than the bowing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 204,
      "hadithNum_inBook": 352,
      "title": "Jami` at-Tirmidhi 352",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet performed Salat towards his she-camel, or his mount, and he would perform Salat while on his mount, whichever direction it was facing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 205,
      "hadithNum_inBook": 353,
      "title": "Jami` at-Tirmidhi 353",
      "narrator": "Anas conveyed that :",
      "english_text": "the Prophet said: \"When supper is present and the Iqamah for Salat has been called, then begin with supper.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 206,
      "hadithNum_inBook": 354,
      "title": "Jami` at-Tirmidhi 354",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "the Prophet said: \"When the supper is presented and the Iqamah is called for Salat, then begin with the supper.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 207,
      "hadithNum_inBook": 355,
      "title": "Jami` at-Tirmidhi 355",
      "narrator": "Aishah narrated that :",
      "english_text": "Allah's Messenger said: \"When one of you is sleepy and he is performing Salat, then let him lie down until the sleep is gone from him. For when one of you performs Salat while he is sleepy, perhaps he wants to seek forgiveness but he curses himself.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 208,
      "hadithNum_inBook": 356,
      "title": "Jami` at-Tirmidhi 356",
      "narrator": "Abu Atiyyah narrated that :",
      "english_text": "a man among them said: \"Malik bin Al-Huwairith came to us in our Musalla to narrate. One day when it was time for Salat, we told him to go ahead (to lead the prayer). He said: 'Let one of you go forward, until I narrate to you why I would not go forward (to lead prayer): I heard Allah's Messenger saying: \"Whoever visits a people, then he does not lead them, but a man among them leads them.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 209,
      "hadithNum_inBook": 357,
      "title": "Jami` at-Tirmidhi 357",
      "narrator": "Thawban narrated that :",
      "english_text": "the Prophet said: \"It is not allowed for a man to look into the interior of a man's house until he has been given permission, for if he looks, then he has entered. And one who leads people (in Salat) should not supplicate for himself alone with the exclusion of his congregation. If he does, then he has betrayed them. And one is not to stand for Salat while he has to urinate.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 210,
      "hadithNum_inBook": 358,
      "title": "Jami` at-Tirmidhi 358",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Allah's Messenger cursed three people: A man who leads people (in Salat) while they dislike him, a woman who spends a night while her husband is angry with her, and a man who hears: 'Hayya Alal Falah (come to success)' then does not respond.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 211,
      "hadithNum_inBook": 359,
      "title": "Jami` at-Tirmidhi 359",
      "narrator": "Amr bin Al-Harith Al-Mustaliq said:",
      "english_text": "\"It used to be said that the people with the worst punishment [on the Day of Judgment] are two: A woman who disobeyed her husband, and a people's Imam whom they dislike.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 212,
      "hadithNum_inBook": 360,
      "title": "Jami` at-Tirmidhi 360",
      "narrator": "Abu Umamah narrated that :",
      "english_text": "Allah's Messenger said: \"There are three whose Salat would not rise up beyond their ears: The runaway slave until he returns, a woman who spends a night while her husband is angry with her, and a people's Imam whom they dislike.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 213,
      "hadithNum_inBook": 361,
      "title": "Jami` at-Tirmidhi 361",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Allah's Messenger fell from a horse and got injured, so he led Salat sitting and we also offered Salat sitting. When he completed the Salat he said: \"The Imam is appointed to be followed; when he says the Takbir then say the Takbir, when he bows, then bow, and when he raises his head, then raise your heads. When he says: \"Sami' Allahu liman hamidah (Allah listens to those who praise him)\" then say: \"Rabbana wa lakal-hamd. (O our Lord! And all praise is Yours.)\" and when he prostrates, then prostrate, and when he performs Salat sitting, then pray sitting altogether.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 214,
      "hadithNum_inBook": 362,
      "title": "Jami` at-Tirmidhi 362",
      "narrator": "Aishah narrated:",
      "english_text": "\"Allah's Messenger performed Salat behind Abu Bakr, during the illness from which he died, and he was sitting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 215,
      "hadithNum_inBook": 363,
      "title": "Jami` at-Tirmidhi 363",
      "narrator": "Anas narrated:",
      "english_text": "\"Allah's Messenger performed Salat during his illness behind Abu Bakr while seated, wrapped in a garment.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 216,
      "hadithNum_inBook": 364,
      "title": "Jami` at-Tirmidhi 364",
      "narrator": "Ash-Sha'bi narrated:",
      "english_text": "\"Al-Mughirah bin Shu'bah led us in Salat, and he continued after the two Rak'ah, so the people said: 'Subhan Allah' and he said: 'Subhan Allah' to them. When he finished his Salat he said the Taslim then performed two prostrations of As-Sahw while he was sitting. Then he narrated to them that Allah's Messenger did the same with them as he had done.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 217,
      "hadithNum_inBook": 365,
      "title": "Jami` at-Tirmidhi 365",
      "narrator": "Ziyad bin Haqah narrated:",
      "english_text": "\"Al-Mughirah bin Shu'bah les us in Salat. When he prayed two Rak'ah he stood without sitting. Those who were behind him said 'Subhan Allah' and he indicated to them that they should stand. He said the Taslim when he had finished his Salat and he performed two prostrations of As-Sahw, and said the Taslim. He said that Allah's Messenger did this.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 218,
      "hadithNum_inBook": 366,
      "title": "Jami` at-Tirmidhi 366",
      "narrator": "Ubaidullah bin Abdullah bin Mas'ud narrated from his father (Abdullah bin Mas'ud) that he said:",
      "english_text": "\"When Allah's Messenger sat for the first two Rak'ah it was as if he was on hot stones.\" Shu'bah (one of the narrators) said: \"Then Sa'd's lips moved (saying) something. So I said: 'Until he stood?' He said: 'Until he stood.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 219,
      "hadithNum_inBook": 367,
      "title": "Jami` at-Tirmidhi 367",
      "narrator": "Suhaib narrated:",
      "english_text": "\"I passed by Allah's Messenger  (S) while he was performing Salat, so I said greeted him with Salam, and he returned it by making signals.\" He said: \"I do not know except that he said: 'He indicated with his finger.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 220,
      "hadithNum_inBook": 368,
      "title": "Jami` at-Tirmidhi 368",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"I said to Bilal: 'How did the Prophet (S) reply to them when they gave him Salams and he was performing Salat?' He said: 'He would motion with his hand.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 221,
      "hadithNum_inBook": 369,
      "title": "Jami` at-Tirmidhi 369",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger said: \"The Tasbih is for the men and clapping is for the women.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 222,
      "hadithNum_inBook": 370,
      "title": "Jami` at-Tirmidhi 370",
      "narrator": "Abu Hurairah narrated that the\nProphet () said:",
      "english_text": "\"Yawning in prayer (salah) is from the Shaitan, so when one of you yawns then let him suppress (it) as much as possible.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 223,
      "hadithNum_inBook": 371,
      "title": "Jami` at-Tirmidhi 371",
      "narrator": "Imran bin Husain narrated:",
      "english_text": "\"I asked Allah's Messenger (S) about the Salat for a man who is sitting. He said: 'Whoever performs Salat while standing then that is more virtuous. And whoever performs Salat while sitting, then he gets half the rewards of the one standing, and whoever performs Salat while lying down, then he gets half the rewards of the one sitting.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 224,
      "hadithNum_inBook": 372,
      "title": "Jami` at-Tirmidhi 372",
      "narrator": "This Hadith has been related from Ibrahim bin Tahman with this chain. Except that he said:",
      "english_text": "\"From Imran bin Husain who said: 'I asked Allah's Messenger (S) about Salat for a sick person. He said: \"He performs Salat standing, if he is not able then sitting, if he is not able then on his side.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 225,
      "hadithNum_inBook": 373,
      "title": "Jami` at-Tirmidhi 373",
      "narrator": "Hafsah, the wife of the Prophet (S), narrated:",
      "english_text": "\"I did not see Allah's Messenger (S) praying voluntary prayers sitting until the year before he died. Then he would perform Salat for the voluntary prayers sitting, and he would recite a Surah and prolong it such that it would be longer than the longest of them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 226,
      "hadithNum_inBook": 374,
      "title": "Jami` at-Tirmidhi 374",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet (S) would perform Salat while sitting. And he would recite while sitting. When about thirty or forty Ayah of his recitation remained he would standup and recite while he was standing, then he would bow and prostrate. Then he would do the same in the second Rak'ah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 227,
      "hadithNum_inBook": 375,
      "title": "Jami` at-Tirmidhi 375",
      "narrator": "Abdullah bun Shaqiq narrated from Aishah, he said:",
      "english_text": "\"I asked her about the voluntary Salat of Allah's Messenger (S), she said: 'He would pray long into the night standing, and long into the night sitting. So when he recited and he was standing, he would bow and prostrate whole he was standing, and when he recited while he was sitting, he bowed and prostrated while he was sitting.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 228,
      "hadithNum_inBook": 376,
      "title": "Jami` at-Tirmidhi 376",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "Allah's Messenger said: \"Indeed I hear the crying of a small boy while I am in Salat, so I shorten it in fear that his mother may be tormented.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 229,
      "hadithNum_inBook": 377,
      "title": "Jami` at-Tirmidhi 377",
      "narrator": "Aishah narrated that:",
      "english_text": "Allah's Messenger said: \"The Salat of a women who has reached the age of menstruation is not accepted without a Khimar\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 230,
      "hadithNum_inBook": 378,
      "title": "Jami` at-Tirmidhi 378",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger (S) prohibited As-Sadl in the Salat.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 231,
      "hadithNum_inBook": 379,
      "title": "Jami` at-Tirmidhi 379",
      "narrator": "Abu Dharr narrated that :",
      "english_text": "the Prophet (S) said: \"When one of you stands for Salat then he should not smoothen the pebbles, for indeed it is mercy that he is facing.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 232,
      "hadithNum_inBook": 380,
      "title": "Jami` at-Tirmidhi 380",
      "narrator": "Mu'aiqib narrated:",
      "english_text": "\"I asked Allah's Messenger (S) about smoothening the pebbles during Salat. He said: 'If you must do so, then let it be only once.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 233,
      "hadithNum_inBook": 381,
      "title": "Jami` at-Tirmidhi 381",
      "narrator": "Umm Salamah narrated:",
      "english_text": "\"The Prophet (S) saw a boy of ours - called Aflah - blowing when he prostrated. So he said: 'O Aflah! Put your face in the dirt.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 234,
      "hadithNum_inBook": 382,
      "title": "Jami` at-Tirmidhi 382",
      "narrator": "(Another chain) in which Abu Hamzah narrated:",
      "english_text": "\"A boy of ours named Rabah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 235,
      "hadithNum_inBook": 383,
      "title": "Jami` at-Tirmidhi 383",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Prophet (S) prohibited than a man to pray with his hands on his hip.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 236,
      "hadithNum_inBook": 384,
      "title": "Jami` at-Tirmidhi 384",
      "narrator": "Abu Rafi narrated that :",
      "english_text": "He passed by Al-Hasan bin Ali while he was performing Salat and he had gathered his locks at the back of his head, so he (Abu Rafi) undid them, and Al-Hasan turned to him angrily. He said: \"Resume your Salat and do not be angry, for indeed I heard Allah's Messenger (S) saying: 'That is the seat of Ash-Shaitan.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 237,
      "hadithNum_inBook": 385,
      "title": "Jami` at-Tirmidhi 385",
      "narrator": "Al-Fadl bin Al-`Abbas narrated that:",
      "english_text": "Allah's Messenger (S) said: \"As-Salat is two and two, with a Tashahhud for every two Rak`ah, with humility, imploring, having a sense of tranquility, pleading and showing helplessness and stretching out your hand\" - he said: raising them - \"to your Lord, with the insides of them facing your face, saying: 'O Lord! O Lord! And whoever does not do this, then it is like this or that.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 238,
      "hadithNum_inBook": 386,
      "title": "Jami` at-Tirmidhi 386",
      "narrator": "Ka'b bun Ujrah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"When one of you performs Wudu and does so well, then he leaves intending to go to the Masjid, then let him not intertwine his fingers, for indeed he is in Salat.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 239,
      "hadithNum_inBook": 387,
      "title": "Jami` at-Tirmidhi 387",
      "narrator": "Jabir narrated:",
      "english_text": "\"It was said to the Prophet (S): 'Which Salat is most virtuous?' He said: 'That with the longest Qunut.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 240,
      "hadithNum_inBook": 388,
      "title": "Jami` at-Tirmidhi 388",
      "narrator": "Ma'dan bin Talhah Al Yamari said:",
      "english_text": "\"I met Thawban the freed slave of Allah's Messenger (S) and said to him, 'Guide me to a deed by which Allah benefit me, and for which Allah will admit me into Paradise.' He was silent for quite a while, then he turned to me and said: 'Perform prostrations, for I heard Allah's Messenger (S) saying: 'No worshipper performs a prostration to Allah except that by it, Allah will raise him a level, and erase a sin from him for it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 241,
      "hadithNum_inBook": 389,
      "title": "Jami` at-Tirmidhi 389",
      "narrator": "Madan [bin Talhah] said:",
      "english_text": "\"I met Abu Ad-Darda, and I asked him what I had asked Thawban, so he said: 'Perform prostrations, for I heard Allah's Messenger saying: 'No worshipper performs a prostration to Allah except that by it Allah will raise him a level, and erase a sin from him for it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 242,
      "hadithNum_inBook": 390,
      "title": "Jami` at-Tirmidhi 390",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger (S) ordered killing the two black things in Salat; the snake and the scorpion.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 243,
      "hadithNum_inBook": 391,
      "title": "Jami` at-Tirmidhi 391",
      "narrator": "Abdullah bin Buhainah Al-Asdi the ally of Banu Abdul-Muttalib narrated:",
      "english_text": "\"The Prophet (S) stood for the Zuhr prayer, and he had a sitting to perform, so when he completed his Salat, he performed two prostrations, saying the Takbir for each prostration. So he was sitting before saying the Salam, and the people prostrated with him in place of the sitting he forgot.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 244,
      "hadithNum_inBook": 392,
      "title": "Jami` at-Tirmidhi 391",
      "narrator": "There is a narrated with another chain that Abu Hurairah and  ['Abdullah bin] As-Sa'id Al-Qari' would perform the prostrations of As-Sahw before the Taslim.\n\nAbu 'Eisa said:",
      "english_text": "The Hadith of Ibn Buhainah is a Hasan [Sahih] Hadith, and this is acted upon according to some of the people of knowledge. It is the opinion of Ash-Shafi'i, he held the view that all prostrations for As-Sahw were to be performed before the Salam, saying: \"This one abrogates the other Ahadith\" and he mentioned that the last action of the Prophet () was according to this.\n\nAhmad and Ishaq said: \"When a man stands up after two Rak'ah, then he performs the prostrations for As-Sahw before the Salam according to the Hadith of Ibn Buhainah.\"\n\n'Abdullah bin Buhainah is 'Abdullah bin Malik [so he is] Ibn Buhainah (because) Malik is his father and Buhainah is his mother.\n\nI was informed of this by Ishaq bin Mansur from 'Ali [bin 'Abdullah] bin Al-Madini.\n\nAbu 'Eisa said: The people of knowledge differ over when a man is to perform the prostrations of As-Sahw, is it before the Salam or after it. Some of them thought that her performs them after the Salam. This is the view of Sufyan Ath-Thawri and the people of Al-Kufah. Some of them said he performs them before the Salam. This is the view of most of the Fuqaha among the people of Al-Madinah, like Yahya bin Sa'eed, Rabi'ah, and others. This is also the saying of Ash-Shafi'i.\n\nSome of them said when he adds to the Salat, then it is after the Salam, and when he leaves something out, then before the Salam. This is the view of Malik bin Anas.\n\nAhmad said: \"Whatever is reported from the Prophet () about the prostrations from As-Sahw then it is acted upon in either case.\" He saw that when one stands after Rak'ah then according to the Hadith of Ibn Buhainah, he is to perform the prostrations before the Salam. When he prays five for Zuhr, then performs the prostrations after the Salam, and if he says Salam after two Rak'ahs of Zuhr or 'Asr then he performs the prostrations after the Salam. All of them are to be acted upon depending upon the case, and in the cases where nothing is reported from the Prophet (), then two prostrations are performed for As-Sahw before the Salam.\n\nIshaq said the same as Ahmad about all of this, with the exception that he said that for every case of As-Sahw that is not mentioned from the Prophet (), then if it is an addition to the Salat, then prostrations are performed after the Salam, and if it is something that was left out, then the prostrations are performed before the Salam.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 245,
      "hadithNum_inBook": 393,
      "title": "Jami` at-Tirmidhi 392",
      "narrator": "Abdullah bin Masud narrated:",
      "english_text": "\"The Prophet (S) prayed five (Rakah) for Zuhr, so it was said to him: 'Has the prayer been added to, or have you merely forgotten?' So he (S) performed two prostrations after he had said the Salam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 246,
      "hadithNum_inBook": 394,
      "title": "Jami` at-Tirmidhi 393",
      "narrator": "Abdullah (bin Masud) narrated:",
      "english_text": "\"The Prophet (S) performed two prostrations for As-Sahw after talking.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 247,
      "hadithNum_inBook": 395,
      "title": "Jami` at-Tirmidhi 394",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Prophet (S) performed two prostrations after the Salam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 248,
      "hadithNum_inBook": 396,
      "title": "Jami` at-Tirmidhi 395",
      "narrator": "Abu Al-Muhallab narrated from Imran bin Husain that :",
      "english_text": "the Prophet (S) led them in Salat he forgot (something) so he performed two prostrations, then the Tashah-hud, then the Salam.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 249,
      "hadithNum_inBook": 397,
      "title": "Jami` at-Tirmidhi 396",
      "narrator": "Iyad bin Hilal said:",
      "english_text": "\"I said to Abu Sa'eed: 'One of us performs Salat and we do not know how (much) we prayed.' So he said: 'Allah's Messenger (S) said: \"When one of you performs Salat and he does now know how (much) he prayed then let him perform two prostrations while he is sitting.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 250,
      "hadithNum_inBook": 398,
      "title": "Jami` at-Tirmidhi 397",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Indeed the Shaitan comes to one of you in his Salat confusing him until he does now know how much he has prayed. When one of you experiences that then let him perform two prostrations while sitting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 251,
      "hadithNum_inBook": 399,
      "title": "Jami` at-Tirmidhi 398",
      "narrator": "Abdur-Rahman bi Awf narrated that he heard the Prophet (S) saying:",
      "english_text": "\"When one of you becomes forgetful in his Salat so that he does not know if he prayed one or two, then let him consider it one. When he does not know if he prayed three or four, then let him consider it three, and let him perform two prostrations before he says the Taslim.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 252,
      "hadithNum_inBook": 400,
      "title": "Jami` at-Tirmidhi 399",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Prophet (S) turned (finished the prayer) after two (Rak'ah), so Dhul-Yadain said: 'Has the prayer been shortened or have you forgotten O Messenger of Allah?\" The Prophet (S) said: 'Is what Dhul-Yadain said the truth?' The people said yes,  so Allah's Messenger (S) stood to perform the last two (Rakah) of Salat, then he said the Taslim. Then he said the Takbir and prostrated in a manner the same or longer than his (normal) prostrations.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 253,
      "hadithNum_inBook": 401,
      "title": "Jami` at-Tirmidhi 400",
      "narrator": "Sa'eed bin Yazid Abu Maslamah said:",
      "english_text": "\"I said to Anas bin Malik: 'Would Allah's Messenger (S) perform Salat wearing his sandals?' He said: 'Yes.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 254,
      "hadithNum_inBook": 402,
      "title": "Jami` at-Tirmidhi 401",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "\"The Prophet (S) would perform the Qunut in the Subh and Maghrib prayers.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 255,
      "hadithNum_inBook": 403,
      "title": "Jami` at-Tirmidhi 402",
      "narrator": "Abu Malik Al-Ashjai narrated:",
      "english_text": "\"I said to my father: 'O my father! You offered Salat behind Allah's Messenger (S), Abu Bakr, Umar, Uthman, and Ali bin Abi Talib here in Al-Kufah for about five years. Did they say the Qunut?' He said: 'It is a newly invented matter my son.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 256,
      "hadithNum_inBook": 404,
      "title": "Jami` at-Tirmidhi 403",
      "narrator": "There is another narration from Abu Malik:",
      "english_text": "There exists another narration from Abu Malik with similar meaning but with different chain.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 257,
      "hadithNum_inBook": 405,
      "title": "Jami` at-Tirmidhi 404",
      "narrator": "Muadh bin Rifa'ah narrated that his father said:",
      "english_text": "\"I prayed behind Allah's Messenger (S). I sneezed and said: Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda (All praise is due to Alah, many good blessed praises, blessings for Him as our Lord loves and is pleased with.) When Allah's Messenger (S) prayed and turned (after finishing) he said: 'Who was the speaker during the Salat?' No one spoke. Then he said it a second time: 'Who was the speaker during the Salat?' But no one spoke. Then he said it a third time: 'Who was the speaker during the Salat?'\" So Rifa'ah bin Rafi bin Afra said: \"It was I, O Messenger of Allah (S).\" He said: \"What did you say?\" He said: \"I said: 'Al-Hamdulillah, hamdan kathiran tayyiban mubarakan fih, mubarakan alaihi kama yuhibbu Rabbana Wa Yarda. The Prophet (S) said: \"By the One in Whose Hand is my soul! I saw thirty-some angels competing over which of then would ascend with it.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 258,
      "hadithNum_inBook": 406,
      "title": "Jami` at-Tirmidhi 405",
      "narrator": "Zaid bin Arqam narrated:",
      "english_text": "\"We used to talk behind Allah's Messenger (S) during the Salat, a man among us would talk to his companions next to him until (the following) was revealed: And stand before Allah with obedience. (2:238) So we were ordered to be silent and prohibited from talking.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 259,
      "hadithNum_inBook": 407,
      "title": "Jami` at-Tirmidhi 406",
      "narrator": "Asma bin Al-Hakam Al-Fazari said:",
      "english_text": "\"I heard Ali saying: 'Indeed I am a man who, when I heard a Hadith from Allah's Messenger (S) then Allah causes me to benefit from it as much as He wills for me to benefit from it. When a man among his Companions narrated to me I ask him to swear an oath to me about it, and when he swears an oath to me I trust him. And Abu Bakr narrated to me - and Abu Bakr told the truth - he said: \"I heard Allah's Messenger (S) saying: 'There is no man who commits a sin, then makes Wudu, then performs Salat, then seeks forgiveness from Allah, except that Allah forgives him.' Then he recited this Ayah: Those who when they have committed Fahishah or wronged themselves with eveil, remember Allah. (3:135) until the end of the Ayah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 260,
      "hadithNum_inBook": 408,
      "title": "Jami` at-Tirmidhi 407",
      "narrator": "(Sabrah bin Ma'bad al-Juhni) narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Teach the boy Salat when he is seven years old, and beat him (if he does not pray) when he is ten.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 261,
      "hadithNum_inBook": 409,
      "title": "Jami` at-Tirmidhi 408",
      "narrator": "Abdullah bin Amr narrated that:",
      "english_text": "Allah's Messenger (S) said: \"When he commits Hadath - meaning a man - and he is sitting in the end of his Salat before saying the Taslim, then his Salat is acceptable.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 262,
      "hadithNum_inBook": 410,
      "title": "Jami` at-Tirmidhi 409",
      "narrator": "Jabir narrated:",
      "english_text": "\"We were with the Prophet (S) on a journey when it started to rain on us, so the Prophet (S) said: 'Whoever wishes, let him perform Salat in his place.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 263,
      "hadithNum_inBook": 411,
      "title": "Jami` at-Tirmidhi 410",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Some of the poor people came to Allah's Messenger (S) and said: 'O Messenger of Allah (S)! The rich pray as we pray, they fast as we fast, but they have wealth with which they free slaves and which they give in charity.' He said: 'When you perform Salat, then say: 'Subhan Allah' thirty-three times, and: 'Al-Hamdulillah' thirty-three times, and: 'Allahu Akbar' thirty-four times, and 'La ilaha illallah' ten times. With that you will have surprassed them, and none would surpass you afterwards.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 264,
      "hadithNum_inBook": 412,
      "title": "Jami` at-Tirmidhi 411",
      "narrator": "Amr bin Uthman bin Ya'la bin Murrah narrated from his father, from his grand-father that :",
      "english_text": "They were with the Prophet (S) on a journey. They wound up in a narrow area when Salat became due. Then it began raining from the sky above them, and it was wet beneath them. So Allah's Messenger (S) called the Adhan while he was on his mount, and then the Iqamah, going forward on his mount. He let them in Salat by making gestures, making his prostrations lower than his bowing.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 265,
      "hadithNum_inBook": 413,
      "title": "Jami` at-Tirmidhi 412",
      "narrator": "Al-Mughirah bin Shu'bah narrated:",
      "english_text": "\"Allah's Messenger (S) performed Salat until his feet were swollen, so it was said to him: 'You burden yourself like this, while your past and future sins have been forgiven?' He said: 'Shouldn't I be a grateful worshipper?'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 266,
      "hadithNum_inBook": 414,
      "title": "Jami` at-Tirmidhi 413",
      "narrator": "Huraith bin Qabisah narrated:",
      "english_text": "\"I arrived in Al-Madinah and said: 'O Allah! Facilitate me to be in a righteous gathering.'\" He said: \"I sat with Abu Hurairah and said: 'Indeed I asked Allah to provide me with a righteous gathering. So narrate a hadith to me which you heard from Allah's Messenger () so that perhaps Allah would cause me to benefit from it.' He said: 'I heard Allah's Messenger () say: \"Indeed the first deed by which a servant will be called to account on the Day of Resurrection is his Salat. If it is complete, he is successful and saved, but if it is defective, he has failed and lost. So if something is deficient in his obligatory (prayers) then the Lord, Mighty and Sublime says: 'Look! Are there any voluntary (prayers) for my worshipper?' So with them, what was deficient in his obligatory (prayers) will be completed. Then the rest of his deeds will be treated like that.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 267,
      "hadithNum_inBook": 415,
      "title": "Jami` at-Tirmidhi 414",
      "narrator": "Aishah narrated that Allah's Messenger (S) said:",
      "english_text": "\"Whoever is regular with twelve Rak'ah of Sunnah (prayer), Allah will build a house for him in Paradise: Four Rak'ah before Zuhr, two Rak'ah after it, two Rak'ah after Maghrib, two Rak'ah after Isha, and two Rak'ah before Fajr.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 268,
      "hadithNum_inBook": 416,
      "title": "Jami` at-Tirmidhi 415",
      "narrator": "Umm Habibah narrated that Allah's Messenger (S) sad:",
      "english_text": "\"Whoever prays twelve Rak'ah in a day and night, a house will be built from him in Paradise: Four Rak'ah before Zuhr, two Rak'ah after it, two Rak'ah after Maghrib, two Rak'ah after Isha, and two Rak'ah before Fajr in the morning Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 269,
      "hadithNum_inBook": 417,
      "title": "Jami` at-Tirmidhi 416",
      "narrator": "Aishah narrated that :",
      "english_text": "Allah's Messenger (S) said: \"The two Rak'ah of Fajr are better than the world and what is in it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 270,
      "hadithNum_inBook": 418,
      "title": "Jami` at-Tirmidhi 417",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"I watched the Prophet (S) for a month. In the two Rak'ah before Fajr he would recite: Say: \"O you disbelievers!\" and Say: \"Allah is One\".\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 271,
      "hadithNum_inBook": 419,
      "title": "Jami` at-Tirmidhi 418",
      "narrator": "Aishah narrated:",
      "english_text": "\"When Allah's Messenger (S) prayed the two Rak'ah (before) Fajr if he needed something from me he would talk to me, if not, he would go to Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 272,
      "hadithNum_inBook": 420,
      "title": "Jami` at-Tirmidhi 419",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "Allah's Messenger (S) said: \"There is no Salat after Al-Fajr (begins) except two prostrations.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 273,
      "hadithNum_inBook": 421,
      "title": "Jami` at-Tirmidhi 420",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"When one of you prays the two Rak'ah of Fajr then let him lay down on his right (side).\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 274,
      "hadithNum_inBook": 422,
      "title": "Jami` at-Tirmidhi 421",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"When the Iqamah has been called for the Salat then there is no Salat except the obligatory.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 275,
      "hadithNum_inBook": 423,
      "title": "Jami` at-Tirmidhi 422",
      "narrator": "Qais narrated:",
      "english_text": "\"Allah's Messenger (S) went out and the Iqamah was called for the Salat so I prayed As-Subh with him. Then the Prophet (S) turned and found me performing Salat so he said: 'Easy O Qais! Are there two prayers together?' I said: 'O Messenger of Allah! I did not perform the two Rak'ah (before) Fajr.' He said: 'Then there is no harm.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 276,
      "hadithNum_inBook": 424,
      "title": "Jami` at-Tirmidhi 423",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Whoever did not pray the two Rak'ah (before) Fajr then let him pray them after the sun has risen.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 277,
      "hadithNum_inBook": 425,
      "title": "Jami` at-Tirmidhi 424",
      "narrator": "Ali narrated:",
      "english_text": "\"The Prophet (S) would pray four Rak'ah before Az-Zuhr and two Rak'ah after it.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 278,
      "hadithNum_inBook": 426,
      "title": "Jami` at-Tirmidhi 425",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"I prayed two Rak'ah with the Prophet (S) before Az-Zuhr and two Rak'ah after it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 279,
      "hadithNum_inBook": 427,
      "title": "Jami` at-Tirmidhi 426",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Prophet (S) would not perform the four Rak'ah before Az-Zuhr he would pray them after it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 280,
      "hadithNum_inBook": 428,
      "title": "Jami` at-Tirmidhi 427",
      "narrator": "Umm Habibah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Whoever prays four before Az-Zuhr and four after, Allah makes him prohibited for the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 281,
      "hadithNum_inBook": 429,
      "title": "Jami` at-Tirmidhi 428",
      "narrator": "Umm Habibah the wife of the Prophet (S) narrated that:",
      "english_text": "She heard Allah's Messenger (S) saying: \"Whoever maintains four Rak'ah before Az-Zuhr and four after it, Allah makes him prohibited for the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 282,
      "hadithNum_inBook": 430,
      "title": "Jami` at-Tirmidhi 429",
      "narrator": "Ali narrated:",
      "english_text": "\"Allah's Messenger (S) would pray four Rak'ah before Al-Asr separating between them with At-Taslim upon the angels that are close (to Allah) and those who follow them among the Muslims and the believers.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 283,
      "hadithNum_inBook": 431,
      "title": "Jami` at-Tirmidhi 430",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "The Prophet (S) said: \"May Allah have mercy upon a man who prays four before Al-Asr.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 284,
      "hadithNum_inBook": 432,
      "title": "Jami` at-Tirmidhi 431",
      "narrator": "Abdullah bin Mas'ud narrated:",
      "english_text": "\"I can not enumerate (how many times) I heard Allah's Messenger (S) reciting - in the two Rak'ah after Al-Maghrib and the two Rak'ah before Salatul-Fajr with: Say: \"O you disbelievers!\" and Say: \"He is Allah the One.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 285,
      "hadithNum_inBook": 433,
      "title": "Jami` at-Tirmidhi 432",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"I prayed two Rak'ah after Al-Maghrib with the Prophet (S) in his house.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 286,
      "hadithNum_inBook": 434,
      "title": "Jami` at-Tirmidhi 433",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"I memorized ten Rak'ah from Allah's Messenger (S) which he would pray in a night and a day: Two Rak'ah before Az-Zuhr, two after it; two Rak'ah after Al-Maghrib and two Rak'ah after the latter Isha.\" He said: \"And Hafsah narrated to me that he (S) would pray two Rak'ah before Al-Fajr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 287,
      "hadithNum_inBook": 435,
      "title": "Jami` at-Tirmidhi 434",
      "narrator": "Ibn Umar :",
      "english_text": "has a similar narration",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 288,
      "hadithNum_inBook": 436,
      "title": "Jami` at-Tirmidhi 435",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Whoever prays six Rak'ah after Al-Maghrib, and he does not speak about anything between them, then they will be counted for him as twelve years of worship.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 289,
      "hadithNum_inBook": 437,
      "title": "Jami` at-Tirmidhi 436",
      "narrator": "Abdullah bin Shaqiq said:",
      "english_text": "\"I asked Aishah about the Salat of Allah's Messenger (S). She said: 'He would pray four Rak'ah before Az-Zuhr and two Rak'ah after it, and two after Al-Maghrib, and two Rak'ah after Al-Isha, and two before Al-Fajr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 290,
      "hadithNum_inBook": 438,
      "title": "Jami` at-Tirmidhi 437",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Prophet (S) said: \"Salat in the night is two by two. So when you fear the dawn (is near) then make it odd by one, and make that the last of your Salat odd.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 291,
      "hadithNum_inBook": 439,
      "title": "Jami` at-Tirmidhi 438",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"The most virtuous fasting after the month of Ramadan is that of Allah's month of Al-Muharram. And the most virtuous Salat after the obligatory is the night prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 292,
      "hadithNum_inBook": 440,
      "title": "Jami` at-Tirmidhi 439",
      "narrator": "Sa'eed bin Abi Sa'eed Al-Maqburi narrated that:",
      "english_text": "Sa'eed bin Abi Sa'eed Al-Maqburi narrated that Abu Salamah informed him that he had asked Aishah: \"How was the Salat of Allah's Messenger (A) [at night] during Ramadan?\" She said: \"Allah's Messenger (S) would pray - neither in Ramadan nor in any other month - more than eleven Rak'ah. He would pray four, and do not ask about their excellence or length, then he would pray four, and do not ask about their excellence or length, then he would pray three.\" Aishah said: \"I asked: 'O Messenger of Allah! Do you sleep before having performed Witr?\" He said: 'O Aishah! Indeed my eyes sleep but my heart does not sleep.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 293,
      "hadithNum_inBook": 441,
      "title": "Jami` at-Tirmidhi 440",
      "narrator": "Aishah narrated:",
      "english_text": "\"Allah's Messenger (S) would pray eleven Rak'ah at night, making them off with one. When he finished them he would lay down on his right side.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 294,
      "hadithNum_inBook": 442,
      "title": "Jami` at-Tirmidhi 441",
      "narrator": "Narrator mot mentioned:",
      "english_text": "Another chain with similar narration",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 295,
      "hadithNum_inBook": 443,
      "title": "Jami` at-Tirmidhi 442",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet (S) would pray thirteen Rak'ah at night.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 296,
      "hadithNum_inBook": 444,
      "title": "Jami` at-Tirmidhi 443",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet (S) would pray nine Rak'ah in the night.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 297,
      "hadithNum_inBook": 445,
      "title": "Jami` at-Tirmidhi 444",
      "narrator": "Narrator not mentioned:",
      "english_text": "(Another chain with similar narration)",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 298,
      "hadithNum_inBook": 446,
      "title": "Jami` at-Tirmidhi 445",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Prophet (S) did not pray at night because he was prevented from it by sleep or being sleepy then he would pray twelve Rak'ah during the daytime.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 299,
      "hadithNum_inBook": 447,
      "title": "Jami` at-Tirmidhi 446",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "Allah's Messenger (S) said: \"Allah, Blessed and Exalted is He, descends to the earth's heaven every night when the first third of the night has passed. He says: \"I am the Sovereign. Is there any who calls upon Me so that I may respond to him? Is there any who asks of Me that I may give him? Is there any who seeks forgiveness from Me so that I may forgive him?' He continues in that until the illumination of Al-Fajr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 300,
      "hadithNum_inBook": 448,
      "title": "Jami` at-Tirmidhi 447",
      "narrator": "Abu Qatadah narrated that :",
      "english_text": "The Prophet (S) said to Abu Bakr: \"I passed by you while you were reciting and your voice was low.\" He said: \"I let He who, I was consulting hear.\" He said: \"Raise your voice.\" Then he said to Umar: \"I passed by while you were reciting and your voice was loud.\" So he said: \"I repel drowsiness and keep Ash-Shaitan away.\" So he said: \"Lower your voice.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 301,
      "hadithNum_inBook": 449,
      "title": "Jami` at-Tirmidhi 448",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet (S) stood (in prayer) with an Ayah from the Qur'an at night\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 302,
      "hadithNum_inBook": 450,
      "title": "Jami` at-Tirmidhi 449",
      "narrator": "Abdullah bin Abi Qais narrated:",
      "english_text": "\"I asked Aishah how the recitation of the Prophet (S) was at night. [Would he recite silently o audibly?] So she said: 'He would do both of those. Sometimes he was silent with his recitation and sometimes it was audible.' So I said: 'All praise is due to Allah, the One who made the matter broad.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 303,
      "hadithNum_inBook": 451,
      "title": "Jami` at-Tirmidhi 450",
      "narrator": "Zaid bin Thabit narrated that:",
      "english_text": "The Prophet (S) said: \"The most virtuous prayer of yours is in your homes, except for the obligatory.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 304,
      "hadithNum_inBook": 452,
      "title": "Jami` at-Tirmidhi 451",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "The Prophet (S) said: \"Offer Salat in your homes and do not turn them into graves.\"",
      "grade": "Sahih (Darussalam)"
    }
  ]
}