{
  "chapterNum": 8,
  "english_title": "The Book on Fasting",
  "totalHadiths_inChapter": 127,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 682,
      "title": "Jami` at-Tirmidhi 682",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 683,
      "title": "Jami` at-Tirmidhi 683",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 684,
      "title": "Jami` at-Tirmidhi 684",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 685,
      "title": "Jami` at-Tirmidhi 685",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 686,
      "title": "Jami` at-Tirmidhi 686",
      "narrator": "Silah bin Zufar said:",
      "english_text": "\"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 687,
      "title": "Jami` at-Tirmidhi 687",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 688,
      "title": "Jami` at-Tirmidhi 688",
      "narrator": "Ibn Abbas narrated that :",
      "english_text": "the Messenger of Allah said: \"Do not fast before Ramadan. Fast with its sighting, and break fast with its sighting, and if it is obscured from you, then complete thirty days.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 689,
      "title": "Jami` at-Tirmidhi 689",
      "narrator": "Ibn Mas`ud said:",
      "english_text": "\"What I fasted with the Prophet that was twenty-nine (days), was more than what we fasted that was thirty.\"\n(He said): There are narrations on this topic from `Umar, Abu Hurairah, `A'isha, Sa`d bin Abi Waqqas, Ibn `Abbas, Ibn `Umar, Anas, Jabir, Umm Salamah, Abu Bakrah, that the Prophet (ﷺ) said: \"The month is twenty nine (days).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 690,
      "title": "Jami` at-Tirmidhi 690",
      "narrator": "Anas narrated:",
      "english_text": "\"The Messenger of Allah vowed to stay away from his wives for a month, so he stayed in a loft for twenty-nine days. They said: 'O Messenger of Allah, your vow was for a month,' so he said: 'The month is twenty-nine (days).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 691,
      "title": "Jami` at-Tirmidhi 691",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 692,
      "title": "Jami` at-Tirmidhi 692",
      "narrator": "Abdur-Rahman bin Abi Bakrah narrated from his father that :",
      "english_text": "the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 693,
      "title": "Jami` at-Tirmidhi 693",
      "narrator": "Muhammad bin Abi Harmalah narrated:",
      "english_text": "\"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 694,
      "title": "Jami` at-Tirmidhi 694",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "the Messenger of Allah said: \"Whoever has dried dates, then let him break the fast with that, and whoever does not, then let him break the fast with water, for indeed water is purifying.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 695,
      "title": "Jami` at-Tirmidhi 695",
      "narrator": "Salman bin Amir Ad-Dabbi narrated that :",
      "english_text": "the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 696,
      "title": "Jami` at-Tirmidhi 696",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Messenger of Allah would break the fast with fresh dates before performing Salat. If there were no fresh dates then (he would break the fast) with dried dates, and if there were no dried dates then he would take a few sips of water.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 697,
      "title": "Jami` at-Tirmidhi 697",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 698,
      "title": "Jami` at-Tirmidhi 698",
      "narrator": "Umar bin Al-Khattab narrated that:",
      "english_text": "The Messenger of Allah said: \"When the night advances and the day retreats, and the sun is hidden, then the fast is to be broken.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 699,
      "title": "Jami` at-Tirmidhi 699",
      "narrator": "Sahl bin Sa'd narrated that :",
      "english_text": "the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 700,
      "title": "Jami` at-Tirmidhi 700",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 701,
      "title": "Jami` at-Tirmidhi 701",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "(A Hadith similar to no. 700 with a different chain).",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 702,
      "title": "Jami` at-Tirmidhi 702",
      "narrator": "Abu Atiyyah said:",
      "english_text": "\"Masruq and I entered upon Aishah and we said: 'O Mother of the Believers! There are two men from the Companions of Muhammad, one of them hastens to break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 703,
      "title": "Jami` at-Tirmidhi 703",
      "narrator": "Anas (bin Malik) narrated that :",
      "english_text": "Zaid bin Thabit said: \"We ate Sahar with the Messenger of Allah, then we stood for the Salat.\" I (Anas) said: \"How long was that?\" He said: \"About the lengthy of fifty Ayahs.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 704,
      "title": "Jami` at-Tirmidhi 704",
      "narrator": "Anas (bin Malik) narrated:",
      "english_text": "(Another chain) except that he said: \"About the length for reciting fifty Ayahs.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 705,
      "title": "Jami` at-Tirmidhi 705",
      "narrator": "Talq bin Ali narrated that :",
      "english_text": "The Messenger of Allah said: \"Eat and drink, and do not be disturbed by the rising glow, eat and drink until the redness appears to you on the horizon.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 706,
      "title": "Jami` at-Tirmidhi 706",
      "narrator": "Samurah bin Jundub narrated that :",
      "english_text": "the Messenger of Allah said: \"Do not let the Adhan of Bilal prevent you from your Sahar, nor the drawn out Fajr, but the Fajr that spreads on the horizon.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 707,
      "title": "Jami` at-Tirmidhi 707",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 708,
      "title": "Jami` at-Tirmidhi 708",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "the Messenger of Allah said: \"Partake of Sahar, for indeed there is a blessing in the Sahar.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 709,
      "title": "Jami` at-Tirmidhi 709",
      "narrator": "Amr bin Al-As narrated :",
      "english_text": "(similar to no. 708) from the Prophet.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 710,
      "title": "Jami` at-Tirmidhi 710",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"The Messenger of Allah went to Makkah in the Year of the Conquest, so he fasted until he reached Kura Al-Ghamim and the people were fasting with him. Then it was said to him: 'The fast has become difficult for the people, and they are watching you to see what you will do.' So after Asr, he called for a cup of water and drank it while the people were looking at him. Some of them broke the fast while some of them continued their fasting. It was conveyed to him that people were still fasting, so he said: \"Those are the disobedient.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 711,
      "title": "Jami` at-Tirmidhi 711",
      "narrator": "Aishah narrated that :",
      "english_text": "Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 712,
      "title": "Jami` at-Tirmidhi 712",
      "narrator": "Abu Sa'eed (Al-Khudri) narrated:",
      "english_text": "\"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 713,
      "title": "Jami` at-Tirmidhi 713",
      "narrator": "Abu Sa'eed Al-Khudri narrated:",
      "english_text": "\"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 714,
      "title": "Jami` at-Tirmidhi 714",
      "narrator": "Ma'mar bin Abi Huyaiyah narrated that:",
      "english_text": "he asked Ibn Al-Musaiyab about fasting on a journey, so he narrated to him that Umar bin Al-Khattab said: \"We fought in two battles along with the Messenger of Allah during Ramadan; the Day of Badr, and the Conquest (of Makkah), so we broke our fast during them.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 715,
      "title": "Jami` at-Tirmidhi 715",
      "narrator": "Anas bin Malik, a man from Banu Abdullah bin Ka'b said:",
      "english_text": "\"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - or fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the breast-feeding person.' And by Allah! The Prophet said both of them or one of them. So woe to me! For I did not eat from the meal of the Prophet.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 716,
      "title": "Jami` at-Tirmidhi 716",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 717,
      "title": "Jami` at-Tirmidhi 717",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "(A Hadith similar to no. 716 with a different chain.)",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 718,
      "title": "Jami` at-Tirmidhi 718",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "the Prophet said: \"Whoever died while he had a month to fast, then a needy person should be fed on his behalf in place of every day.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 719,
      "title": "Jami` at-Tirmidhi 719",
      "narrator": "Abu Sa'eed Al-Khudri narrated that:",
      "english_text": "the Messenger of Allah said: \"Three things do not break the fast of the fasting person: Cupping, vomiting, and the wet dream.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 720,
      "title": "Jami` at-Tirmidhi 720",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"Whoever is overcome by vomiting, then he is not required to make up (the fast), and whoever vomits on purpose, then he must make it up.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 721,
      "title": "Jami` at-Tirmidhi 721",
      "narrator": "Abu Hurairah narrated that\nthe Messenger of Allah said:",
      "english_text": "\"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision that Allah provided for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 722,
      "title": "Jami` at-Tirmidhi 722",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "(Another chain) with the same or similar (Hadith as no. 721).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 723,
      "title": "Jami` at-Tirmidhi 723",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"Whoever breaks the fast during Ramadan without an allowance or illness, then if he fasted for all time, his fasting would not make up for it.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 724,
      "title": "Jami` at-Tirmidhi 724",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "A man came and said: \"O Messenger of Allah; I am ruined!\" He said: \"What has ruined you?\" He said: \"I had sexual relations with my wife during Ramadan.\" He said: \"Are you able to free a slave?\" He said, \"No.\" He said: \"Then are you able to fast for two consecutive months?\" He said, \"No.\" He said: \"Then are you able to feed sixty needy people?\" He said, \"No.\" He said: \"Sit.\" So he sat. A big basket full of dates was brought to the Prophet, and he said: \"Give it in charity.\" So he said: \"There is no one needier than us between its two mountains.\" So the Prophet laughing until his pre-molar teeth appeared, and he said: \"Then take it to feed your family.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 725,
      "title": "Jami` at-Tirmidhi 725",
      "narrator": "Abdullah bin Amir bin Rabi'ah narrated from his father who said:",
      "english_text": "\"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 726,
      "title": "Jami` at-Tirmidhi 726",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "a man came to the Prophet and said: \"My eyes are bothering me, can I use Kuhl while I am fasting?\" He said: \"Yes.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 727,
      "title": "Jami` at-Tirmidhi 727",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet would kiss during the month of fasting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 728,
      "title": "Jami` at-Tirmidhi 728",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah would fondle me while he was fasting, and he had the most control among you of his limb (li irbihi).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 729,
      "title": "Jami` at-Tirmidhi 729",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 730,
      "title": "Jami` at-Tirmidhi 730",
      "narrator": "Hafsah narrated that:",
      "english_text": "the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 731,
      "title": "Jami` at-Tirmidhi 731",
      "narrator": "Umm Hani narrated:",
      "english_text": "\"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 732,
      "title": "Jami` at-Tirmidhi 732",
      "narrator": "Simak bin Harb narrated:",
      "english_text": "\"A person from the offspring of Umm Hani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, and Umm Hani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this from Umm Hani?' He said: 'No Abu Salih and our family informed us of it from Umm Hani.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 733,
      "title": "Jami` at-Tirmidhi 733",
      "narrator": "Aishah, the Mother of the Believers, narrated:",
      "english_text": "\"The Messenger of Allah visited me one day and said: 'Do you have anything (to eat)?'\" She said: \"I said: 'No.' He said: 'Then I am fasting.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 734,
      "title": "Jami` at-Tirmidhi 734",
      "narrator": "Aishah, the Mother of the Believers, narrated:",
      "english_text": "\"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 735,
      "title": "Jami` at-Tirmidhi 735",
      "narrator": "Aishah narrated:",
      "english_text": "\"Hafsah and I were both fasting when we were presented some food that we really wanted, so we ate from it. The Messenger of Allah came, and Hafsah beat me to him - she was the daughter of her father - and she said: 'O Messenger of Allah! We were both fasting when we were presented with some food that we wanted, so we ate from it.' He said: 'Make up another day in its place.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 736,
      "title": "Jami` at-Tirmidhi 736",
      "narrator": "Umm Salamah narrated:",
      "english_text": "\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 737,
      "title": "Jami` at-Tirmidhi 737",
      "narrator": "(Another chain, a Hadith similar to no. 736) for that, from Aishah, :",
      "english_text": "from the Prophet.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 738,
      "title": "Jami` at-Tirmidhi 738",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"When a half of Sha'ban remains then do not fast.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 739,
      "title": "Jami` at-Tirmidhi 739",
      "narrator": "Aishah narrated:",
      "english_text": "\"I could not find the Messenger of Allah one night. So I left and found him at Al-Baqi. He said: 'Did you fear that you had been wronged by Allah and His Messenger?' I said: 'O Messenger of Allah! I thought that you had gone to one of your wives.' So he said: 'Indeed Allah, Mighty and Sublime is He, descends to the lowest Heavens during the night of the middle of Sha'ban, to grant forgiveness to more than the number of hairs on the sheep of (Banu) Kalb.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 740,
      "title": "Jami` at-Tirmidhi 740",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 741,
      "title": "Jami` at-Tirmidhi 741",
      "narrator": "An-Nu'man bin Sa'd narrated:",
      "english_text": "\"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 742,
      "title": "Jami` at-Tirmidhi 742",
      "narrator": "Abdullah narrated:",
      "english_text": "\"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 743,
      "title": "Jami` at-Tirmidhi 743",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Messenger of Allah said: \"None of you should fast on Friday unless he fasts before it, or he fasts after it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 744,
      "title": "Jami` at-Tirmidhi 744",
      "narrator": "Abdullah bin Busr narrated from his sister that :",
      "english_text": "the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 745,
      "title": "Jami` at-Tirmidhi 745",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet used to try to fast on Mondays and Thursdays.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 746,
      "title": "Jami` at-Tirmidhi 746",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 747,
      "title": "Jami` at-Tirmidhi 747",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 748,
      "title": "Jami` at-Tirmidhi 748",
      "narrator": "Ubaidullah (bin Muslim) Al-Qurashi narrated from his father who said:",
      "english_text": "\"I asked - or; the Prophet was asked - about fasting daily. So he said: 'Your family has a right over you.' Then he said: 'Fast Ramadan and that which is after it, and every Wednesday and Thursday. If you do that, then you will have fasted daily, as well as broken (the fast).'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 749,
      "title": "Jami` at-Tirmidhi 749",
      "narrator": "Abu Qatadah narrated that :",
      "english_text": "the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 750,
      "title": "Jami` at-Tirmidhi 750",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet broke (the fast) of Arafah, Umm Fadl sent him some milk to drink.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 751,
      "title": "Jami` at-Tirmidhi 751",
      "narrator": "Ibn Abi Najib narrated from his father who said:",
      "english_text": "\"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 752,
      "title": "Jami` at-Tirmidhi 752",
      "narrator": "Abu Qatadah narrated that :",
      "english_text": "the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 753,
      "title": "Jami` at-Tirmidhi 753",
      "narrator": "Aishah narrated:",
      "english_text": "\"Ashura was a day that the Quraish used to fast during Jahiliyyah, and the Messenger of Allah used to fast it. But when (the fast of) Ramadan became obligatory, the Ramadan was the required and Ashura was left. So whoever wanted to, he fasted it, and whoever wanted to, he left it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 754,
      "title": "Jami` at-Tirmidhi 754",
      "narrator": "Al-Hakam bin Al-Arfaj said:",
      "english_text": "\"I met up with Ibn Abbas while he was reclining on his Rida at the Zamzam (well). So I said: 'Inform me about the Day of Ashura. On which day is it fasted?' He said: 'When you see the crescent of Al-Muharram, then count, then fast on the morning of the ninth day.'\" He said: 'I said: Is this how Muhammad fasted it?' He said: 'Yes.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 755,
      "title": "Jami` at-Tirmidhi 755",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah ordered fasting the tenth day for the Day of Ashura.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 756,
      "title": "Jami` at-Tirmidhi 756",
      "narrator": "Aishah narrated:",
      "english_text": "\"I did not see the Prophet fasting at all during the ten.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 757,
      "title": "Jami` at-Tirmidhi 757",
      "narrator": "Ibn Abbas narrated that :",
      "english_text": "the Messenger of Allah said: \"There are no days in which righteous deeds are more beloved to Allah than those ten days.\" They said: \"O Messenger of Allah! Not even Jihad in Allah Cause?\" The Messenger of Allah said: \"Not even Jihad in Allah's Cause, unless a man were to out with his self and his wealth and not return from that with anything.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 758,
      "title": "Jami` at-Tirmidhi 758",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"There are no days more beloved to Allah that He be worshipped in them than the ten days of Dhul-Hijjah, fasting every day of them is the equivalent of fasting a year, and standing every night of them (in prayer) is the equivalent of standing on the Night of Qadr.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 759,
      "title": "Jami` at-Tirmidhi 759",
      "narrator": "Abu Ayub narrated that :",
      "english_text": "the Messenger of Allah said: \"Whoever fasts Ramadan, then follows it with six from Shawwal, then that is (equal in reward) to fasting everyday.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 760,
      "title": "Jami` at-Tirmidhi 760",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Messenger of Allah took a covenant from me for three: To not sleep except after performing Witr, to fast three days of every month, and to perform the Duha prayer.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 761,
      "title": "Jami` at-Tirmidhi 761",
      "narrator": "Abu Dharr narrated that :",
      "english_text": "the Messenger of Allah said: \"O Abu Dharr! When you fast three days out of a month, then fast the thirteenth, fourteenth, and fifteenth.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 762,
      "title": "Jami` at-Tirmidhi 762",
      "narrator": "Abu Dharr narrated:",
      "english_text": "\"The Messenger of Allah said: 'Whoever fasts three days in every month, then that is (similar to) fasting every day.' Then Allah Mighty and Sublime is He, attested to that in His Book, by revealing: Whoever brings a good deed, shall have ten times the like thereof. So a day is like ten.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 763,
      "title": "Jami` at-Tirmidhi 763",
      "narrator": "Yazid Ar-Rishk said:",
      "english_text": "\"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 764,
      "title": "Jami` at-Tirmidhi 764",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 765,
      "title": "Jami` at-Tirmidhi 765",
      "narrator": "Sahl bin Sa'd narrated that:",
      "english_text": "The Prophet said: \"There is a gate in Paradise called Ar-Raiyyan, those who fast shall be invited into it, and whoever was among those who fasted, then he will enter it; and whoever enters it, he will never thirst again.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 766,
      "title": "Jami` at-Tirmidhi 766",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Messenger of Allah said: \"There are two joys for the fasting person: the joy when he breaks his fast, and the joy of when he meets his Lord.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 767,
      "title": "Jami` at-Tirmidhi 767",
      "narrator": "Abu Qatadah said:",
      "english_text": "\"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 768,
      "title": "Jami` at-Tirmidhi 768",
      "narrator": "Abdullah bin Shaqiq narrated:",
      "english_text": "\"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 769,
      "title": "Jami` at-Tirmidhi 769",
      "narrator": "Jafar bin Humaid narrated that:",
      "english_text": "Anas bin Malik was asked about the Prophet's fasting and he said: \"He would fast during a month until we thought that he did not want to abstain from fasting during any of it. And, he would not fast during a month until we thought that he did not want to fast during any of it. (There was no time) that I wanted to see if he was performing Salat during the night, except that I would see him praying, nor to see him sleeping, except that I would see him sleeping.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 770,
      "title": "Jami` at-Tirmidhi 770",
      "narrator": "Abdullah bin Amr narrated that:",
      "english_text": "The Messenger of Allah said: \"The most virtuous fast is the fast of my brother Dawud. He would fast a day, and not fast (the next) day. He would not flee at the time of engagement (with the enemy).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 771,
      "title": "Jami` at-Tirmidhi 771",
      "narrator": "Abu Ubaid, the freed slave of Abdur-Rahman bin Awf narrated:",
      "english_text": "\"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 772,
      "title": "Jami` at-Tirmidhi 772",
      "narrator": "Abu Sa'eed Al-Khudri narrated:",
      "english_text": "\"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 773,
      "title": "Jami` at-Tirmidhi 773",
      "narrator": "Uqbah bin Amir narrated that :",
      "english_text": "The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 774,
      "title": "Jami` at-Tirmidhi 774",
      "narrator": "Rafi bin Khadi narrated that:",
      "english_text": "The Prophet said: \"The cupper and the one cupped have broke the fast.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 775,
      "title": "Jami` at-Tirmidhi 775",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"the Messenger of Allah was cupped while he was fasting and in Ihram.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 776,
      "title": "Jami` at-Tirmidhi 776",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet was cupped while he was fasting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 777,
      "title": "Jami` at-Tirmidhi 777",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 778,
      "title": "Jami` at-Tirmidhi 778",
      "narrator": "Anas narrated that :",
      "english_text": "the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 779,
      "title": "Jami` at-Tirmidhi 779",
      "narrator": "Abu Bakr Bin Abdur-Rahman bin Al-Harith bin Hashim said:",
      "english_text": "\"Aishah and Umm Salamah, the wives of the Prophet informed me that the Prophet would find that it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 780,
      "title": "Jami` at-Tirmidhi 780",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 781,
      "title": "Jami` at-Tirmidhi 781",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "The Prophet said: \"When one of you is invited (to a meal) and he is fasting, then let him said: 'Indeed I am fasting.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 782,
      "title": "Jami` at-Tirmidhi 782",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "The Prophet said: \"A woman may not fast a day - other than in the month of Ramadan - while her husband is present, except with his permission.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 783,
      "title": "Jami` at-Tirmidhi 783",
      "narrator": "Aishah narrated:",
      "english_text": "\"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 784,
      "title": "Jami` at-Tirmidhi 784",
      "narrator": "Laila narrated from the one who freed her (Umm Amarah) that:",
      "english_text": "The Prophet said: \"When those who are not fasting eat in the presence of the fasting person, the angels send Salat upon him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 785,
      "title": "Jami` at-Tirmidhi 785",
      "narrator": "Habib bin Zaid said:",
      "english_text": "\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother] Umm Amarah bint Ka'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 786,
      "title": "Jami` at-Tirmidhi 786",
      "narrator": "(Another chain) from Umm Amarah bint Ka'b Al-Ansari:",
      "english_text": "From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 787,
      "title": "Jami` at-Tirmidhi 787",
      "narrator": "Aishah narrated:",
      "english_text": "\"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 788,
      "title": "Jami` at-Tirmidhi 788",
      "narrator": "Asim bin Laqit bin Sabrah narrated:",
      "english_text": "From his father who said: \"I said. 'O Messenger of Allah! Inform me about Wudu.' So he said: \"Perform Wudu well, and go between the fingers, and perform Istinshaq extensively except when fasting.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 789,
      "title": "Jami` at-Tirmidhi 789",
      "narrator": "Aishah narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 790,
      "title": "Jami` at-Tirmidhi 790",
      "narrator": "Abu Hurairah and Aishah narrated:",
      "english_text": "\"The Prophet would perform I'tikaf during the last ten (days) of Ramadan until Allah took him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 791,
      "title": "Jami` at-Tirmidhi 791",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Messenger of Allah wanted to perform I'tikaf, he would perform Fajr prayer and then he would enter his place of I'tikaf.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 792,
      "title": "Jami` at-Tirmidhi 792",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah would Yujawir (stay in I'tikaf) during the last ten (nights) of Ramadan and he said: 'Seek the Night of Al-Qadr during the last ten (nights) of Ramadan.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 793,
      "title": "Jami` at-Tirmidhi 793",
      "narrator": "Zirr said:",
      "english_text": "\"I said to Ubayy bin Ka'b: 'O Abu Al-Mundhir! How do you know that it is the night of the twenty-seventh?' He said: 'Rather, the Messenger of Allah informed us that it is a night (after which) the sun rises without rays, so we counted and we remembered it. By Allah! Ibn Mas'ud learned that it is in Ramadan and that it is the nigh of the twenty-seventh, but he did not want to inform you lest you would depend on it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 794,
      "title": "Jami` at-Tirmidhi 794",
      "narrator": "Uyainah bin Abdur-Rahman narrated:",
      "english_text": "\"My father narrated to me: 'The Night of Al-Qadr was mentioned in the presence of Abu Bakrah, so he said: \"I do not search for it due to something that I heard from the Messenger of Allah, except for during the last ten (nights); for indeed I heard him say: 'Search for it when nine remain, or; when seven remain, or; when five remain, or; during the last three nights.'\" He (Uyainah) said: \"During the twenty (nights) of Ramadan, Abu Bakrah used to perform Salat just as he performed Salat during the rest of the year. But when the (last) ten began, he would struggle (performing more Salat during the night).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 795,
      "title": "Jami` at-Tirmidhi 795",
      "narrator": "Ali narrated:",
      "english_text": "\"The Prophet would awaken his family during the last ten (nights) of Ramadan.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 796,
      "title": "Jami` at-Tirmidhi 796",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 797,
      "title": "Jami` at-Tirmidhi 797",
      "narrator": "Amir bin Mas'ud narrated that:",
      "english_text": "The Prophet said: \"Fasting during the winter is an easy reward.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 798,
      "title": "Jami` at-Tirmidhi 798",
      "narrator": "Salamah bin Al-Akwa said:",
      "english_text": "\"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 799,
      "title": "Jami` at-Tirmidhi 799",
      "narrator": "Muhammad bin Ka'b narrated:",
      "english_text": "\"I went to Anas bin Malik during Ramadan and he was about to travel. His mount was prepared for him, and he put on his traveling clothes, then he called for some food to eat, and I said to him: 'Is it Sunnah?' He said: 'It is Sunnah.' Then he rode.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 800,
      "title": "Jami` at-Tirmidhi 800",
      "narrator": "(Another chain) from Muhammad bin Ka'b who said:",
      "english_text": "\"I went to Anas bin Malik during Ramadan\" and he mentioned a similar narration (as no. 799).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 801,
      "title": "Jami` at-Tirmidhi 801",
      "narrator": "Al-Hasan bin Ali narrated that:",
      "english_text": "The Messenger of Allah said: \"The gift for the fasting person is (fragrant) oil and a censer.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 802,
      "title": "Jami` at-Tirmidhi 802",
      "narrator": "Aishah narrated that:",
      "english_text": "The Messenger of Allah said: \"Al-Fitr is the day that the people break the fast, and Al-Adha is the day that the people sacrifice.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 803,
      "title": "Jami` at-Tirmidhi 803",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Prophet would perform I'tikaf during the last ten (nights) of Ramadan. One year he did not perform I'tikaf, so he performed I'tikaf for twenty (nights) in the following year.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 804,
      "title": "Jami` at-Tirmidhi 804",
      "narrator": "Aishah narrated:",
      "english_text": "\"When the Messenger of Allah performed I'tikaf, he would bring his head near me so I could comb it, and he would not enter the house except for some personal needs.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 805,
      "title": "Jami` at-Tirmidhi 805",
      "narrator": "That was narrated to us by Quraibah :",
      "english_text": "From Al-Laith (a similar narration as no. 804)",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 806,
      "title": "Jami` at-Tirmidhi 806",
      "narrator": "Abu Dharr narrated:",
      "english_text": "\"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 807,
      "title": "Jami` at-Tirmidhi 807",
      "narrator": "Zaid bin Khalid Al-Juhani narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for him is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 808,
      "title": "Jami` at-Tirmidhi 808",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Messenger of Allah would encourage the  night prayer in Ramadan without firmly ordering it, and he would say: \"Whoever stands (in the night prayer) for Ramadan with faith and seeking the reward (from Allah), then he will be forgiven what has preceded of his sins.' So the Messenger of Allah died and the matter was like that. Then the matter was the same during the Khilafah of Abu Bakr and it continued during a portion of the Khilafah of Umar bin Al-Khattab.\"",
      "grade": "Sahih (Darussalam)"
    }
  ]
}