{
  "chapterNum": 36,
  "english_title": "Chapters On Zuhd",
  "totalHadiths_inChapter": 112,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 2373,
      "title": "Jami` at-Tirmidhi 2304",
      "narrator": "Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Two favors that many of the people squander are health and free time.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 2374,
      "title": "Jami` at-Tirmidhi 2305",
      "narrator": "Al-Hasan narrated from Abu Hurairah that the Messenger of Allah (s.a.w)  said:",
      "english_text": "\"Who will take these statements from me, so that he may act upon them, or teach one who will act upon them?\" So Abu Hurairah said: \"I said: 'I shall O Messenger of Allah!' So he (s.a.w) took my hand and enumerated five (things), he said: \"Be on guard against the unlawful and you shall be the most worshiping among the people, be satisfied with what Allah has alloted for you and you shall be the richest of the people, be kind to your neighbor and you shall be a believer, love for the people what you love for yourself and you shall be a Muslim. And do not laugh too much, for indeed increased laughter kills the heart.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 2375,
      "title": "Jami` at-Tirmidhi 2306",
      "narrator": "Abu Hurairah, may Allah be pleased with him, narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Race to do works against seven. Are you waiting but for overwhelming poverty, or distracting richness, or debilitating illness, or babbling senility, or sudden death, or the Dajjal, so that hidden evil is what is awaited, or the Hour? The Hour is more calamitous and more bitter.\" (Daif)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 2376,
      "title": "Jami` at-Tirmidhi 2307",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Increase in remembrance of the severer of pleasures.\" Meaning death.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 2377,
      "title": "Jami` at-Tirmidhi 2308",
      "narrator": "Hani' the freed slave of 'Uthman said:",
      "english_text": "When 'Uthman would stop at a grave he would cry until his beard was soaked (in tears). It was said to him: 'The Paradise and the Fire were mentioned and you did not cry, yet you cry because of this?' So he said: 'Indeed the Messenger of Allah said: \"Indeed the grave is the first stage among the stages of the Hereafter. So if one is saved from it, then what comes after it is easier than it. And if one is not saved from it, then what comes after it is worse than it.\" And the Messenger of Allah said: \"I have not seen any sight except that the grave is more horrible than it.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 2378,
      "title": "Jami` at-Tirmidhi 2309",
      "narrator": "'Ubadah bin As-Samit narrated that the Messenger of Allah (s.a.w)  said:",
      "english_text": "\"Whoever loves to meet Allah,  Allah loves to meet him. Whoever is averse to meeting Allah, Allah is averse to meeting him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 2379,
      "title": "Jami` at-Tirmidhi 2310",
      "narrator": "'Aishah narrated:",
      "english_text": "\"When this Ayah was revealed: And warn your near kindred....(26:214), the Messenger of Allah (s.a.w) said:\n\"O Safiyyah bint 'Abdul-Muttalib! O Fatimah bint Muhammed! O Banu 'Abdul-Muttalib! I have no authority on your behalf over Allah for anything. Ask me for whatever you want of my wealth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 2380,
      "title": "Jami` at-Tirmidhi 2311",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said :",
      "english_text": "\"A man who cries out of fearing Allah, will not be put into the Fire until milk returns to the udder; and dust raised in the cause of Allah and the smoke of Jahannam will not be gathered together.\"\n\n[He said:] There are narrations on this topic from Abu Raihanah and Ibn 'Abbas. [He said:] This Hadith is [Hasan] Sahih. Muhammad bin 'Abdur-Rahman is the Mawla of the family of Talbah, and he is from Al-Madinah, and trustworthy. Shu'bah and Sufyan Ath-Thawri reported from him.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 2381,
      "title": "Jami` at-Tirmidhi 2312",
      "narrator": "Abu Dharr narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed I see what you do not see, and I hear what you do not hear. The Heavens moan, and they have the right to moan. There is no spot, the size of four fingers in them, except that there is an angel placing his forehead in it, prostrating to Allah. By Allah! If you knew what I know, then you would laugh little and you would cry much. And you would not taste the pleasures of your women in the beds, and you would go out beseeching Allah. And I wish that I was but a felled tree.\" \n\n[Abu 'Eisa said:] There are narrations on this topic from 'Aishah, Abu Hurairah, Ibn 'Abbas, and Anas. [He said:] This Hadith is Hasan Gharib. It has been related through routes other than this, that Abu Dharr said: \"I wish that I was a felled tree.\" And it has been related from Abu Dharr in Mawquf form.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 2382,
      "title": "Jami` at-Tirmidhi 2313",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"If you knew what I know, then you would laugh little and you would cry much.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 2383,
      "title": "Jami` at-Tirmidhi 2314",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed a man may utter a statement that he does not see any  harm in, but for which he will fall seventy autumns in the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 2384,
      "title": "Jami` at-Tirmidhi 2315",
      "narrator": "Bahz bin Hakim narrated from his father, from his grandfather that Prophet (s.a.w) said:",
      "english_text": "\"Woe to the one who talks about something to make the people laugh, in which he lies. Woe to him! Woe to him!\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 2385,
      "title": "Jami` at-Tirmidhi 2316",
      "narrator": "Anas bin Malik narrated that a man among his companions was dying so he said- meaning a man said to him:",
      "english_text": "\"Glad tidings of Paradise.\" To which the Messenger of Allah (s.a.w) said:\n\"You do not know. Perhaps he spoke of what did not concern him or he was greedy with that which would not decrease him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 2386,
      "title": "Jami` at-Tirmidhi 2317",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed among the excellence of a person's Islam is that he leaves what does not concern him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 2387,
      "title": "Jami` at-Tirmidhi 2318",
      "narrator": "Ali bin Al-Husain narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Surely, of the excellence of a person's Islam is that he leaves what does not concern him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 2388,
      "title": "Jami` at-Tirmidhi 2319",
      "narrator": "Muhammed bin 'Amr narrated from his father, from his grandfather who said:",
      "english_text": "\"I heard Bilal bin Al-Harith Al Muzani, the Companion of the Messenger of Allah (s.a.w) saying: 'I heard the Messenger of Allah (s.a.w) saying:\n\"Indeed one of you says a statement pleasing to Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His pleasure until the Day of Meeting Him. And one of you says a statement angering Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His anger until the Day of Meeting with Him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 2389,
      "title": "Jami` at-Tirmidhi 2320",
      "narrator": "Sahl bin Sa'd narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"If the world to Allah was equal to a mosquito's wing, then He would not allow the disbeliever to have a sip of water from it.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 2390,
      "title": "Jami` at-Tirmidhi 2321",
      "narrator": "Al-Mustawrid bin Shaddad said:",
      "english_text": "\"I was with the caravan of those who stopped with the Messenger of Allah (s.a.w) at a dead lamb. The Messenger of Allah (s.a.w) said: 'Do you think that this was insignificant to its owners when they threw it away?' They said:'Yes! It is because of its insignificance that they threw it away O Messenger of Allah!' He said: 'The world is more insignificant to Allah than this to its owners.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 2391,
      "title": "Jami` at-Tirmidhi 2322",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Lo! Indeed the world is cursed. What is in it is cursed, except for remembrance of Allah, what is conducive to that, the knowledgeable person and the learning person.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 2392,
      "title": "Jami` at-Tirmidhi 2323",
      "narrator": "Qa'is bin Abi Hazim said:",
      "english_text": "I heard Mustawrid, a member of Banu Fihr, saying: The Messenger of Allah (s.a.w) said:\n\"The world compared to the Hereafter is but like what one of you gets when placing his finger into the sea, so look at what you draw from it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 2393,
      "title": "Jami` at-Tirmidhi 2324",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The world is a prison for the believer and Paradise for the disbeliever.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 2394,
      "title": "Jami` at-Tirmidhi 2325",
      "narrator": "Abu Kabshah Al-Anmari narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"There are three things for which I swear and narrate to you about, so remember it.\" He said: \"The wealth of a slave (of Allah) shall not be decreased by charity, no slave (of Allah) suffers injustice and is patient with it except that Allah adds to his honor; no slave (of Allah) opens up a door to begging except that Allah opens a door for him to poverty\"- or a statement similar- \"And I shall narrate to you a narration, so remember it.\" He said: \"The world is only for four persons: A slave whom Allah provides with wealth and knowledge, so he has Taqwa of his Lord with it, nurtures the ties of kinship with it, and he knows that Allah has a right in it. So this is the most virtuous rank. And a slave whom Allah provides with knowledge, but He does not provide with wealth. So he has a truthful intent, saying: 'If I had wealth, then I would do the deeds of so-and-so with it.'  He has his intention, so their rewards are the same. And a slave whom Allah provides with wealth, but He does not provide him with knowledge. [So he] spends his wealth rashly without knowledge, nor having Taqwa of his Lord, nor nurturing the ties of kinship, and he does not know that Allah has a right in it. So this is the most despicable rank. And a slave whom Allah does not provide with wealth nor knowledge, so he says: 'If I had wealth, then I would do the deeds of so-and-so with it.' He has his intention, so their sin is the same.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 2395,
      "title": "Jami` at-Tirmidhi 2326",
      "narrator": "'Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Whoever suffers from destitution and he beseeches the people for it, his destitution shall not end. And whoever suffers from destitution and he beseeches Allah for it, Allah will send provisions to him, sooner or later.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 2396,
      "title": "Jami` at-Tirmidhi 2327",
      "narrator": "Abu Wail narrated:",
      "english_text": "\"Mu'awiyah came to Abu Hashim bin 'Uthbah to visit him when he was ill (and dying). He said: 'O Uncle! Why do you cry? Is it from the pangs of death or desire for this world?' He said: 'Neither of these. But the Messenger of Allah (s.a.w) had commissioned me with an obligation that I did not abide by. He (s.a.w) said: \"It suffices you to gather the wealth of a servant or a rider in the cause of Allah.\" And (it is only) today I find that I have gathered it.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 2397,
      "title": "Jami` at-Tirmidhi 2328",
      "narrator": "Abdullah [bin Mas'ud] narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Do not take to the estate, such that you become desirous  of the world.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 2398,
      "title": "Jami` at-Tirmidhi 2329",
      "narrator": "'Abdullah bin Busr narrated that a Bedouin said:",
      "english_text": "\"O Messenger of Allah! Who is the best of the people?\" He said: \"He whose life is long and his deeds are good.\"There are narrations on this topic from Abu Hurairah and Jabir.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 2399,
      "title": "Jami` at-Tirmidhi 2330",
      "narrator": "'Abdur-Rahman bin Abi-Bakrah narrated from his father that a man  said:",
      "english_text": "\"O Messenger of Allah! Which of the people is the best?\" He said: \"He whose life is long and his deeds are good.\" He said: \"Then which of the people is the worst?\" He said: \"He whose life is long and his deeds are bad.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 2400,
      "title": "Jami` at-Tirmidhi 2331",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The lifespan for my Ummah is from sixty years to seventy [years].\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 2401,
      "title": "Jami` at-Tirmidhi 2332",
      "narrator": "Anas bin Malik narrated that the Allah's Messenger (s.a.w) said:",
      "english_text": "\"The hour shall not be established until time is constricted, and the year is like a month, a month is like the week, and the week is like the day, and the day is like the hour, and the hour is like the flare of the fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 2402,
      "title": "Jami` at-Tirmidhi 2333",
      "narrator": "Mujahid narrated that Ibn 'Umar said:",
      "english_text": "\"The Messenger of Allah (s.a.w) grabbed me on part of my body and said: 'Be in the world like a stranger or a passerby, and count   yourself among the inhabitants of the grave.'\" Ibn 'Umar said to me: \"When you wake up in the morning, then  do not concern  yourself  with the evening. And when you reach the evening, then do not concern yourself with the morning. Take from your health before your illness, and from your life before your death, for indeed O slave of Allah! You do not know  what your description shall be tomorrow.\" (sahih)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 2403,
      "title": "Jami` at-Tirmidhi 2334",
      "narrator": "Anas bin Malik narrated that that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"This is the son of Adam, and this is his life-span.\" And he placed his hand at the (height of the) nape of his neck, then he extended it (higher) and said:\" From there is what is hoped for, from there is what is hoped for.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 2404,
      "title": "Jami` at-Tirmidhi 2335",
      "narrator": "Abu As-Safr narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"The Messenger of Allah (s.a.w) passed by us while we were repairing a hut of ours, so he said: 'What is this?' We said:\"It has become weak, so we are repairing it.' He said: 'I do not think  but that the matter (of life) is more in fleeting than that.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 2405,
      "title": "Jami` at-Tirmidhi 2336",
      "narrator": "Ka'b bin 'Iyad narrated that the Prophet (s.a.w) said:",
      "english_text": "\"Indeed there is a fitnah for every Ummah, and the Fitnah for my Ummah is wealth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 2406,
      "title": "Jami` at-Tirmidhi 2337",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah said:",
      "english_text": "\"If the Son of Adam had a valley of gold, then he would still like to have a second . And nothing fills his mouth but dust, Allah turns to whoever repents.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 2407,
      "title": "Jami` at-Tirmidhi 2338",
      "narrator": "Abu Hurairah narrated that the Prophet (s.a.w) said:",
      "english_text": "\"The heart of an old man remains young because of love for two things: Long life , and much wealth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 2408,
      "title": "Jami` at-Tirmidhi 2339",
      "narrator": "Anas bin Malik narrated that the Prophet (s.a.w) said:",
      "english_text": "\"The Son Of Adan grows old, but two things keep him young: Desire for life and desire for wealth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 2409,
      "title": "Jami` at-Tirmidhi 2340",
      "narrator": "Abu Dharr narrated that the Prophet (s.a.w) said:",
      "english_text": "\"Abstinence in the world is not by prohibiting (oneself) the lawful nor by neglecting wealth , but  abstinence in the world is that you not hold more firmly to what is in your hand than to what is in the hand of Allah, and that you be more hopeful of the rewards that come with an affliction that you may suffer if it remain with you.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 2410,
      "title": "Jami` at-Tirmidhi 2341",
      "narrator": "'Uthman bin 'Affan narrated that the Prophet (s.a.w) said:",
      "english_text": "\"There is no right for the son of Adam in other than these things: A house which he lives in, a garment which covers his nakedness, and Jilf (a piece of bread) and water.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 2411,
      "title": "Jami` at-Tirmidhi 2342",
      "narrator": "Mutarrif narrated from his father, that he met up with the Prophet (s.a.w) while he was saying:",
      "english_text": "\"The mutual increase diverts you\". He (s.a.w) said: \"The son of Adam says:'My wealth, my wealth, but is there something for you from your wealth besides what you give in charity that remains, or you eat which perishes, or what you wear that grows worn?\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 2412,
      "title": "Jami` at-Tirmidhi 2343",
      "narrator": "Abu Umamah narrated that the Prophet (s.a.w) said:",
      "english_text": "\"O son of Adam! If you give your surplus it is better for you, and if you keep it, it is worse for you, but there is no harm with what is sufficient. And begin(the giving) with your dependents, and the upper hand (giving) is better than the lower hand (receiving).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 2413,
      "title": "Jami` at-Tirmidhi 2344",
      "narrator": "'Umar bin Al-Khattab narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"If you were to rely upon Allah with the required reliance, then He would provide for you just as a bird is provided for, it goes out in the morning empty, and returns full.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 2414,
      "title": "Jami` at-Tirmidhi 2345",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"There were two brothers during the time of the Messenger of Allah (s.a.w). One of them used to come to the prophet (s.a.w), and the other had some business. The businessman among them complained to the Prophet (s.a.w) about his brother, so he said:'Perhaps you are provided for because of him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 2415,
      "title": "Jami` at-Tirmidhi 2346",
      "narrator": "Salamah bin 'Ubaidullah bin Mihsan Al-Khatmi narrated from his father -and he was a Companion- who said:",
      "english_text": "\"The Messenger of Allah (s.a.w) said:\n\"Whoever among you wakes up in the morning secured in his dwelling, healthy in his body, having his food for the day,then it is as if the world has been gathered for him.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 2416,
      "title": "Jami` at-Tirmidhi 2347",
      "narrator": "Abu Umamah narrated that the Prophet (s.a.w) said:",
      "english_text": "\"Indeed the best of my friends to me is the one of meager conditions, whose share is in Salat, worshipping his Lord well and obeying him (even) in private. He is obscure among the people such that the fingers are not pointed towards him. His provisions are only what is sufficient and he is patient with that.\" Then he tapped with his fingers and said: \"His death comes quickly, his mourners are few, and his inheritance is little.\"With this (the above), chain it is narrated that the Prophet (s.a.w) said: \"My Lord presented to me, that He would make the valley of Makkah into gold for me, I said: 'No O Lord! But being filled for a day and hungry for a day\"-or he said: \"three days\" or something like that- \"So when I am hungry, I would beseech You and remember You, and when I am full I would be grateful to You and praise You.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 2417,
      "title": "Jami` at-Tirmidhi 2348",
      "narrator": "'Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"He has succeeded who accepts Islam, and is provided with what is sufficient and is made content by Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 2418,
      "title": "Jami` at-Tirmidhi 2349",
      "narrator": "Fadalah bin 'Ubaid narrated that he heard the Messenger of Allah (s.a.w) saying:",
      "english_text": "\"Glad tidings to whoever is guided to Islam, his livelihood was sufficient and he was satisfied.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 2419,
      "title": "Jami` at-Tirmidhi 2350",
      "narrator": "'Abdullah bin Maghaffal said:",
      "english_text": "\"A man said to the Prophet (s.a.w): 'O Messenger of Allah! By Allah! Indeed I love you!' So he said: 'Consider what you say.' He said: 'By Allah! I indeed love you!' Three times. He said: 'If you do love me, then prepare and arm yourself against poverty. For indeed poverty comes faster upon whoever loves me than the flood to its destination.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 2420,
      "title": "Jami` at-Tirmidhi 2351",
      "narrator": "Abu Sa'eed narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The poor Muhajirin will enter Paradise before the rich among them by five hundred years.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 2421,
      "title": "Jami` at-Tirmidhi 2352",
      "narrator": "Anas narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"O Allah! Cause me to live needy, and cause me to die needy and gather me in the group of the needy on the Day of Resurrection.\" 'Aishah said: \"Why O Messenger of Allah?\" He said: \"Indeed they enter Paradise before their rich by forty autumns. O 'Aishah! Do not turn away the needy even if with a piece of date. O 'Aishah! Love the needy and be near them, for indeed Allah will make you near on the Day of Judgement.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 2422,
      "title": "Jami` at-Tirmidhi 2353",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The poor are admitted into Paradise before the rich, by five hundres years, (i.e.) half a day.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 2423,
      "title": "Jami` at-Tirmidhi 2354",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The poor Muslims are admitted into Paradise before their rich by half a day. And that is five hundred years.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 2424,
      "title": "Jami` at-Tirmidhi 2355",
      "narrator": "Jabir bin 'Abdullah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"The poor Muslims are admitted into Paradise before their rich by forty autumns.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 2425,
      "title": "Jami` at-Tirmidhi 2356",
      "narrator": "Masruq said:",
      "english_text": "\"I entered upon 'Aishah and she invited me to eat. She said: 'Whenever I eat my fill of food I want to cry and begin crying.' He said: \"I said : 'Why?' She said: 'I remember the circumstances under which the Messenger of Allah (s.a.w) parted from the world. By Allah! He would not eat his fill of bread and meat twice in a day.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 2426,
      "title": "Jami` at-Tirmidhi 2357",
      "narrator": "'Aishah narrated:",
      "english_text": "\"The Messenger of Allah (s.a.w) did not eat his fill of barley bread on two consecutive days until he was taken (died).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 2427,
      "title": "Jami` at-Tirmidhi 2358",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Neither the Messenger of Allah (s.a.w) nor his family, ate their fill of wheat bread for three consecutive days until he parted the world.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 2428,
      "title": "Jami` at-Tirmidhi 2359",
      "narrator": "Abu Umamah narrated:",
      "english_text": "\"There was never a surplus of barley  bread for the inhabitants of the house of the Messenger of Allah (s.a.w).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 2429,
      "title": "Jami` at-Tirmidhi 2360",
      "narrator": "Ibn 'Abbas  said:",
      "english_text": "\" The Messenger of Allah (s.a.w) would spend many consecutive nights and his family did not have supper, and most of the time their bread was barley bread.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 2430,
      "title": "Jami` at-Tirmidhi 2361",
      "narrator": "Abu Hurairah narrated the the Messenger of Allah (s.a.w) said:",
      "english_text": "\"O Allah! Make the sustenance of Muhammad's family nourishing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 2431,
      "title": "Jami` at-Tirmidhi 2362",
      "narrator": "Anas narrated:",
      "english_text": "\"The Prophet (s.a.w) would not store anything  for the morrow.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 2432,
      "title": "Jami` at-Tirmidhi 2363",
      "narrator": "Anas  said:",
      "english_text": "\"The Messenger of Allah (s.a.w) never ate on a table, nor did he eat thin bread until he died.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 2433,
      "title": "Jami` at-Tirmidhi 2364",
      "narrator": "Abu Hazin narrated that Sahl bin Sa'd asked:",
      "english_text": "\"Did the Messenger of Allah (s.a.w) eat Naqi – meaning refined (flour)?” So Sahl said: “The Messenger of Allah (s.a.w) did not see Naqi until he met Allah.” It was said to him: “Did you have sifters during the time of the Messenger of Allah (s.a.w)?” He said: “There were no sifters for us.” They said: “How did you prepare the barley?”He said: “We would blow it so (the husk) would fly off of it, then we would add water so we could knead it.” (Hasan)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 2434,
      "title": "Jami` at-Tirmidhi 2365",
      "narrator": "Sa'd Bin Abi Waqqas said:",
      "english_text": "\"I was among the first men who spilled blood in Allah's cause, and I was among the first men to shoot an arrow in Allah's cause. I saw battles with troops of the Companions of Muhammad (s.a.w). We had nothing to eat except leaves of trees and Al-Hublah, such that one of us would leave droppings like the droppings of sheep and camels. Now Banu Asad have appeared wanting to instruct me in religion, ( then) I would be a loser and have wasted my efforts.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 2435,
      "title": "Jami` at-Tirmidhi 2366",
      "narrator": "Sa'd Bin Malik said:",
      "english_text": "\"I was the first man among the Arabs to shoot an arrow in Allah's cause. I saw that we battled along with the Messenger of Allah(s.a.w) and there was no food for us but Al-Hubla and this Samur, such that one of us would leave droppings like the droppings of a sheep. Then Banu Asad appeared wanting to instruct me in religion. I would be a loser and have wasted my efforts.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 2436,
      "title": "Jami` at-Tirmidhi 2367",
      "narrator": "Muhammad bin Sirin said:",
      "english_text": "\"We were with Abu Hurarirah and he was wearing two linen garments dyed with red ochre. He blew his nose in one of them and said: 'Excellent! Abu hurairah blows his nose in linens! I saw a time when I would pass out between the mimbar of the Messenger of Allah (s.a.w) and the dwelling of 'Aishah from overwhelming hunger. Someone came and placed his foot on my neck thinking that I was a mad man, but I was not crazy, It was nothing but hunger.\" (sahih)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 2437,
      "title": "Jami` at-Tirmidhi 2368",
      "narrator": "Fadalah bin 'Ubaid narrated that when the Messenger of Allah (s.a.w) would lead the people in Salat some men would collapse among them during the Salat due to hunger – they were among them Ashab As-suffah – such that a Bedouin would say :",
      "english_text": "'These people are mad' or \"possessed.\" So when the Messenger of Allah (s.a.w) finished the Salah, he turned to them and said:\n'If you knew what was in store for you with Allah then you would love to be increased in poverty and need.'” Fadalah said: “And on that day, I was with the Messenger of Allah(s.a.w).” (Hasan)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 2438,
      "title": "Jami` at-Tirmidhi 2369",
      "narrator": "Abu Hurairah narrated :",
      "english_text": "\"The Prophet (s.a.w) went out during an hour in which he would normally not go out, nor meet with anyone. Then Abu Bakr came to him. So he said:\"What brought you O Abu Bakr?\" He said: \"I came to meet the Messenger of Allah (s.a.w) and to look at his face, and to make sure he was safe. It was not long before 'Umar came. He said: \"What has brought you O 'Umar ?\" He said: \"Hunger  O  Messenger of Allah!\"He said: \"I also experienced some of that\" So they went to the home of Abu Al-Haitham At-Taiyyihan Al-Ansari. He was a man with many date-palms and sheep, but he had no servants so they did not find him there. They said to his wife: \"Where is your companion?\" She said: \"He has gone to fetch us some good water.\" It was not long before Abu Al-Haitham came along hauling to a large water-skin which he put down. Then he came to hug the Prophet (s.a.w) and uttered that his father and mother should be ransomed for him. Then he went to grove of his and he spread out a mat for them. Then he went to a date-palm and returned with a cluster of dates which he put down. The prophet (s.a.w) said: \"Why don't you select some ripe dates for us?\" He said:  \"O Messenger of Allah(s.a.w)! I wanted you to select from the ripe dates and the unripe dates.\" So they ate and they drank from that water. The Messenger of Allah(s.a.w) said: \"By the One in Whose Hand is my soul! This is among the favors which you shall be asked about on the Day of Judgement. Cool shade, tasty ripe dates, and cool water.\" Abu Al-Haitham left to prepare some food for them. The Prophet (s.a.w) said: \"Do not slaughter one with milk.\" So he Slaughtered a small female or male goat and brought it to them so they could eat it. The Prophet (s.a.w) said: \"Do you have any servants?\" He said: \"No.\" So he said: \"Then if we get some captives we shall bring them for you.\" So (later) the Prophet (s.a.w) came with 2 males, there was no third among them and he brought them to Abu Al-Haitham. The Prophet (s.a.w) said: \"Choose from them.\" He said: \"O Prophet of Allah! Choose for me.\" So the Prophet (s.a.w) said: \"Indeed the one consulted is entrusted. Take this one for I have seen him praying, and encourage him to do well.\" So Abu Al-Haitham went to his wife and informed her of what the Messenger of Allah (s.a.w) said. So his wife said: \"You will not fulfill what the Prophet (s.a.w) said until you have freed him.\" So he said: \"He is free.\" So the Prophet (s.a.w) said: \"Indeed Allah has not send a Prophet nor made a Khalifah except that he has two groups of supporters, group ordering him to do good, and prohibiting him from evil and a group that never ceases spoiling his affairs. So whoever protected.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 2439,
      "title": "Jami` at-Tirmidhi 2370",
      "narrator": "Abu Salamah bin 'Abdur-Rahman narrated that:",
      "english_text": "the Messenger of Allah(s.a.w) went out one day accompained by Abu Bakr  and 'Umar. And he mentioned similar to Hadith( no 2369) in meaning, but he did not mention \"from Abu Hurairah\" in it.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 2440,
      "title": "Jami` at-Tirmidhi 2371",
      "narrator": "Anas bin Malik narrated from Abu Talhah who said:",
      "english_text": "\"We complained to the Messenger of Allah(s.a.w) of hunger and we raised(our garments ) from our stomachs (exposing) a stone (on each of us). So the Messenger of Allah(s.a.w) raised (his garment exposing) two stones.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 2441,
      "title": "Jami` at-Tirmidhi 2372",
      "narrator": "Simak bin Harb said:",
      "english_text": "\"I heard An-Nu'man bin Bashir saying: 'Do you (people) not have what you wish of food and drink?' I have seen your Prophet and he did not have even enough daqal (dry dates) to fill his stomach.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 2442,
      "title": "Jami` at-Tirmidhi 2373",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Richness is not having many possessions, but richness is being content with oneself.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 2443,
      "title": "Jami` at-Tirmidhi 2374",
      "narrator": "Khawlah bint Qais, who was the wife of Hamzah bin 'Abdul-Muttalib narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed this wealth is green and sweet. Whoever gets what he deserves of it then he shall be blessed in it. And many a person who deals with what he wants for himself, from the wealth of Allah and His Messenger, gets nothing on the Day of Judgment but the Fire.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 2444,
      "title": "Jami` at-Tirmidhi 2375",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w)  said:",
      "english_text": "\"Cursed be the slave of the Dinar, cursed be the slave of the Dirham.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 2445,
      "title": "Jami` at-Tirmidhi 2376",
      "narrator": "Ibn Ka'b bin Malik Al-Ansari narrated from his father, that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Two wolves free among sheep are no more destructive to them than a man's desire for wealth and honor is to his religion.\"",
      "grade": "Sahih (Al-Albani) Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 2446,
      "title": "Jami` at-Tirmidhi 2377",
      "narrator": "'Abdullah narrated :",
      "english_text": "\"The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 2447,
      "title": "Jami` at-Tirmidhi 2378",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"A man is upon the religion of his friend, so let one of you look at whom he befriends.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 2448,
      "title": "Jami` at-Tirmidhi 2379",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah (S.a.w) said:",
      "english_text": "\"Three follow the deceased, two of them return, and one remains. He is followed by his family, his wealth, and his deeds. So his family and his wealth returns, and his deeds remain.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 2449,
      "title": "Jami` at-Tirmidhi 2380",
      "narrator": "Miqdam bin Ma'dikarib said:",
      "english_text": "\"I heard the Messenger of Allah (S.a.w) saying:\n'The human does not fill any container that is worse than his stomach. It is sufficient for the son of Adam to eat what will support his back. If this is not possible, then a third for food, a third for drink, and third for his breath.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 2450,
      "title": "Jami` at-Tirmidhi 2381",
      "narrator": "Abu Sa'eed narrated that the Messenger of Allah (S.a.w) said:",
      "english_text": "\"Whoever wants to be seen, Allah will show him, And whoever wants to be heard of, Allah will make him heard off.\" And he narrated that the Messenger of Allah (s.a.w) said: \"He who shows no mercy to the people, Allah shows him no mercy.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 2451,
      "title": "Jami` at-Tirmidhi 2382",
      "narrator": "Al-Walid bin Abi Al-Wald abu 'Utthman Al-Mada'ini narrated that 'Uqbah bin Muslim narrated to him, that shufaiy Al-Asbahi narrated that he entered Al-Madinah and saw a man around whom the people had gathered. He asked:",
      "english_text": "\" Who is this?\" They said: \"Abu Hurairah.\"  (He said):So I got close to him until I was sitting in front of him as he was narrating to the people. When he was silent and alone, I said to him: \" I ask youabsolute truth if you would narrate to me a Hadith which you heard from the Messenger of Allah (s.a.w), That you understand and know.\"\nSo Abu Hurairah said: \"You want me to narrate a Hadith to you which the Messenger of Allah (s.a.w) narrated to me that I understand and know.\" Then Abu Hurairah began sobbing profusely. We sat for a while, then he recovered and said: \"I shall narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated in this House, while there was no one with us other than he and I.\" \nThen, again, Abu Hurairah began sobbing severely. Then he recovered, and wiped his face, and said: \"you want me to narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated while he and I were sitting in this House, and no one was with us but he and I.\" Then Abu Hurairah began sobbing severely. Then he bent, falling on his face, so I supported him for a long time. Then he recovered and said: \"The Messenger of Allah narrated to me that on the Day of Judgement, Allah, Most High, will descend to His slaves t judge between them. Every nation shall be kneeling. The first of those who will be called before him will be a man who memorized the Qur'an, and a man who was killed in Allah's cause, and a wealthy man. Allah will say to the reciter: 'Did I not teach you what I revealed to My Messenger?\" He says: 'Of course O Lord!' He says: 'Then what did you do with what you learned?' He said: 'I would stand (in prayer reciting) with it during all hours of the night and all hours of the day.' Then Allah would say to him: 'You have lied.' And the angels will say: 'You have lied.'Allah will say to him: 'Rather, you wanted it to be said that so-and-so is a reciter. And that was said.' The person with the wealth will be brought, and Allah will say to him: 'Was I not so generous with you, such that I did not leave you having any need from anyone?' He will say: 'Of course O Lord!' He says: 'Then what did you do with what I gave to you?' He says: 'I would nurture the ties of kinship and give charity.' Then Allah will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah, Most High, will say: 'Rather, you wanted it to be said that so-and-so is so generous, and that was said.' Then the one who was killed in Allah's cause shall be brought, and Allah will say to him : 'For what were you killed?' So he says: 'I was commanded to fight in Your cause ,so I fought until I was killed.' Allah [Most High] will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah [Most High] will say: 'Rather, you wanted it be said that so-and-so is brave, and that was said.' \n\"Then the Messenger of Allah (s.a.w)hit me on my knees and said: 'O Abu Hurairah! These first three are the creatures of Allah with whom the fire will be enflamed on the Day of Judgement.'\"\nAl-Walid Abu 'Uthman Al-Mada'ini said: \"So 'Uqbah bin Muslim informed me that Shaufaiy, is the one who entered upon Mu'awiyah to inform him about this.\" Abu Uthman said: 'This has been done with these people, then how about with those who remain among the people?\" Then Mu'awiyah begin weeping so intensely, that we thought that he will kill himself with excessive weeping. We said: \"This man came to us to cause evil.\" Then Mu'awiyah recovered, wiped off his face and said: \"Allah and His Messenger told the truth: Whosoever desires the life of the world and its glitter, then we shall pay in full (the wages of) their deeds therein, and they shall have no diminution therein. They are those for whom there is nothing in the Hereafter Fire, and vain are the deeds they did therein. And of no effect is that which they used to do.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 2452,
      "title": "Jami` at-Tirmidhi 2383",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Seek refuge in Allah from the Pit of Sorrows.\" They said: \"O Messenger of Allah! What is the Pit of Sorrows?\" He said: \"gorge in Hell from which Hell seeks Allah's refuge a Hundred times every day.\" It was said: \"O Messenger of Allah! Who shall enter it?\" He said: \"The reciters who were showing off with their deeds.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 2453,
      "title": "Jami` at-Tirmidhi 2384",
      "narrator": "Abu Hurairah narrated that A man said:",
      "english_text": "\"O Messenger of Allah! A man does a deed and conceals it, but when it is discovered that he did it, he is happy about that.\" He said: \" The Messenger of Allah (s.a.w) said: 'He receives two rewards: A reward in its concealment, and a reward in its publicity.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 2454,
      "title": "Jami` at-Tirmidhi 2385",
      "narrator": "Anas narrated that a man came to the Messenger of Allah (s.a.w) and said:",
      "english_text": "\" O Messenger of Allah! When will the Hour be established?\" So the Propher (s.a.w) stood to perform Salat and when he was finished his Salat he said: \"Where is the one who asked when the hour will be established?\" The man said: \"It was I, O Mesenger of Allah!\" He said: \"What have you prepared for it?\" He said: \"O Messenger of allah! I have not prepared very much of salat nor fasting for it, but I love Allah and His Messenger.\" So the Messenger of Allah(s.a.w) said: \"A man shall be with whom ever he loves, and you shall be with whomever you love.\" So after the advent of Islam, I did not see that anything brought the Muslims more happiness than that.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 2455,
      "title": "Jami` at-Tirmidhi 2386",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\" A man shall be with whoever he loves, and for him shall be what he has earned.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 2456,
      "title": "Jami` at-Tirmidhi 2387",
      "narrator": "Safwan bin Assal narrated that a Bedouin with a loud voice and said:",
      "english_text": "\" O Muhammad! A man loves the people but does not catch up to them (in deeds).\" So the Messenger of Allah(s.a.w) said: \"A man shall be with whomever he loves.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 2457,
      "title": "Jami` at-Tirmidhi 2388",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed Allah Most High says: 'I am as My slave thinks of Me, and I am with him when He  calls upon Me.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 2458,
      "title": "Jami` at-Tirmidhi 2389",
      "narrator": "An-Nawas bin Sama'an narrated that a man came asking the Messenger of Allah (s.a.w) about righteousness and sin. So the Prophet (s.a.w) said:",
      "english_text": "\"Righteouness is good behaviour, and sin is what fluctuates in your chest, and you would hate that the people discovered it about you.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 2459,
      "title": "Jami` at-Tirmidhi 2390",
      "narrator": "Mu'adh binJabal narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Allah, the Mighty and Sublime, said: 'Those who love each other for the sake of My Majesty shall be upon podiums of light, and they will be admired by the Prophets and the martyrs.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 2460,
      "title": "Jami` at-Tirmidhi 2391",
      "narrator": "Hafs bin 'Asim narrated from Abu Hurairah or Abu Sa'eed that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Seven shall be shaded by Allah under his shade on a day in which there is no shade except His Shade: A just Imam, a young person raised upon worshiping  Allah, a man whose heart is attached to the Masjid when he leaves from it until he returns from it, two men who love each other for Allah's sake, coming together upon that, and parting upon that, a man who remembers Allah in privacy and his eyes swell with tears, a man invited by a woman of status and beauty, but he says: 'I fear Allah, Mighty and Sublime is He,' and a man who conceals the charity he gives such that his left hand does not know what his right hand has spent.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 2461,
      "title": "Jami` at-Tirmidhi 2392",
      "narrator": "Al-Miqdam bin Ma'dikarib narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"When one of you loves his brother,then let him inform him of it.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 2462,
      "title": "Jami` at-Tirmidhi 2392 b",
      "narrator": "Yazid bin Nu'amah Ad-Dabbi narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"When a man becomes the brother of another man,then let him ask him about his name and his father's name and who he is,for indeed it shall nurture affection.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 2463,
      "title": "Jami` at-Tirmidhi 2393",
      "narrator": "Abu Ma'mar said:",
      "english_text": "\"A man stood and praised one of the 'Amirs so Al-Miqdad bin Al-Aswad threw dust in his face and said: 'The Messenger of Allah (s.a.w) ordered us to throw dust in the faces of those who praise others.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 2464,
      "title": "Jami` at-Tirmidhi 2394",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Messenger of Allah(s.a.w) ordered us to throw dut in the mouths of those who praise others.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 2465,
      "title": "Jami` at-Tirmidhi 2395",
      "narrator": "Abu Sa'eed narrated that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"Do not accompany except a believer, and do not serve your food except to one with Taqwa.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 2466,
      "title": "Jami` at-Tirmidhi 2396",
      "narrator": "Anas narrated that the Messenger of Allah (ﷺ) said:",
      "english_text": "\"When Allah wants good for his slave, He hastens his punishment in the world. And when He wants bad for His slave, He withholds his sins from him until he appears before Him on the Day of Judgement.\"\n\nAnd with this (same) chain, (it was reported) from the Prophet (ﷺ) who said: \"Indeed greater reward comes with greater trial. And indeed, when Allah loves a people He subjects them to trials, so whoever is content, then for him is pleasure, and whoever is discontent, then for him is wrath.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 2467,
      "title": "Jami` at-Tirmidhi 2397",
      "narrator": "'Aishah said:",
      "english_text": "\"I have not seen ailment effecting anyone worse than upon the Messenger of Allah (s.a.w).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 2468,
      "title": "Jami` at-Tirmidhi 2398",
      "narrator": "Mus'ab bin Sa'd narrated from his father that a man said:",
      "english_text": "\"O Messenger of Allah(s.a.w)! Which of the people is tried most severely?\" He said:\n\"The Prophets, then those nearest to them, then those nearest to them. A man is tried according to his religion; if he is firm in his religion, then his trials are more severe, and if he is frail in his religion, then he is tried according to the strength of his religion. The servant shall continue to be tried until he is left walking upon the earth without any sins.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 2469,
      "title": "Jami` at-Tirmidhi 2399",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"Trials will not cease afflicting the believing man and the believing woman in their self, children, and wealth, until they meet Allah without having any sin.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 2470,
      "title": "Jami` at-Tirmidhi 2400",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"Indeed Allah [Most High] said: 'When I take My slave's sight in the world, then there shall be no reward for him with Me except Paradise.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 2471,
      "title": "Jami` at-Tirmidhi 2401",
      "narrator": "Abu Hurairah (narrated from) the Prophet(s.a.w) who said:",
      "english_text": "\"Allah, Mighty and Sublime is He, said: 'For whomever I take his sight, and he is patient and seeking a reward, I shall not be satisfied with any reward for him less than Paradise.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 2472,
      "title": "Jami` at-Tirmidhi 2402",
      "narrator": "Jabir narrated that the Prophet (s.a.w) said:",
      "english_text": "\"On the Day of Judgement, when the people who were tried (in this world) are given their rewards, the people who were pardoned (in life), will wish that their skins had been cut off with scissors while they were in the world.\"\n\nThis Hadith is Gharib, we do not know of it with this chain except through this route. Some of them have reported something similar to this Hadith from Al-A`mash, from Talhah bin Musarrif from Masruq.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 2473,
      "title": "Jami` at-Tirmidhi 2403",
      "narrator": "Abu Hurairah narrated that the Prophet(s.a.w) said:",
      "english_text": "\"There is no one who dies but he shall regret.\" They said: \"What shall he regret over O Messenger of Allah?\" He said: \"If he was a good doer, he regrets that he did not do more, and if he was an evil doer, he regrets that he did not stop.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 2474,
      "title": "Jami` at-Tirmidhi 2404",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:",
      "english_text": "\"In the end of time there shall come men who will swindle the world with religion, decieving the people in soft skins of sheep, their tongues are sweeter than sugar and their hearts are the hearts of wolves. Allah [Mighty and Sublime is He] says: 'Is it me you try to delude or is it against me whom you conspire? By Me, I swear to send upon these people,among them, a Fitnah that leaves them utterly devoid of reason.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 2475,
      "title": "Jami` at-Tirmidhi 2405",
      "narrator": "Ibn 'Umar narrated that the Prophet(s.a.w) said:",
      "english_text": "\"Indeed Allah, Most High, said:'I have created creatures whose tongues are sweeter than honey and their hearts are more bitter than aloes. So by Me, I swear to abase them with a Fitnah, leaving them utterly devoid of reason. Is it Me whom they try to delude, or it is  against Me whom they conspire?'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 2476,
      "title": "Jami` at-Tirmidhi 2406",
      "narrator": "'Uqbah bin 'Amir narrated:",
      "english_text": "\"I said: 'O Messenger of Allah! What is the means to salvation?' He said:\n'That you control your tongue, suffice yourself your house, and cry over your sins.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 2477,
      "title": "Jami` at-Tirmidhi 2407",
      "narrator": "Abu Sa'eed Al-Khudri narrated (that the Prophet s.a.w) said:",
      "english_text": "\"When the son of Adam wakes up in the morning, all of his body parts bow to the tongue and say: 'Fear Allah regarding us, we are only part of you. If you are straight we are straight and if you are crooked we are crooked.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 2478,
      "title": "Jami` at-Tirmidhi 2408",
      "narrator": "Sahl bin Sa'd narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Whoever guarantees for me what is between his jaws and what is between his legs, I shall guarantee Paradise for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 2479,
      "title": "Jami` at-Tirmidhi 2409",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"For whomever Allah protects against the evil of what is between his jaws and the evil of what is between his legs, he shall enter Paradise.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 2480,
      "title": "Jami` at-Tirmidhi 2410",
      "narrator": "Sufyan bin 'Abdullah Ath-Thaqafi said:",
      "english_text": "I said: \"O Messenger of Allah! Inform me about a matter that I may hold fast to.\" He said:\n'Say: My Lord is Allah, then be steadfast.' I said: \"O Messenger of Allah! What do you fear most for me?\" So he took hold of his tongue and said: 'This.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 2481,
      "title": "Jami` at-Tirmidhi 2411",
      "narrator": "Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Do not talk too much without remembrance of Allah. Indeed excessive talking without remembrance of Allah hardens the heart. And indeed the furthest of people from Allah is the harsh-hearted.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 2482,
      "title": "Jami` at-Tirmidhi 2412",
      "narrator": "Umm Habibah, the wife of the Prophet (s.a.w), narrated from the  Prophet (s.a.w) who said:",
      "english_text": "\"The son of Adam's speech is against him not for him, except for commanding good, or forbidding evil, or remembrance of Allah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 2483,
      "title": "Jami` at-Tirmidhi 2413",
      "narrator": "Ubu Juhaifah narrated from his father who said:",
      "english_text": "\"The Messenger of Allah (s.a.w) made a bond of brotherhood  between Salman and Abu Ad-Darda. Salman went to visit Abu Ad-Darda, and saw Umm Ad-Darda wearing shabby clothes, So he said: 'Why are you wearing such shabby clothes?' She said: 'Your brother Abu Ad-Darda has no interest in the world.' So when Abu Ad-Darda arrived, he prepared some food for him (Salman) and said: 'Eat, for I am fasting.' He said: 'I shall not eat until you eat.'\" He said: \"So he ate. When night came Abu Ad-Darda started to leave and stand (in prayer), but Salman said to him: 'Sleep.' So he slept. Then he went to stand (in prayer) but he said to him: 'Sleep'. So he slept. When the morning (Fajr) came,Salman said: 'Get up now.'So he got up to perform Salat. Then he (Salman) said: 'Indeed your self has a right upon you, your Lord has a right upon you, your guest has a right upon you, and your family has a right upon you. So give each the right they are due. The Prophet (s.a.w), and that was mentioned to him, so he said: 'Salman has told the truth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 2484,
      "title": "Jami` at-Tirmidhi 2414",
      "narrator": "'Abdul-Wahhab bin Al-Ward narrated from a man among the inhabitants of Al-Madinah who said:",
      "english_text": "\"Mu'awiyah wrote a letter to 'Aishah, that: 'Write a letter to advise me , and do not overburden me.'\" He said: \"So 'Aishah [may Allah be pleased with her]wrote to Mu'awiyah: 'Peace be upon you. As for what follows: Indeed I heard the Messenger of Allah (s.a.w) saying: Whoever seeks Allah's pleasure by the people's wrath, Allah will suffice him from the people. And who ever seeks the people's pleasure by Allah's wrath, Allah will entrust him to the people. And Peace be upon you.'\"",
      "grade": "Hasan (Darussalam)"
    }
  ]
}