{
  "chapterNum": 4,
  "english_title": "The Book on the Day of Friday",
  "totalHadiths_inChapter": 42,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 488,
      "title": "Jami` at-Tirmidhi 488",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 489,
      "title": "Jami` at-Tirmidhi 489",
      "narrator": "Anas bin Malik narrated that :",
      "english_text": "the Prophet said: \"Seek out the hour that is hoped for on Friday after Asr until the sun has set.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 490,
      "title": "Jami` at-Tirmidhi 490",
      "narrator": "Kathir bin Abdullah bin Amr bin Awf Al-Muzani narrated from his father, from his grandfather, that :",
      "english_text": "the Prophet said: \"On Friday there is an hour in which the worshipper does not ask Allah for anything  except that Allah grants it to him.\" They said: \"O Messenger of Allah! Which hour is it?\" He said: \"When the prayer is begun until it is finished.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 491,
      "title": "Jami` at-Tirmidhi 491",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 492,
      "title": "Jami` at-Tirmidhi 492",
      "narrator": "Salim narrated from his father, from his grandfather, that he heard :",
      "english_text": "the Prophet saying: \"Whoever comes on Friday, then let him perform Ghusl.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 493,
      "title": "Jami` at-Tirmidhi 493",
      "narrator": "Salim narrated:",
      "english_text": "(Another chain) from Abdullah bin Umar from the Prophet which is similar",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 494,
      "title": "Jami` at-Tirmidhi 494",
      "narrator": "And Yunus and Ma'mar reported, from Az-Zuhri, from Salim Wudu from his father:",
      "english_text": "\"Umar bin Al-Khattab was giving a Khutbah on Friday when a man from the Companions of the Prophet entered. So he said: \"What time is it?\" So he said: 'I don't know, I heard the call and did nothing more than perform Wudu.' So he said: And Wudu again!? I know surely that the Messenger of Allah has ordered Ghusl.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 495,
      "title": "Jami` at-Tirmidhi 495",
      "narrator": "(Another chain reaching to Az-Zuhri) with this Hadith.Malik reported this Hadith from Az-Zuhri, from Salim who said:",
      "english_text": "\"Umar [bin al-Khattab] was giving a Khutbah on Friday.\" And he mentioned this Hadith.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 496,
      "title": "Jami` at-Tirmidhi 496",
      "narrator": "Aws bin Aws narrated:",
      "english_text": "\"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 497,
      "title": "Jami` at-Tirmidhi 497",
      "narrator": "Samurah bin Jundah narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever performs  Wudu on Friday, then he will receive the blessing, and whoever performs Ghusl then Ghusl is more virtuous.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 498,
      "title": "Jami` at-Tirmidhi 498",
      "narrator": "Abu Hurairh narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever performs Wudu, performing his Wudu well, then he comes to the Friday (prayer), and he gets close, listens and is silent, then whatever (sin) was between that and (the last) Friday are forgiven for him, in addition to three days. And whoever touches the pebbles, he has committed Lagha (useless activity).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 499,
      "title": "Jami` at-Tirmidhi 499",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 500,
      "title": "Jami` at-Tirmidhi 500",
      "narrator": "Abu Al-Ja'd - meaning Ad-Damri - narrated, and he was a Companion according to the claim of Muhammad bin Amr:",
      "english_text": "\"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 501,
      "title": "Jami` at-Tirmidhi 501",
      "narrator": "Thuwair narrated from a man among the people of Quba, from his father, who was one of the Companions of the Prophet, that :",
      "english_text": "he said: \"The Prophet ordered us to attend the Friday prayer in Quba.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 502,
      "title": "Jami` at-Tirmidhi 502",
      "narrator": "Narrator not mentioned:",
      "english_text": "I heard Ahmad bin Husain saying: \"We were with Ahmad bin Hanbal, so they mentioned the one upon whom the Friday prayer is obligatory. Ahmad did not mention anything about it from the Prophet.\" Ahmad bin Al-Hasan said: \"I said to Ahmad bin Hanbal: 'There is something about it from Abu Hurairah, from the Prophet.' So Ahmad bin Hanbal said: 'From the Prophet?' I said: 'Yes.'\" [Ahmed bin Hanbal said:] \"Hajjaj bin Nusair narrated to us; Mubarik bin Abbad narrated to us from Abdullah bin Sa'eed Al-Maqburi, from his father, from Abu Hurairah that the Prophet said: \"The Friday prayer is required from whomever can return to his family by the night.\" He said: \"So Ahmad [bin Hanbal] became angry with me, and he said to me: 'Seek forgiveness from your Lord, seek forgiveness from your Lord.'\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 503,
      "title": "Jami` at-Tirmidhi 503",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"The Prophet would pray the Friday prayer when the sun was declining.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 504,
      "title": "Jami` at-Tirmidhi 504",
      "narrator": "(Another chain) from Anas, :",
      "english_text": "from the Prophet, similarly.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 505,
      "title": "Jami` at-Tirmidhi 505",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 506,
      "title": "Jami` at-Tirmidhi 506",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 507,
      "title": "Jami` at-Tirmidhi 507",
      "narrator": "Jabir bin Samurah narrated:",
      "english_text": "\"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 508,
      "title": "Jami` at-Tirmidhi 508",
      "narrator": "Safwan bin Ya'la bin Umayyah narrated from his father who said:",
      "english_text": "\"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 509,
      "title": "Jami` at-Tirmidhi 509",
      "narrator": "Abdullah bin Mas'ud narrated:",
      "english_text": "\"When Allah's Messenger descending the Minbar he would face our direction.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 510,
      "title": "Jami` at-Tirmidhi 510",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"The Prophet was delivering a Khutbah on Friday when a man came. The Prophet said: 'Have you prayed?' He said no. So he said: 'Then stand and pray.'\" Abu Eisa said: This Hadith is Hasan Sahih [It is the most correct thing about this topic.]",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 511,
      "title": "Jami` at-Tirmidhi 511",
      "narrator": "Iyad bin  Abdullah bin Abi Sarh narrated:",
      "english_text": "\"Abu Sa'eed Al-Khudri entered (the mosque) on Friday while Marwan was giving the Khutbah, so he began praying. Two guards came to make him sit down but he refused until he had prayed. When he finished he came to us and we said: 'May Allah have mercy upon you. They nearly harmed you.' He said: 'I was not going to stop performing them (the two Rak'ah) after what I saw from Allah's Messenger.' Then he mentioned that a man who appeared untidy came on Fridy while the Prophet was delivering the Friday Khutbah, so he ordered him to pray two Rak'ah all the while the Prophet was delivering the Khutbah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 512,
      "title": "Jami` at-Tirmidhi 512",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever said: 'Be quiet' while the Imam is giving the Khutbah then he has committed Laghw (useless activity).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 513,
      "title": "Jami` at-Tirmidhi 513",
      "narrator": "Sahl bin Ma'adh bin Anas al Jahni narrated from his father that :",
      "english_text": "Allah's Messenger said: \"Whoever steps over the necks of the people on Friday, he has taken a bridge to Hell.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 514,
      "title": "Jami` at-Tirmidhi 514",
      "narrator": "Sahl bin Ma'adh narrated from his father:",
      "english_text": "\"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 515,
      "title": "Jami` at-Tirmidhi 515",
      "narrator": "Husain narrated:",
      "english_text": "\"I heard Umarah bin Rawaibah Ath-Thaqafi - while Bishr bin Marwan was delivering Khutbah and raising his hands in supplication - so Umarah said: 'May Allah disgrace these two insignificant hands, I have seen Allah's Messenger, and he would not do any more than this;'\" and Hushaim (one of the narrators) motioned with his index finger.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 516,
      "title": "Jami` at-Tirmidhi 516",
      "narrator": "As-Sa'ib bin Yazid narrated:",
      "english_text": "\"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 517,
      "title": "Jami` at-Tirmidhi 517",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"Allah's Messenger would talk as necessary after descending from the Minbar.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 518,
      "title": "Jami` at-Tirmidhi 518",
      "narrator": "Anas narrated:",
      "english_text": "\"I saw the Prophet, after the Iqamah was called for Salat, talking to a man who was standing between him and the Qiblah, he did not stop talking, and I saw some of them getting sleepy from his lengthy standing the Prophet.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 519,
      "title": "Jami` at-Tirmidhi 519",
      "narrator": "Ubaidullah bin Abi Rafi the freed slave of Allah's Messenger said:",
      "english_text": "\"Marwan left Abu Hurairah in charge of Al-Madinah and he went to Makkah. So Abu Hurairah led us in Salat in Friday, reciting Surah Al-Jumuah (in the first Rak'ah) and in the second prostration (Rak'ah): When the hypocrites come to you.\" Ubaidullah said: \"So I caught up with Abu Hurairah and said to him: 'You recited two Surah that Ali recited in Al-Kufah. Abu Hurairah said: 'Indeed I heard Allah's Messenger reciting them.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 520,
      "title": "Jami` at-Tirmidhi 520",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 521,
      "title": "Jami` at-Tirmidhi 521",
      "narrator": "Salim narrated from his father:",
      "english_text": "\"The Prophet would pray two Rak;ah after the Friday prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 522,
      "title": "Jami` at-Tirmidhi 522",
      "narrator": "Nafi narrated about Ibn Umar:",
      "english_text": "\"When he prayed the Friday prayer, he left and prayed two prostrations (Rak'ah) in his house. Then he said: 'Allah's Messenger would do this.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 523,
      "title": "Jami` at-Tirmidhi 523",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "Allah's Messenger said: \"Whoever among you is to pray after the Friday prayer, then let him pray four.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 524,
      "title": "Jami` at-Tirmidhi 524",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "the Prophet said: \"Whoever catches a Rak'ah of the Salat then he has caught the Salat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 525,
      "title": "Jami` at-Tirmidhi 525",
      "narrator": "Sahl bin Sa'd narrated:",
      "english_text": "\"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 526,
      "title": "Jami` at-Tirmidhi 526",
      "narrator": "Ibn Umar narrated that :",
      "english_text": "the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 527,
      "title": "Jami` at-Tirmidhi 527",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 528,
      "title": "Jami` at-Tirmidhi 528",
      "narrator": "Al-Bara bin Azib narrated that :",
      "english_text": "Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 529,
      "title": "Jami` at-Tirmidhi 529",
      "narrator": "Al-Bara bin Azib narrated:",
      "english_text": "(Another route for the same chain) similar in meaning.",
      "grade": "Da'if (Darussalam)"
    }
  ]
}