{
  "chapterNum": 9,
  "english_title": "The Book on Hajj",
  "totalHadiths_inChapter": 158,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 809,
      "title": "Jami` at-Tirmidhi 809",
      "narrator": "Sa'eed bin Abi Sa'eed Al Maqbury narrated:",
      "english_text": "\"Abu Shuraih Al-Adawi said tat when Amr bin Sa'eed was sending troops to Makkah he said to him: 'O Amr! Allow me to tell you what the Messenger of Allah said on the day following the Conquest of Makkah. My ears heard it, my heard understood it thoroughly, and with my own eyes, I saw the Prophet when he - after glorifying and praising Allah - said: \"Indeed Allah, the Most High, made Makkah a sanctuary, it was not made a sanctuary by the people. So it is not lawful for a man who believes in Allah and the Last Day to shed blood it, nor to cut down its trees. If anybody tries to use the Messenger of Allah to make an excuse for fighting in it, then say to him: 'Indeed Allah permitted His Messenger and He did not permit you.' Allah only allowed it for me for a few hours of one day, and today its sanctity has returned as it was before. So let the one who is present convey to the one who is absent.\" Abu Shuraih was asked: \"What was Amr bin Sa'eeds reply to you?\" He said: \"I am more knowledgeable about that than you Abu Shuraih! The Haram does not give protection to a disobedient person, nor a person fleeing for murder, nor fleeing for (Kharbah) lawlessness.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 810,
      "title": "Jami` at-Tirmidhi 810",
      "narrator": "Abdullah (bin Mas'ud) narrated that:",
      "english_text": "The Messenger of Allah said: \"Alternate between Hajj and Umrah; for those two remove poverty and sins just as the bellows removes filth from iron, gold, and silver - and there is no reward for Al-Hajj Al-Mabrur except for Paradise.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 811,
      "title": "Jami` at-Tirmidhi 811",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "The Messenger of Allah said: \"Whoever performs Hajj for Allah, and he does not have sexual relations nor commit any sin, then his previous sins will be forgiven.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 812,
      "title": "Jami` at-Tirmidhi 812",
      "narrator": "Ali narrated that :",
      "english_text": "The Messenger of Allah said: \"Whoever has the provisions and the means to convey him to Allah's House and he does not perform Hajj, then it does not matter if he dies as a Jew or a Christian. That is because Allah said in His Book: 'And Hajj to the House is a duty that mankind owes to Allah, for whomever is able to bear the journey.'",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 813,
      "title": "Jami` at-Tirmidhi 813",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"A man came to the Prophet and said: 'O Messenger of Allah! What is it that makes Hajj obligatory?' He said: \"The provisions and a means of conveyance.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 814,
      "title": "Jami` at-Tirmidhi 814",
      "narrator": "Ali bin Abi Talib narrated:",
      "english_text": "\"When Allah revealed: And Hajj to the House is a duty that mankind owes to Allah, for whomever is able to bear the journey. They said: 'O Messenger of Allah! Is that every year?' He remained silent. So they said: 'O Messenger of Allah! Is that every year?' He said: 'No. If I had said yes, then it would have been made obligatory.' So Allah revealed: O you who believe! Do not ask about things which, if made plain to you, may cause you trouble.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 815,
      "title": "Jami` at-Tirmidhi 815",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"The Prophet performed Hajj three times. He performed Hajj twice before his emigration, and he performed one Hajj after he emigrated, and these were accompanied by Umrah. So he drove sixty-three sacrificial animals (Budn) and Ali came from Yemen with the rest of them, among them was a camel of Abu Jahl that has a ring made of silver in its nose. So he (the Messenger of Allah) slaughtered the, and the Messenger of Allah ordered that a piece of each of them be cooked, and he drank from its broth.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 816,
      "title": "Jami` at-Tirmidhi 815b",
      "narrator": "Qatadah narrated:",
      "english_text": "\"I said to Anas bin Malik: 'How many times did the Prophet perform Hajj?' He said: 'He performed one Hajj and he performed four Umrah: An Umrah during Dhul-Qa'dah; the Umrah of Al-Hudaibiyah, and Umrah with his Hajj, and an Umrah from Al-Ji'irranah when he divided up the war spoils of Hunain.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 817,
      "title": "Jami` at-Tirmidhi 816",
      "narrator": "Ibn Abbas narrared:",
      "english_text": "\"The Messenger of Allah performed four Umrah: The Umrah of Al-Hudaibiyah, a second Umrah the following (year), (which was) the Umrah of Al-Qisas during Dhul-Qa'dah, a third Umrah from Al-Ji'irranah, and the fourth which accompanied his Hajj.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 818,
      "title": "Jami` at-Tirmidhi 817",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"When the Prophet wanted to Perform Hajj, he announced it to the people, and they gathered (to accompany him). When he reached Al-Baida he assumed Ihram\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 819,
      "title": "Jami` at-Tirmidhi 818",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"Al-Baida the one they lie about regarding the Messenger of Allah. By Allah! The Messenger of Allah did not start the Talbiyah except from near the Masjid, near the tree.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 820,
      "title": "Jami` at-Tirmidhi 819",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet started the Talbiyah after the Salat.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 821,
      "title": "Jami` at-Tirmidhi 820",
      "narrator": "Aishah narrated:",
      "english_text": "\"the Messenger of Allah performed the Ifrad form of Hajj.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 822,
      "title": "Jami` at-Tirmidhi 821",
      "narrator": "Anas narrated:",
      "english_text": "\"I heard the Prophet saying: (Labbaika Bi'umratin wa Hajjah) 'Here I am for 'Umrah and Hajj.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 823,
      "title": "Jami` at-Tirmidhi 822",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah performed Tamattu, as did Abu Bakr, Umar and Uthman. And the first to prohibit it was Mu'awiyah.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 824,
      "title": "Jami` at-Tirmidhi 823",
      "narrator": "Muhammad bin Abdullah bin Al-Harith bin Nawfal narrated that:",
      "english_text": "He heard Sa'd bin Abi Waqas, and Ad-Dahhak bin Qais while they were mentioning Tamattu after \"Umrah until Hajj. Ad-Dahhak bin Qais said: \"No one does that except one who is ignorant of the order of Allah, Most High.\" Sa'd said: \"How horrible is it what you have said O my nephew!\" So Ad-Dahhak (bin Qais) said: \"Indeed Umar bin Al-Khattab has prohibited that.\" So Sa'd said: \"The Messenger of Allah did it, and we did it with him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 825,
      "title": "Jami` at-Tirmidhi 824",
      "narrator": "Salim bin Abdullah narrated that :",
      "english_text": "he had heard a man from Ash-Sham asking Abdullah bin Umar about Tamattu after Umrah until Hajj, so Abdullah bin Umar said: \"It is lawful.\" The man from Ash-Sham said: \"But your father prohibited it.\" So Abdullah bin Umar said: \"Is the order to follow my father or is the order (to follow) for the Messenger of Allah?\" The man said: \"Rather it is for the Messenger of Allah.\" So he said: \"Indeed the Messenger of Allah did it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 826,
      "title": "Jami` at-Tirmidhi 825",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet would say the following for the Talbiyah: \"Labbaik Allahumma labbaik. Labbaik la sharika laka labbaik. Innal-hamda wan-ni;mata laka wal-mulk, la sharika laka.\" ('I respond to Your call O Allah! I respond to Your call. You have no partner. I respond to Your call. All praise, thanks and blessings are for You. All sovereignty is for You. And You have no partners with You).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 827,
      "title": "Jami` at-Tirmidhi 826",
      "narrator": "Nafi` narrated:",
      "english_text": "When Ibn Umar would say the talbiyah he would continue saying: \"Labbaik Allahumma labbaik. Labbaik la sharika laka labbaik. Innal-hamda wan-ni`mata laka wal-mulk, la sharika laka\" (I respond to Your call O Allah! I respond to Your call, You have no partner, I respond to You call. All praise, thanks and blessings are for You. And You have no partners with You). He said: \"Abdullah bin Umar would say: 'This is the Talbiyah of the Messenger of Allah.' He would himself add the following after the Talbiyah of the Messenger of Allah: \"Labbaik labbaika wa-sa'daik, wal-khairuu fi yadaik. Labbaika war-raghba'u ilaika wal-amal\" ('I respond to Your call, and I am obedient to Your orders, all good is in Your Hands. I respond to Your call and the requests and deeds are for You).'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 828,
      "title": "Jami` at-Tirmidhi 827",
      "narrator": "Abu Bakr As-Siddiq narrated that:",
      "english_text": "The Messenger of Allah was asked: \"Which Hajj is the most virtuous?\" He said: \"That with raised voices (Al-Ajj) and the flow of blood (of the sacrifice) (Ath-Thajj).\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 829,
      "title": "Jami` at-Tirmidhi 828",
      "narrator": "Sahl bin Sa'd narrated that :",
      "english_text": "the Messenger of Allah said: \"There is no Muslim who says the Talbiyah except that - on his right and left, until the end f the land, from here to there - the rocks, or trees, or mud say the Talbiyah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 830,
      "title": "Jami` at-Tirmidhi 829",
      "narrator": "Khallad bin As-Sa'ib (bin Khalad) narrated from his father:",
      "english_text": "Who said that the Messenger of Allah said: \"Jibril came to me and ordered me to order my Companions to raise their voices with the Ihlal, or; the Talbiyah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 831,
      "title": "Jami` at-Tirmidhi 830",
      "narrator": "Zaid bin Thabit narrated from his father :",
      "english_text": "who said that he saw the Prophet disrobing for his Ihlal and to perform Ghusl.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 832,
      "title": "Jami` at-Tirmidhi 831",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "A man said: \"Where should we begin our Hil (Ihram) O Messenger of Allah?\" He said: \"The people of Al-Madinah begin their Hil (Ihram) from Dhul-Hulaifah, the people from Ash-Sham from Al-Juhfah, and the people of Najd from Qarn.\" And he (Ibn Umar) said: (\"And they say:) \"And the people of Yemen from Yalamlam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 833,
      "title": "Jami` at-Tirmidhi 832",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet made Al-Aqiq the Miqat for the people of the west.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 834,
      "title": "Jami` at-Tirmidhi 833",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"A man stood and said 'O Messenger of Allah! What clothing do you command us to wear in Al-Haram?' The Messenger of Allah said: 'Do not wear shirts, nor pants, nor burnooses, nor turbans, nor Khuff - unless one does not have any sandals, then let him wear Khuff, but let him cut them below the ankles. And do not wear any cloth that has been touched by saffron or Wars. And the woman in Ihram is not to cover her face, nor wear gloves.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 835,
      "title": "Jami` at-Tirmidhi 834",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "He heard the Messenger of Allah say: \"If the Muhrim cannot find an Izar, then let him wear pants, and if he cannot find sandals, them let him wear Khuff.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 836,
      "title": "Jami` at-Tirmidhi 835",
      "narrator": "Ya'la bin Umayyah narrated:",
      "english_text": "\"The Messenger of Allah saw a Bedouin who was in Ihram wearing a cloak. So he ordered him to remove it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 837,
      "title": "Jami` at-Tirmidhi 836",
      "narrator": "Ya'la bin Umayyah narrated:",
      "english_text": "A Hadith similar to no. 835 with a different chain",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 838,
      "title": "Jami` at-Tirmidhi 837",
      "narrator": "Aishah narrated that :",
      "english_text": "the Messenger of Allah said: \"Five are Fawasiq which may be killed in the Haram: the mouse, the scorpion, the crow, the kite, and the barbed dog.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 839,
      "title": "Jami` at-Tirmidhi 838",
      "narrator": "Abu Sa'eed narrated that:",
      "english_text": "The Prophet said: \"The Muhrim may kill the wild beast of prey, the rabid dog, the mouse, the scorpion, the kite, and the crow.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 840,
      "title": "Jami` at-Tirmidhi 839",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah was cupped while he was a Muhrim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 841,
      "title": "Jami` at-Tirmidhi 840",
      "narrator": "Nubaih bin Wahb narrated:",
      "english_text": "\"Ibn Ma'mar wanted to have his son married. S he sent me to Aban bin Uthman who was the Amir of the (Hajj) season. I went to him and said: 'Your brother wants to marry his son and he would like for you to witness that.' He said: 'I think he is but a crude Bedouin; indeed the Muhrim is not to marry nor have someone married'\" - or he said similarly - then he narrated from Uthman similar in Marfu form (from the Prophet).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 842,
      "title": "Jami` at-Tirmidhi 841",
      "narrator": "Abu Rafi narrated:",
      "english_text": "\"The Messenger of Allah married Maimunah while he was Halal, and he stayed with her while he was Halal, and I was the messenger between the two of them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 843,
      "title": "Jami` at-Tirmidhi 842",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 844,
      "title": "Jami` at-Tirmidhi 843",
      "narrator": "(Another chain) that Ibn Abbas narrated:",
      "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 845,
      "title": "Jami` at-Tirmidhi 844",
      "narrator": "(Another chain) that Ibn Abbas narrated:",
      "english_text": "\"The Prophet married Maimunah while he was a Muhrim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 846,
      "title": "Jami` at-Tirmidhi 845",
      "narrator": "Yazid bin Al-Asamm narrated about Maimunah:",
      "english_text": "\"The Messenger of Allah married he while he was Halal and he stayed with her while he was Halal. She died in Sarif, and we buried her at the (site of the) tent where he had stayed wit her.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 847,
      "title": "Jami` at-Tirmidhi 846",
      "narrator": "Jabir bin Abdullah narrated that:",
      "english_text": "The Prophet said: \"The land game is lawful for you while you are in Ihram as long as you did not hunt it - or - it was not hunted for you.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 848,
      "title": "Jami` at-Tirmidhi 847",
      "narrator": "Abu Qatadah narrated that:",
      "english_text": "He was with the Prophet and when he got to one of the roads of Makkah some of the companions were Muhrim and he (Abu Qatadah) was not a Muhrim. So he saw a wild donkey, so he mounted his horse, asked his companions to give him his whip but they refused, so he asked them to give him his spear and they refused. So he (himself) took it and struck the donkey killing it. Some of the Companions of the Prophet ate it and some of them refused. When they caught up to the Prophet they asked him about that and he said: \"It is only food which Allah fed you.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 849,
      "title": "Jami` at-Tirmidhi 848",
      "narrator": "(Another chain that) Abu Qatadah narrated:",
      "english_text": "About the wild donkey, and it is similar to the (previous) narrated of Abu An-Nadr except that in the narration of Zaid bin Aslam he said that the Messenger of Allah said: \"Do you have any of its meat left with you?\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 850,
      "title": "Jami` at-Tirmidhi 849",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "As-S'ab bin Jath-thamah informed him that the Messenger of Allah had passed him at Al-Abwa or Bawaddan. He (As-S'ab) gave him a wild donkey but he refused it. When the Messenger of Allah noticed on his face that he was upset, he said: \"We would not refuse you, but we are in Ihram\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 851,
      "title": "Jami` at-Tirmidhi 850",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"We went with the Messenger of Allah during Hajj or Umrah and we encountered a swarm of locusts. We began striking at them with our whips and set our staffs, and the Prophet said: \"Eat it, for indeed it is game of the sea.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 852,
      "title": "Jami` at-Tirmidhi 851",
      "narrator": "Ibn Abi Ammar said:",
      "english_text": "\"I asked Jabir bin Abdullah: 'Is the hyena game?' He said: 'Yes'\" He said: \"I said: 'Can it be eaten?' He said: 'Yes.'\" He said: \"I said: 'Did the Messenger of Allah say that?' He said: 'Yes.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 853,
      "title": "Jami` at-Tirmidhi 852",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet performed Ghusl for entered Makkah at Fakhkh.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 854,
      "title": "Jami` at-Tirmidhi 853",
      "narrator": "Aishah narrated:",
      "english_text": "\"When Prophet came to Makkah he entered it from its higher side, and left from its lower side.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 855,
      "title": "Jami` at-Tirmidhi 854",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet entered Makkah during the daytime.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 856,
      "title": "Jami` at-Tirmidhi 855",
      "narrator": "Al-Muhajir Al-Makki said:",
      "english_text": "Jabir bin Abdulla was asked about a man raising his hands when he sees the House (Ka'bah). So he said: 'We performed Hajj with the Messenger of Allah and we did it.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 857,
      "title": "Jami` at-Tirmidhi 856",
      "narrator": "Jabir narrated:",
      "english_text": "\"When the Prophet arrived in Makkah, he entered the Masjid and touched the (Black) Stone, then went to his right and performed Raml (walking quickly) for three (circuits) and walking for four. Then he came to the Maqam and said: 'And take you (people) the Maqam (place) of Ibrahim as a place of prayer.' Then he performed two Rak'ah while the Maqam was between him and the House. Then he came to the (Black) Stone after the two Rak'ah to touch it, then he left to As-Safa - I think - he said: Indeed As-Safa and Al-Marwah are among the symbols of Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 858,
      "title": "Jami` at-Tirmidhi 857",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Prophet performed Raml from the (Black) Stone to the (Black) Stone for three (circuits), and he walked four (circuits).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 859,
      "title": "Jami` at-Tirmidhi 858",
      "narrator": "Abu Tufail narrated:",
      "english_text": "\"I was with Ibn Abbas, and Mu'awiyah would not pass any corner without touching it. So Ibn Abbas said to him: 'the Prophet would not touch any besides the Black Stone and the Yemeni corner.' So Mu'awiyah said: 'There is no part of the House that is untouchable.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 860,
      "title": "Jami` at-Tirmidhi 859",
      "narrator": "Ibn Ya'la narrated from his father:",
      "english_text": "\"The Prophet performed Tawaf of the House Mudtabi'an, and he was wearing a Burd.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 861,
      "title": "Jami` at-Tirmidhi 860",
      "narrator": "Abbas bin Rabi'ah said:",
      "english_text": "\"I saw Umar bin Al-Khattab kissing the (Black) Stone and saying: 'I am kissing you while I know that you are just a stone, and if I had not seen the Messenger of Allah kissing you, I would not kiss you.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 862,
      "title": "Jami` at-Tirmidhi 861",
      "narrator": "Az-Zubair bin Arabi narrated:",
      "english_text": "That a man asked Ibn Umar about touching the (Black) Stone, so he said: \"I saw the Prophet touching it and kissing it.\" So the man said: \"What is your view if there is a throng (around the Ka'bah) and what is your view if the people overpowered me?\" Ibn Umar said: \"Leave 'What is your view' in Yemen. I saw the Prophet touching it and kissing it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 863,
      "title": "Jami` at-Tirmidhi 862",
      "narrator": "Jabir narrated:",
      "english_text": "\"When the Prophet arrived in Makkah, he performed seven (circuits) of Tawaf around the House. Then he came to the Maqam and said:  And take you (people) the Maqam (place) of Ibrahim as a place of prayer. Then he prayed behind the Maqam. Then he came to the (Black) Stone to touch it. Then he said: 'We begin with what Allah began with.' So he began at As-Safa and recited: Indeed As-Safa and Al-Marwah are among the Symbols of Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 864,
      "title": "Jami` at-Tirmidhi 863",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah only performed the Sa'i of the House and of As-Safa and Al-Marwah to show his strength to the idolaters.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 865,
      "title": "Jami` at-Tirmidhi 864",
      "narrator": "Kathir bin Jumhan said:",
      "english_text": "\"I saw Ibn Umar walking at the place of Sa'i so I said to him: 'Do you walk at the place of Sa'i between As-Safa and Al-Marwah?' He said: 'If I performed Sa'i, then it is because I saw the Messenger of Allah performing Sa'i there, and if I walked, then it is because I have seen the Messenger of Allah walking. And I am an old man.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 866,
      "title": "Jami` at-Tirmidhi 865",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet performed Tawaf upon his mount, so when he arrived at the (Black Stone) corner, he pointed to it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 867,
      "title": "Jami` at-Tirmidhi 866",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Whoever performed Tawaf around the House fifty time, he will be as free of his sins as the day his mother bore him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 868,
      "title": "Jami` at-Tirmidhi 867",
      "narrator": "Ayyub As-Sakhtiyani said:",
      "english_text": "\"We considered Abdullah bin Sa'eed bin Jubair to be better than his father, and he had a brother named Abdul-Malik bin Sa'eed bin Jubair who also reported from him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 869,
      "title": "Jami` at-Tirmidhi 868",
      "narrator": "Jubair bin Mut'im narrated that :",
      "english_text": "the Prophet said: \"O Banu Abd Manaf! Do not prevent anyone from performing Tawaf around this House, and Salat, whichever hour it is of the night or day.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 870,
      "title": "Jami` at-Tirmidhi 869",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "During the two Rak'ah of Tawaf, the Messenger of Allah recited the two Surat of Ikhlas, \"Say: O you disbelievers!\" and: \"Say: He is Allah, (the) One.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 871,
      "title": "Jami` at-Tirmidhi 870",
      "narrator": "Ja'far bin Muhammad narrated from his father:",
      "english_text": "that he considered it recommended for the two Rak'ah of Tawaf to recite: Say: \"O you disbelievers!\" and: Say: \"He is Allah, (the) One.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 872,
      "title": "Jami` at-Tirmidhi 871",
      "narrator": "Zaid bin Uthai said:",
      "english_text": "XI asked Ali: \"What is it that you were sent with?\" He said: \"With four things: None will be admitted into Paradise except for the soul that is a Muslim. None is to perform Tawaf around the House while naked. The Muslims and the idolaters will not be gathering (in Makkah) together after this year. And for whomever there is a covenant between him and the Prophet, then his covenant is (valid) until its term, and for that in which there was no term, then it shall be four months.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 873,
      "title": "Jami` at-Tirmidhi 872",
      "narrator": "Zaid bin Uthai said:",
      "english_text": "(Another chain) and they said: \"Zaid bin Yuthai\" and this is more correct.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 874,
      "title": "Jami` at-Tirmidhi 873",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet left me while he had a joyous look of contentment and he returned to me grieving. So I asked him about that and he said: 'I entered the Ka'bah, and I wished that I had not done it. I fear that my Ummah will follow me (in that) after me.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 875,
      "title": "Jami` at-Tirmidhi 874",
      "narrator": "Ibn Umar narrated from Bilal:",
      "english_text": "\"The Prophet performed Salat in the interior of the Ka'bah.\" And Ibn Abbas said: \"He did not perform Salat in it, but he said the Takbir.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 876,
      "title": "Jami` at-Tirmidhi 875",
      "narrator": "Al-Aswad bin Yazid narrated that:",
      "english_text": "Ibn Az-Zubair said to him: \"Narrated to me from what the Mother of the Believers used to (secretly) inform you about\" - meaning Aishah - so he said: \"She narrated to me that the Messenger of Allah said: 'Had your people not been still close to the pre-Islamic period of ignorance, then I would demolish the Ka'bah and rebuild it with two doors.'\" He said: \"So when Ibn Az-Zubair came to power he demolished it and rebuilt it with two doors.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 877,
      "title": "Jami` at-Tirmidhi 876",
      "narrator": "Aishah narrated:",
      "english_text": "\"I wanted to enter the House to perform Salat in it, so the Messenger of Allah took me by the hand and put me in the Hijr, and he said: 'Perform Salat in the Hijri if you want to enter the House. For indeed it is part of the House, but your people considered it insignificant when they built the Ka'bah, so they put it outside the House.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 878,
      "title": "Jami` at-Tirmidhi 877",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "The Messenger of Allah said: \"The Black Stone descended from the Paradise, and it was more white than milk, then it was blackened by the sins of the children of Adam.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 879,
      "title": "Jami` at-Tirmidhi 878",
      "narrator": "Abdullah bin Amr narrated that :",
      "english_text": "He heard the Messenger of Allah saying: \"Indeed the Corner and the Maqam are two corundums from the corundum of Paradise. Allah removed their lights, and if their lights had not been removed then they would illuminate what is between east and the west.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 880,
      "title": "Jami` at-Tirmidhi 879",
      "narrator": "Ata reported that Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah led us in Salat at Mina for Zuhr, Asr, Maghrib, Isha, and Fajr, then he left in the morning to Arafat.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 881,
      "title": "Jami` at-Tirmidhi 880",
      "narrator": "Al-Hakam reported from Miqsam, that Ibn Abbas narrated:",
      "english_text": "That the Prophet prayed Zuhr and Fajr in Mina, then he left in the morning to Arafat.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 882,
      "title": "Jami` at-Tirmidhi 881",
      "narrator": "Aishah said:",
      "english_text": "\"We said: 'O Messenger of Allah! Shall we build a structure to shade you at Mina? He said: 'No., Mina is a resting place for whoever arrives.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 883,
      "title": "Jami` at-Tirmidhi 882",
      "narrator": "Harithah bin Wahb said:",
      "english_text": "\"I prayed two Rak'ah with the Prophet at Mina, and the people were as secure as they ever were, and even more so.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 884,
      "title": "Jami` at-Tirmidhi 883",
      "narrator": "Amr bin Dinar narrated from Amr bin Abdulah bin Safwan, that Yazid bin Shaiban said:",
      "english_text": "\"Ibn Mirba Al-Ansari came to us while we were standing at our places\" (Amr bin Sinar said:) a place that Amr (bin Abdullah) indicated was far - \"and he said: 'I am a messenger whom the Messenger of Allah sent to you to say: 'Stay with your (Hajj) rites, for indeed you are following a legacy left by Ibrahim.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 885,
      "title": "Jami` at-Tirmidhi 884",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Quraish and those who followed their religion - and they were called Al-Hums - would stand at Al-Muzdalifah, and they would say: 'We are the people of Allah.' The others would stand at Arafat, so Allah the Mighty and Sublime revealed: Then depart from where the people depart.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 886,
      "title": "Jami` at-Tirmidhi 885",
      "narrator": "Ali bin Abi Talib, may Allah be pleased with him, narrated:",
      "english_text": "\"The Messenger of Allah stopped at Arafat and said: 'This is Arafah and it is a place of standing. And all of Arafat is a place for standing.' Then he departed when the sun had set and took Usamah bin Zaid as a companion rider, and he was motioning with his hand as was his custom, and the people were striking (their camels) on the right and the left to try and catch them, so he said: 'O you people! Be calmm.' Then he came to Jama and performed the two Salat there combined. When the morning came, he went to Quzah and stood there and said: 'This is Quzah, and it is a place of standing, and all of Jama is a place for standing.' Then he departed until he arrived at Wadi Muhassir. Then he stuck his she-camel and she trotted until he passed the valley. Then he stopped and took Al-Fadl as a companion rider and went to the Jamrah to stone it. Then he went to Al-Manhar and said: 'This is Al-Manhar, and all of Mina is a place for sacrifice.' A young girl from Khath'am came to ask him for a verdict, she said: 'Indeed my father is an elderly man who has lived until Allah has made Hajj obligatory, so would he be rewarded if I perform Hajj for him? He said: 'Perform Hajj for your father.'\" He said: \"And he turned the neck of Al Fadl. So Al-Abbas said: 'O Messenger of Allah! Why did you turn the neck of your cousin?' He said: 'I saw a young man and a young woman, and they were not safe from Shaitan.' A man came to him and said, 'O Messenger of Allah! I performed (Tawaf) Al-Ifadah before shaving.' He said: 'Shave, and there is no harm'\" - or: 'Clip and there is no harm'\" He said: \"Someone else came and said: 'O Messenger of Allah! I did the sacrifice before stoning.' So he said: 'Stone, and there is no harm.'\" He said: \"Then he went to the House (Ka'bah) to perform Tawaf around it, then he went to Zamzam and said: 'O tribe of Abdul-Muttalib! If it were not that the people would rush upon you then I would remove it.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 887,
      "title": "Jami` at-Tirmidhi 886",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Prophet hurried through Wadi Muhassir.\" Bishr (one of the narrators) added: \"He departed from Jam calmly and he ordered them (the people) to be calm.\" And Abu Nu'aim (one of the narrators) added: \"And he ordered them to do the stoning with what was similar to pebbles for Al-Khadhf' And he said: \"Perhaps I will not see you after this year.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 888,
      "title": "Jami` at-Tirmidhi 887",
      "narrator": "Abdullah bin Malik narrated:",
      "english_text": "\"Ibn Umar prayed at Jam (Muzdalifah), so he combined two prayers with the Iqamah, and he said: 'I saw the Messenger of Allah doing the same as this at the place.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 889,
      "title": "Jami` at-Tirmidhi 888",
      "narrator": "(Another chain) that Sa'eed bin Jubair narrated :",
      "english_text": "Similarly from Ibn Umar, from the Prophet.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 890,
      "title": "Jami` at-Tirmidhi 889",
      "narrator": "Abdur-Rahman bin Ya'mar narrated that:",
      "english_text": "Some people among the residents of Najd came to the Messenger of Allah while he was at Arafat. They were questioning him, so he ordered a caller to proclaim: \"The Hajj is Arafah. Whoever came to Jam during the night, before the time of Fajr, then he has attended the Hajj. The days of Mina are three, so whoever hastens (leaving after) two days, then there is no sin upon him, and whoever delays, then there is no sin upon him.\" Muhammad said: \"Yahya added: 'And he took a companion rider to proclaim it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 891,
      "title": "Jami` at-Tirmidhi 890",
      "narrator": "Abdur-Rahman bin Ya'mar narrated:",
      "english_text": "(Another chain) with a similar narration (as no. 889).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 892,
      "title": "Jami` at-Tirmidhi 891",
      "narrator": "Urwah bin Mudarris bin Aws bin Harithah bin Lam At-Ta'i narrated:",
      "english_text": "\"I came to the Messenger of Allah at Al-Muzdalifah when he left for the Salat. I said: 'O Messenger of Allah! I came from the two mountains of (the tribe of) Tai, wearing out my mount and exhausting myself. By Allah! I did not leave a Habl (sand dune) without stopping on it. So is there Hajj for me?' The Messenger of Allah said: 'Whoever attends this Salat of ours, and stays here with us until departing, while he has stood during the night or the day before that at Arafat, then he has completed his Hajj and fulfilled his Tafath.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 893,
      "title": "Jami` at-Tirmidhi 892",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah sent me with the Thaqal (load of baggage) during the night from Jam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 894,
      "title": "Jami` at-Tirmidhi 893",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet advanced the weak among his family and he said: 'Do not stone the Jamrah until the sun has risen.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 895,
      "title": "Jami` at-Tirmidhi 894",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Prophet would stone on the Day of An-Nahr during the morning light, as for (the days) afterwards, then (he would do it) after the Zenith of the sun.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 896,
      "title": "Jami` at-Tirmidhi 895",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet departed before the rising of the sun.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 897,
      "title": "Jami` at-Tirmidhi 896",
      "narrator": "Amr bin Maimun narrated:",
      "english_text": "\"We were halted at Jama when Umar bin Al-Khattab said: 'The idolaters would not depart until the sun had risen and they would say: \"Let the sun shine on Thabir\" and indeed the Messenger of Allah contradicted them.' So Umar departed before the rising of the sun.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 898,
      "title": "Jami` at-Tirmidhi 897",
      "narrator": "Jabir narrated:",
      "english_text": "\"I saw the Messenger of Allah stoning the Jimar with what was similar to pebbles for Al-Khadhaf.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 899,
      "title": "Jami` at-Tirmidhi 898",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Messenger of Allah stoned the Jimar when the sun had passed the zenith.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 900,
      "title": "Jami` at-Tirmidhi 899",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet stoned the Jamrah on the Day of An-Nahr while riding.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 901,
      "title": "Jami` at-Tirmidhi 900",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet would walk when stoning the Jimar, both going and returning.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 902,
      "title": "Jami` at-Tirmidhi 901",
      "narrator": "Abdur-Rahman bin Yazid narrated:",
      "english_text": "\"When Abdullah went to stone Jamrat Al-Aqabah, he went to the middle of the valley, faced the Ka'bah, and proceeded to stone the Jamrah at its southern wall. Then he stoned with seven pebbles, saying: \"Allahu Akbar\" with each pebble. Then he said: 'By Allah except Whom none is worthy of worship. This is where the one stoned to whom Surat Al-Baqarah was revealed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 903,
      "title": "Jami` at-Tirmidhi 902",
      "narrator": "Aishah narrated that:",
      "english_text": "The Prophet said: \"Stoning the Jimari and Sa'i between As-Safa and Al-Marwah are only done for the establishment of Allah's remembrance.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 904,
      "title": "Jami` at-Tirmidhi 903",
      "narrator": "Qudamah bin Abdullah said:",
      "english_text": "\"I saw the Prophet stoning the Jimar upon his she-camel; there was no hitting, nor crowding, nor: 'Look out! Look out!'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 905,
      "title": "Jami` at-Tirmidhi 904",
      "narrator": "Jabir narrated:",
      "english_text": "\"We slaughtered with the Messenger of Allah during the year of Al-Hudaibiyah: a cow for seven, and a Badanah for seven.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 906,
      "title": "Jami` at-Tirmidhi 905",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"We were with the Prophet on a journey (on the Day of) Adha, so seven of us shared in a cow, and ten for a camel.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 907,
      "title": "Jami` at-Tirmidhi 906",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"The Prophet garlanded two sandals and marked the Hadi on the right side at Dhul-Hulaifah, and removed the blood from it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 908,
      "title": "Jami` at-Tirmidhi 907",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet purchased his Hadi in Qudaid.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 909,
      "title": "Jami` at-Tirmidhi 908",
      "narrator": "Aishah narrated:",
      "english_text": "\"I twisted the garlands for the Hadi of the Prophet, then he did not assume Ihram, nor did he avoid any clothing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 910,
      "title": "Jami` at-Tirmidhi 909",
      "narrator": "Aishah narrated:",
      "english_text": "\"I twisted the garlands for all of the Hadi of the Messenger of Allah, which were sheep, then he did not assume Ihram.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 911,
      "title": "Jami` at-Tirmidhi 910",
      "narrator": "Najiyah Al-Khuza'i (the Companion of the Messenger of Allah) said:",
      "english_text": "\"I said: 'O Messenger of Allah! What should be done with the afflicted among the Hadi?' He said: 'Slaughter them, then dip their sandals in their blood, then leave them so that the people can eat them.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 912,
      "title": "Jami` at-Tirmidhi 911",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "That the Prophet saw a man driving his Badanah so he said to him: \"Ride it.\" He said: \"O Messenger of Allah! It is a Badanah.\" So on the third or fourth time he said to him: \"Ride it. And woe to you!\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 913,
      "title": "Jami` at-Tirmidhi 912",
      "narrator": "Anas bin Malik narrted:",
      "english_text": "\"When the Messenger of Allah stoned the Jamrah, he slaughtered his sacrifice, then he presented the barber the right side (of his head) and he shaved it, then he gave (the hair) to Abu Talhah. Then he presented the left side to him and he shaved it. Then he said: 'Divide it (the hair) among the people.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 914,
      "title": "Jami` at-Tirmidhi 913",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Messenger of Allah said: \"May Allah have mercy upon those who shaved\" saying it one or two times, then he said: \"And those who shortened.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 915,
      "title": "Jami` at-Tirmidhi 914",
      "narrator": "Ali narrated:",
      "english_text": "\"The Messenger of Allah prohibited that a woman should shave her head.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 916,
      "title": "Jami` at-Tirmidhi 915",
      "narrator": "(Another chain) with similar (as no. 914) from Khilas:",
      "english_text": "But he did not mention \"from Ali.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 917,
      "title": "Jami` at-Tirmidhi 916",
      "narrator": "Abdullah bin Amr narrated:",
      "english_text": "\"A man asked the Messenger of Allah: 'I shaved before slaughtering.' So he said: 'Slaughter, and there is no harm.' Another man asked him: 'I performed the sacrifice before stoning.' He said: 'Stone, and there is no harm.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 918,
      "title": "Jami` at-Tirmidhi 917",
      "narrator": "Aishah narrated:",
      "english_text": "\"I put perfume with musk in it on the Messenger of Allah before he assumed Ihram, and on the Day of An-Nahr before he performed Tawaf around the House.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 919,
      "title": "Jami` at-Tirmidhi 918",
      "narrator": "Al-Fadl bin Abbas narrated:",
      "english_text": "\"I was a companion rider with the Messenger of Allah from Jam to Mina. He did not cease saying the Talbiyah until stoning Jamrat Al-Aqabah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 920,
      "title": "Jami` at-Tirmidhi 919",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "(that the Prophet): \"Would stop saying the Talbiyah during \"Umrah when he touched the (Black) Stone.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 921,
      "title": "Jami` at-Tirmidhi 920",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet delayed the visiting Tawaf until the night.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 922,
      "title": "Jami` at-Tirmidhi 921",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet, Abu Bakr, Umar, and Uthman would camp at Al-Abtah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 923,
      "title": "Jami` at-Tirmidhi 922",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"At-Tahsib is nothing, it is only a place that the Messenger of Allah camped at.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 924,
      "title": "Jami` at-Tirmidhi 923",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Messenger of Allah only camped at Al-Abtah because it was easier for his departure.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 925,
      "title": "Jami` at-Tirmidhi 924",
      "narrator": "Jabir bin Abdullah narrated:",
      "english_text": "\"A woman held a boy of hers up for the Messenger of Allah and said: 'O Messenger of Allah! Is there Hajj for this one' He said: 'Yes, and you will be rewarded.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 926,
      "title": "Jami` at-Tirmidhi 925",
      "narrator": "As-Sa'ib bin Yazid narrated:",
      "english_text": "\"My father took me for Hajj with the Messenger of Allah during the Farewell Hajj, and I was seven years old.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 927,
      "title": "Jami` at-Tirmidhi 926",
      "narrator": "(Another chain) from Jabir bin Abdullah:",
      "english_text": "From the Prophet, with similar (Hadith of Muhammad bin Tarif no. 924).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 928,
      "title": "Jami` at-Tirmidhi 927",
      "narrator": "Jabir narrated:",
      "english_text": "\"When we performed our Hajj with the Prophet we would say the Talbiyah for the women and we would stone for the boys.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 929,
      "title": "Jami` at-Tirmidhi 928",
      "narrator": "Al-Fadl bin Abbas narrated:",
      "english_text": "\"A woman from Khath'am said: 'O Messenger of Allah! My father has lived until Allah has made Hajj obligatory, and he is an elderly man who is not able to sit on the back of a camel.' So he (pbuh) said: 'Perform Hajj for him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 930,
      "title": "Jami` at-Tirmidhi 929",
      "narrator": "Abdullah bin Buraidah narrated from his father who said:",
      "english_text": "\"A woman came to the Prophet and said: 'My mother died and she did not perform Hajj should I perform Hajj on her behalf?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 931,
      "title": "Jami` at-Tirmidhi 930",
      "narrator": "Abu Razin Al-Uqaili narrated:",
      "english_text": "That he went to the Prophet and said: \"O Messenger of Allah! My father is an elderly man who is not able to perform Hajj nor Umrah nor undertake a journey.' He said: 'Perform Hajj on behalf of your father and perform Umrah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 932,
      "title": "Jami` at-Tirmidhi 931",
      "narrator": "Jabir narrated that:",
      "english_text": "The Prophet was asked about whether Umrah was obligatory? He said: \"No. But if you perform Umrah it is more virtuous.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 933,
      "title": "Jami` at-Tirmidhi 932",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "That the Prophet said: \"Umrah has been entered into Hajj until the Day of Resurrection.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 934,
      "title": "Jami` at-Tirmidhi 933",
      "narrator": "Abu Hurairah narrated that\nthe Messenger of Allah\nsaid:",
      "english_text": "\"Umrah to 'Umrah atones for the\nsins between them, and for A1-Hajj\nAl-Mabrur there is no reward\nexcept Paradise.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 935,
      "title": "Jami` at-Tirmidhi 934",
      "narrator": "Amr bin Aws narrated from Abdur-Rahman bin Abi Bakr:",
      "english_text": "\"The Prophet ordered Abdur-RAhman bin Abi Bakr to (accompany) Aishah to perform Umrah from At-Tan'im.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 936,
      "title": "Jami` at-Tirmidhi 935",
      "narrator": "Muharrish Al-Kabi narrated:",
      "english_text": "\"The Messenger of Allah left Al-Ji'irranah during the night for Umrah, then he entered Makkah during he night and performed his Umrah. Then he left there during the night, then he was in Al-Ji'irranah by the morning, as if he had spent the night. When the sun passed the zenith in the morning he left from the midst of Sarif until he came on a road from amidst Sarif. It is because of this that his Umrah was concealed from the people.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 937,
      "title": "Jami` at-Tirmidhi 936",
      "narrator": "Urwah said:",
      "english_text": "Ibn Umar was asked: In which month did the Messenger of Allah perform Umrah? He said: 'During Rajab.' So Aishah said: 'The Messenger of Allah did not perform Umrah except that he was with him - meaning Ibn Umar - and he did not ever perform Umrah in the month of Rajab.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 938,
      "title": "Jami` at-Tirmidhi 937",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet performed Umrah four times, one of them was during Rajab.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 939,
      "title": "Jami` at-Tirmidhi 938",
      "narrator": "Al-Bara narrated:",
      "english_text": "\"The Prophet performed Umrah during Dhul-Qa'dah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 940,
      "title": "Jami` at-Tirmidhi 939",
      "narrator": "Umm Ma'qil narrated that:",
      "english_text": "The Prophet said: \"Umrah during Ramadan is equal to Hajj.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 941,
      "title": "Jami` at-Tirmidhi 940",
      "narrator": "Ikrimah narrated from Al-Hajjaj bin Amr who narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever suffers a fracture or becomes lame them he (leaves the state of Ihram) and is required to perform another Hajj.\" I (Ikrimah) mentioned that to Abu Hurairah and Ibn Abbas and they said: \"He told the truth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 942,
      "title": "Jami` at-Tirmidhi 941",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"Duba'ah bint Az-Zubair came to the prophet and said: 'O Messenger of Allah! I want to perform Hajj so should I state a condition?' He said: 'Yes.' She asked: 'So how should I say it?' He said: 'Say; \"Labbaik Allahumma labbaika mahilli minal Ard haithu tahbisuni (I respond to Your call O Allah, I respond to Your call, I will exit Ihram any where on the earth where You prevent me.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 943,
      "title": "Jami` at-Tirmidhi 942",
      "narrator": "Salim narrated that :",
      "english_text": "His father disliked making a condition during Hajj and he said: 'Is not the Sunnah of your Prophet enough for you?\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 944,
      "title": "Jami` at-Tirmidhi 943",
      "narrator": "Aishah narrated:",
      "english_text": "\"It was mentioned to the Messenger of Allah that Safiyyah bint Huyai got her menses during the days of Mina, so he said: \"Will she prevent us (from departing)?\" They said: \"She has done (Tawaf) Al-Ifadah/\" So the Messenger of Allah said: \"In that case there is no harm.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 945,
      "title": "Jami` at-Tirmidhi 944",
      "narrator": "Ibn Umar said:",
      "english_text": "\"Whoever performs Hajj to the House, then let the last of their acts be at the House, except for menstruating women. The Messenger of Allah gave them permission (to leave).\" (Sahih Mawquf)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 946,
      "title": "Jami` at-Tirmidhi 945",
      "narrator": "Aishah narrated:",
      "english_text": "\"I got my menses do the Prophet ordered me to carry out all the rites except for Tawaf around the House.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 947,
      "title": "Jami` at-Tirmidhi 945",
      "narrator": "Ibn Abbas narrated :",
      "english_text": "(that the Prophet said): \"The women in past-natal bleeding and menses were to perform Ghusl, enter Ihram and carry out all of the rites except for Tawaf around the House, until they becomes clean.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 948,
      "title": "Jami` at-Tirmidhi 946",
      "narrator": "Al-Harith bin Abdullah bin Aws said:",
      "english_text": "\"I heard the Prophet saying: 'Whoever performs Hajj to this House, or Umrah, then let the last of his acts be at the House'\" So Umar said: \"May your hand be humiliated! You heard this from the Messenger of Allah but did not inform us of it?\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 949,
      "title": "Jami` at-Tirmidhi 947",
      "narrator": "Jabir narrated:",
      "english_text": "\"The Messenger of Allah performed Qaran for Hajj and Umrah, so he performed one Tawaf for both of them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 950,
      "title": "Jami` at-Tirmidhi 948",
      "narrator": "Ibn Umar narrated that:",
      "english_text": "The Messenger of Allah said: \"Whoever assumes Ihram for Hajj and Umrah, then it is acceptable for him to perform one Tawaf and one Sa'I for them both, until he exits Ihram for both of them together.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 951,
      "title": "Jami` at-Tirmidhi 949",
      "narrator": "Al-Ala bin Al-Hadrami narrated :",
      "english_text": "(that the Prophet said): \"The Muhajir may stay for three (days) in Makkah after carrying out his rites.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 952,
      "title": "Jami` at-Tirmidhi 950",
      "narrator": "Ibn Umar said:",
      "english_text": "\"When the Prophet would come home from a battle, or Hajj, or Umrah, when he was it a tract of land or raised area he would say 'Allahu Akbar (Allah is Most Great)' three times, then say: 'La Ilaha illallah Wahdahu la sharika lahu, lahul-mulku wa lahul-Hamdu wa Huwa ala kulli shai'in qadir. A'ibuna ta'ibun abidun saa'ihuna li Rabbina Hamiduna, Sadaqallahu wa'dahu wa nasara abdahu wa hazamal-ahzab Wahdah. (None has the right to be worshiped but Allah Alone without partners. To Him belongs the sovereignty and to Him belongs the praise, and He has power over all things. We are returning, repenting, worshipping, traveling for our Lord, and we are praising. Allah has told the truth, and kept His promise and helped His worshipper, and routed the confederates, Alone.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 953,
      "title": "Jami` at-Tirmidhi 951",
      "narrator": "Ibn Abbas narrated:",
      "english_text": "\"We were with the Messenger of Allah on a journey when he saw a man fall from his camel, his neck was broken and he died, and he was a Muhrim. So the Messenger of Allah said: 'Wash him with water and Sidr, and shroud him in his garments, and do not cover his head. For indeed he will be resurrected on the Day of Judgment saying the Talbiyah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 954,
      "title": "Jami` at-Tirmidhi 952",
      "narrator": "Nubaih bin Wahb narrated that :",
      "english_text": "Umar bin Ubaidullah bin Ma'mar was complaining about his eyes while he was a Muhrim. He asked Aban bin Uthman about it and he said: \"Bandage it with some aloes, for I heard Uthman bin Affan mentioning that the Messenger of Allah said: 'Bandage it with aloes.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 955,
      "title": "Jami` at-Tirmidhi 953",
      "narrator": "Abdur-Rahman bin Abu Laila narrated from Ka'b bin Ujrah that:",
      "english_text": "The Prophet passed by him while he was at Al-Hudaibiyah, before entering Makkah, and he was a Muhrim. He had lit a fire under a cooking pot and lice were falling all over his face. So he (the Prophet) said: \"Have these lice of yours troubled you?\" He said: \"Yes.\" He said: \"Shave and feed six of the poor with a Faraq\" and a Faraq is three Sa - \"or fast three days, or slaughter a sacrifice.\" Ibn Abi Najih (one of the narrators) said: \"Or slaughter a sheep.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 956,
      "title": "Jami` at-Tirmidhi 954",
      "narrator": "Abi Al-Baddah bin Adi narrated from his father:",
      "english_text": "\"The Prophet permitted the shepherds to stone a day and leave a day.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 957,
      "title": "Jami` at-Tirmidhi 955",
      "narrator": "Abi Al-Baddah bin Asim bin Adi narrated from his father:",
      "english_text": "\"The Messenger of Allah permitted the camel herders who were in the camp (at Mina) to stone on the Day of An-Nahr then to gather the stoning of two days after the Day of An-Nahr, so that they stoned them during one of them.\" Malik said: \"I think that he said about the first of them: 'They they should stone on the day of departure.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 958,
      "title": "Jami` at-Tirmidhi 956",
      "narrator": "Anas bin Malik narrated:",
      "english_text": "\"When Ali returned to the Messenger of Allah from Yemen he said: 'For what did you intended the Talbiyah?' He replied: 'I intended the Talbiyah for what the Messenger of Allah announced it.' So he (pbuh) said: 'If I did not have the Hadi with me then I would exit Ihram.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 959,
      "title": "Jami` at-Tirmidhi 957",
      "narrator": "Ali narrated:",
      "english_text": "\"I asked the Messenger of Allah about the day of Al-Hajj Al-Akbar and he said: 'They Day of An-Nahr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 960,
      "title": "Jami` at-Tirmidhi 958",
      "narrator": "Ali narrated:",
      "english_text": "\"They day of Al-Hajj Al-Akbar is the Day of An-Nahr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 961,
      "title": "Jami` at-Tirmidhi 959",
      "narrator": "Ibn Ubaid bin Umair narrated from his father:",
      "english_text": "\"Ibn Umar was clinging on the two corners (in a manner that I had not seen any of the Companions of the Prophet doing) so I said: 'O Abu Abdur-Rahman! You are clinging on the two corners in a manner that I have not seen any of the Companions of the Prophet clining.' So he said: 'I do it because I heard the Messenger of Allah saying: \"Touching them atones for sins.\" And I heard him saying: \"Whoever performs Tawaf around this House seven times and he keeps track of it, then it is as if he freed a slave.\" And I heard him saying: \"One foot is not put down, nor another raised except that Allah removes a sin from him and records a good merit for him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 962,
      "title": "Jami` at-Tirmidhi 960",
      "narrator": "Ibn Abbas narrated that :",
      "english_text": "the Prophet said: \"Tawaf around the House is similar to Salat except that you talk during it. So whoever talks in it, then let him not say but good.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 963,
      "title": "Jami` at-Tirmidhi 961",
      "narrator": "Ibn Abbas narrated that:",
      "english_text": "The Messenger of Allah said about the (Black) Stone: \"By Allah! Allah will raise it on the Day of Resurrection with two eyes by which it sees and a tongue that it speaks with, testifying to whoever touched it in truth.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 964,
      "title": "Jami` at-Tirmidhi 962",
      "narrator": "Ibn Umar narrated:",
      "english_text": "\"The Prophet would apply oil that is not scented (Ghair Muqattat) while he was a Muhrim.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 965,
      "title": "Jami` at-Tirmidhi 963",
      "narrator": "Hisham bin Urwah narrated :",
      "english_text": "from his father about Aishah, that she would carry some Zamzam water, and she would say: \"Indeed the Messenger of Allah would carry it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 966,
      "title": "Jami` at-Tirmidhi 964",
      "narrator": "Abdul-Aziz bin Rufai narrated:",
      "english_text": "\"I said to Anas bin Malik: 'Narrated something to me that you understand about where the Messenger of Allah performed Zuhr on the Day of Tarwiyah.' He said: 'In Mina.'\" \"I said: 'So where did he pray Asr on the day of departure?' He said: 'In Al-Abtab.' Then he said: 'Do what your leaders do.'\"",
      "grade": "Sahih (Darussalam)"
    }
  ]
}