{
  "chapterNum": 27,
  "english_title": "Chapters on Righteousness And Maintaining Good Relations With Relatives",
  "totalHadiths_inChapter": 141,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 1963,
      "title": "Jami` at-Tirmidhi 1897",
      "narrator": "Bahz bin Hakim narrated from his father, from his grandfather who said:",
      "english_text": "\"I said: 'O Messenger of Allah! Who most deserves(my) reverence?' He said: 'Your mother.'\" He said: \"I said: 'Then who?' He said: 'Your mother.'\"\nHe said: \"I said: 'Then who?' He said: 'Your mother.'\"\nHe said: \"I said: 'Then who?' He said: 'Then your father, then the nearest relatives, then the nearest relatives.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 1964,
      "title": "Jami` at-Tirmidhi 1898",
      "narrator": "Ibn Mas'ud said:",
      "english_text": "\"I asked the Messenger of Allah: 'O Messenger of Allah! Which is the most virtuous of deeds?' He said: 'Salat during its appropriate time.' I said: 'Then what, O Messenger of Allah?' He said: 'Being dutiful to one's parents.' \nI said: 'Then what, O Messenger of Allah?' He said: 'Jihad in the cause of Allah.'\nThen the messenger of Allah was silent, and if I had asked him more, he would have told me more.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 1965,
      "title": "Jami` at-Tirmidhi 1899",
      "narrator": "Abdullah bin Amr narrated that:",
      "english_text": "the Prophet said: \"The Lord's pleasure is in the parent's pleasure, and the Lord's anger is in the parent's anger.\"(Hasan).",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 1966,
      "title": "Jami` at-Tirmidhi 1900",
      "narrator": "Abu 'Abdur-Rahman As-Sulami  narrated from Abu Ad Darda'.:",
      "english_text": "He said that a man came and said : \"I have a wife whom my mother has ordered me to divorce.\" So Abu Ad-Darda said: \" I heard the Messenger of Allah saying: 'The father is the middle gate to Paradise. So if you wish, then neglect that door, or protect it.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 1967,
      "title": "Jami` at-Tirmidhi 1901",
      "narrator": "'Abdur-Rahman bin Abi Bakrah narrated from his father who said:",
      "english_text": "\" The messenger of Allah said: 'Shall I not tell you of the biggest of the major sins?' they said : 'Of course! O Messenger of Allah!' He said: 'To join partners with Allah, and disobeying one's parents.'\"He said : \" He sat up, and he had been reclining. He said: 'And false testimony, or false speech.' And the Messenger of Allah would not stop saying it until we said (to ourselves): 'I wish that he would stop.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 1968,
      "title": "Jami` at-Tirmidhi 1902",
      "narrator": "'Abdullah bin 'Amr narrated that :",
      "english_text": "the Messenger of Allah said: \"It is among the greatest of sins that a man should curse his parents.\" They said: \"O Messenger of Allah! Does a man curse his parents?\" He said: \"Yes. He verbally abuses the father of a man, who in turn, verbally abuses his father, and he (retaliates and) curses his mother , so he curses his mother.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 1969,
      "title": "Jami` at-Tirmidhi 1903",
      "narrator": "Ibn 'Umar narrated that :",
      "english_text": "the Prophet said:  \"Among the most dutiful of deeds is that a man nurture relations with the people his father was friends with.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 1970,
      "title": "Jami` at-Tirmidhi 1904",
      "narrator": "Al-Bara' bin Azib narrated that :",
      "english_text": "the Prophet said: \"The maternal aunt holds the same status as the mother.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 1971,
      "title": "Jami` at-Tirmidhi 1904b",
      "narrator": "(Another chain) From Ibn 'Umar:",
      "english_text": "A man came to the Prophet (ﷺ) and said: \"O Messenger of Allah! I have been afflicted by a tremendous sin. Is there any repentance for\nme?\" He said: \"Do you have your mother?\" The man said: \"No.\" He said: \"Do you have any maternal aunts?\" The man said: \"Yes.\" He said:\n\"Then be dutiful to them.\"",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 1972,
      "title": "Jami` at-Tirmidhi 1904c",
      "narrator": "",
      "english_text": "(Another chain) From Abu Bakr bin Hafs, from the Prophet (ﷺ), and it is similar, but he did not mention \"from Ibn `Umar\" in it. This is more correct than the Hadith of Abu Mu'awiyah, and Abu Bakr bin Hafs is Ibn 'Umar bin Sa'd bin Abi Waqqas (narrators in the chain of this Hadith.)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 1973,
      "title": "Jami` at-Tirmidhi 1905",
      "narrator": "Abu Harairah narrated that the Messenger of Allah said:",
      "english_text": "\"Three supplications are  accepted , there is no doubt in them (about them being accepted): The  supplication of the oppressed, the supplication of the traveler,  and the supplication of his father against his son.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 1974,
      "title": "Jami` at-Tirmidhi 1906",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "the Messenger of Allah said: \"A son could not  do enough for his father, unless he found him as a slave and purchased him to set him free.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 1975,
      "title": "Jami` at-Tirmidhi 1907",
      "narrator": "Abu Salamah said:",
      "english_text": "\" Abu[Ar-Raddad] Al-Laithi complained(of an illness). So 'Abdur-Rahman bin 'Awf  visited him. He said: 'The best of you, and the most apt to maintain good relations, as far as I know, is Abu Muhammad('Abdur-Rahman bin 'Awf). So 'Abdur-Rahman bin 'Awf' said: 'I heard the Messenger of Allah saying : \"Allah, Most Blessed and Most High, said: 'I am Allah, and I am Ar-Rahman. I created the Rahim(womb), and named it after My Name. So whoever keeps good relations with it, I keep good relation with him, and whoever severs it, I am finished with him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 1976,
      "title": "Jami` at-Tirmidhi 1908",
      "narrator": "'Abdullah bin Amr narrated that:",
      "english_text": "the Prophet said: \"Merely maintaining the ties of kinship is not adequate. But connecting the ties of kinship is when his ties to the womb are severed and he connects it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 1977,
      "title": "Jami` at-Tirmidhi 1909",
      "narrator": "Muhammad bin Jubair bin Mut'im narrated from his father, that:",
      "english_text": "the Messenger of Allah said: \"The one who severs ties will not enter Paradise.\" Ibn Abi 'Umar said: \"Sufyan said: 'Meaning: Ties of the womb.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 1978,
      "title": "Jami` at-Tirmidhi 1910",
      "narrator": "'Umar bin 'Abdul-'Aziz said:",
      "english_text": "'a righteous woman, Khawlah bint Hakim said: \"The Messenger of Allah came out during the middle of the day, while holding one of the sons of his daughter in his arms. He was saying: 'You are what makes them stingy, cowardly and ignorant. And you are but Raihanillah",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 1979,
      "title": "Jami` at-Tirmidhi 1911",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"Al-Aqra' bin Habis saw the prophet kissing Al-Hasan\"- Ibn Abi 'Umar (one of the narrators) said:\"Al-Hasan and Al-Husain.\" So he said: 'I have ten children and I do not kiss any one of them.' So the Messenger of Allah said: 'Whoever shows no mercy, he will be shown no mercy.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 1980,
      "title": "Jami` at-Tirmidhi 1912",
      "narrator": "Abu Sa'eed Al-Khudri narrated that :",
      "english_text": "the Messenger of Allah said: \"There is no one who has three daughters, or three sisters, and he treats them well, except that he enters paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 1981,
      "title": "Jami` at-Tirmidhi 1913",
      "narrator": "Aishah narrated that the:",
      "english_text": "Messenger of Allah said:\"Whoever is tried with something from daughters, and he is patient with them, they will be a barrier from the Fire for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 1982,
      "title": "Jami` at-Tirmidhi 1914",
      "narrator": "Abu Bakr bin 'Ubaidullah bin Anas bin Malik narrated [from Anas] that:",
      "english_text": "the Messenger of Allah said: \"Whoever raises two girls then I and he will enter Paradise like these two.\" And he indicated with his two fingers.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 1983,
      "title": "Jami` at-Tirmidhi 1915",
      "narrator": "Aishah said:",
      "english_text": "\"A woman came to me with two daughters. She was asking (for food) but I did not have anything with me except a date. So I gave it to her and she divided it between  her two daughters without eating any of it herself. Then she got up to leave, and the Prophet entered, and I informed him about her. So the Prophet said: \" Whoever is tested something from these daughters (and he/she passes the test), they will be a screen for them from the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 1984,
      "title": "Jami` at-Tirmidhi 1916",
      "narrator": "Abu Sa'eed Al-Khudri narrated that :",
      "english_text": "the Messenger of Allah said: \"Whoever has three daughters, or three sisters, or two daughters, or two sisters and he keeps good company with them and fears Allah regarding them, then Paradise is for him.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 1985,
      "title": "Jami` at-Tirmidhi 1917",
      "narrator": "Ibn 'Abbas narrated that:",
      "english_text": "the Prophet said: Whoever takes in an orphan among the Muslims to raise, to feed him and give him drink, Allah admits him into Paradise without a doubt, unless he has done a sin for which he is not forgiven.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 1986,
      "title": "Jami` at-Tirmidhi 1918",
      "narrator": "Sahl bin Sa'd narrated that:",
      "english_text": "the Messenger of Allah said: \" I and the sponsor of an orphan shall be in Paradise like these two.\"And he indicaed with his fingers, meaning his index and his middle finger",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 1987,
      "title": "Jami` at-Tirmidhi 1919",
      "narrator": "Anas bin Malik  narrated that:",
      "english_text": "\"An older man came to talk to the Prophet, and the people were hesitant to make room for him. The Prophet said: ;He is not one of us who does not have mercy on our young and does not respect our elders.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 1988,
      "title": "Jami` at-Tirmidhi 1920",
      "narrator": "Amr bin Shu'aib  narrated that his father, from his grandfather, who said that the Messenger of Allah said:",
      "english_text": "'He is not one of us who does not have mercy upon our young, nor knows the honor of our elders.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 1989,
      "title": "Jami` at-Tirmidhi 1921",
      "narrator": "Ibn Abbas narrated that the Messenger of Allah said:",
      "english_text": "\" He is not one of us who does not have mercy upon our young, respect our elders, and command good and forbid evil.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 1990,
      "title": "Jami` at-Tirmidhi 1922",
      "narrator": "Jarir bin Abdullah  narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever does not show mercy to the people, Allah will not show mercy to him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 1991,
      "title": "Jami` at-Tirmidhi 1923",
      "narrator": "Abu Hurairah narrated that Abul- Qasim said:",
      "english_text": "\"Mercy is  not removed  (from anyone) except from a wicked one.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 1992,
      "title": "Jami` at-Tirmidhi 1924",
      "narrator": "Abdullah bin 'Amr narrated that the Messenger of Allah said:",
      "english_text": "\"The merciful are shown mercy by Ar-Rahman. Be merciful on the earth, and you will be shown mercy from Who is above the heavens. The womb is named after Ar-Rahman, so whoever connects it, Allah connects him, and whoever severs it, Allah severs him.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 1993,
      "title": "Jami` at-Tirmidhi 1925",
      "narrator": "Jarir  bin 'Abdullah narrated :",
      "english_text": "\" I pledged to the Prophet to establish the Salat, give the Zakat,  and to give sincere advice to every Muslim.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 1994,
      "title": "Jami` at-Tirmidhi 1926",
      "narrator": "Abu Hurairah narrated that:",
      "english_text": "the Messenger of Allah said: \"The religion is An-Nasihah\" three times. They said: \"O Messenger of Allah! For Whom?\" He said : \"To Allah , His books, the A'immah of the Muslims, and their average people.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 1995,
      "title": "Jami` at-Tirmidhi 1927",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": ":\n\"The Muslim is the brother to the Muslim, he does not cheat him, lie to him, nor deceive him. All of the Muslim is unlawful to another Muslim: His Honor, his wealth, and his blood. At-taqwa is here. It is enough evil for a man that he belittle his brother Muslim.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 1996,
      "title": "Jami` at-Tirmidhi 1928",
      "narrator": "Abu Musa Al-Ash'arf narrated that the Messenger of Allah said:",
      "english_text": ":\nThe believer is to the believer like parts of a building, each one of them supporting the other.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 1997,
      "title": "Jami` at-Tirmidhi 1929",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": ":\n\"Indeed (each) one of you is the reflection of his brother. So if he sees something harmful in him, then let him remove it from him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 1998,
      "title": "Jami` at-Tirmidhi 1930",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": ":\n\"Whoever relieves a Muslim of a burden from the burdens of the world, Allah will relieve him of a burden from the burdens on the Day of Judgement. And whoever helps ease a difficulty in the world, Allah will grant him ease from a difficulty in the world and in the Hereafter. And whoever covers (the faults of) a Muslim, Allah will cover (his faults) for him in the world and the Hereafter. And Allah is engaged in helping the worshipper as long as the worshipper is engaged in helping his brother.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 1999,
      "title": "Jami` at-Tirmidhi 1931",
      "narrator": "Abu Ad-Darda narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever protects his brother's honor, Allah protects his face from the Fire on the Day of Resurrection.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 2000,
      "title": "Jami` at-Tirmidhi 1932",
      "narrator": "Abu Ayyub Al-Ansari narrated that the Messenger of Allah said:",
      "english_text": ":\nIt is not lawful for the Muslim to shun his brother for more than three (days); they come fare to fare and this one turns away, and that one turns away. The best of them is the one who initiates the Salam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 2001,
      "title": "Jami` at-Tirmidhi 1933",
      "narrator": "Anas said:",
      "english_text": ":\n\"When 'Abdur-Rahman bin 'Awf arrived in Al-Madinah, the Messenger of Allah established a bond of brotherhood between him and sa'd bin Ar-Rabi. So he said to him: \"Come here, I will divide my wealth and give you half, and I have two wives, I will divorce one of them, and when she completes her waiting period you may marry her.\" He said: \" May Allah bless you in your family and your wealth. Show me where the market is.\" So they showed him where the market was and he did not return that day except with some cottage cheese and cooking fat which he had earned as a profit. The Messenger of Allah saw him after that, and he had traces of yellow on him. So he said to him: \"What is this?\" He said: \"I married a woman from the Ansar.\" He said : \" What dowry did you give her?\" He said: \" A date-stone(of gold) - ( one of the narrators) Humaid said: \"Or he said: - gold equal to the weight of a date-stone.\" So he said: 'Have a banquet, even if with only a sheep.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 2002,
      "title": "Jami` at-Tirmidhi 1934",
      "narrator": "Abu Hurairah narrated that it was said:",
      "english_text": "\" O  Messenger of Allah! What is backbiting?\" He said : \" Mentioning your brother with that which he does not like.\" He said \" What if what I said about him is so?\" He said: \"If what you said about him is so, then you have backbitten him, and if it is not as you said, then you have slandered him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 2003,
      "title": "Jami` at-Tirmidhi 1935",
      "narrator": "Anas narrated that the  Messenger of Allah said:",
      "english_text": "\"Do not cut off one another, nor desert one another, nor hate one another, nor envy one another. Be you , O worshippers o Allah, brothers. It is not lawful for the Muslim to shun his brother for more than three(days).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 2004,
      "title": "Jami` at-Tirmidhi 1936",
      "narrator": "Salim narrated  from his father who said that the  Messenger of Allah said:",
      "english_text": "\"There is to be no envy except for two: A man to whom Allah grants wealth and he spends from it during the hours of the night and the hours of the day. And a man to whom Allah grants (memorization of) the Quran so he stands with it (in prayer) during the hours of the night and the hours of the day.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 2005,
      "title": "Jami` at-Tirmidhi 1937",
      "narrator": "Jabir   narrated that the  Messenger of Allah said:",
      "english_text": "\"Indeed Ash-Shaitan has despaired of getting those who perform Salat to worship him.But he is engaged in sowing hatred among them.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 2006,
      "title": "Jami` at-Tirmidhi 1938",
      "narrator": "Umm Kulthum bint 'Uqbah narrated that the  Messenger of Allah said:",
      "english_text": "\"One who brings peace between people is not a liar, he says something good, or reports something good.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 2007,
      "title": "Jami` at-Tirmidhi 1939",
      "narrator": "Asma bint Yazid  narrated that the  Messenger of Allah said:",
      "english_text": "\"it is not lawful to lie except in three cases: Something the man tells his wife to please her, to lie during war, and to lie in order to bring peace between the people.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 2008,
      "title": "Jami` at-Tirmidhi 1940",
      "narrator": "Abu Sirmah narrated that the  Messenger of Allah said:",
      "english_text": "\"Whoever causes harm, Allah harms him, and whoever is harsh, Allah will be harsh with him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 2009,
      "title": "Jami` at-Tirmidhi 1941",
      "narrator": "Abu Bakr As-Siddiq narrated that the  Messenger of Allah said:",
      "english_text": "\"Cursed are those who harm a believer, or plot to do so.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 2010,
      "title": "Jami` at-Tirmidhi 1942",
      "narrator": "Aishah narrated that the  Messenger of Allah said:",
      "english_text": "\"Jibril – may the Salawat of Allah be upon him – continued to recommend me about (treating) the neighbors so (kindly and politely), that I thought he would order me to make them heirs.”",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 2011,
      "title": "Jami` at-Tirmidhi 1943",
      "narrator": "Mujahid  narrated:",
      "english_text": "\"Abdullah bin Amr had a sheep slaughtered for his family, so when he came he said: 'Have you given some to our neighbor, the Jew? Have you given some to our neighbor, the Jew? I heard the Messenger of Allah saying: 'Jibril continued to advise me about (treating) the neighbors so (kindly and politely), that I thought he would order me (from Allah) to make them heirs.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 2012,
      "title": "Jami` at-Tirmidhi 1944",
      "narrator": "Abdullah bin Amr  narrated that the Messenger of Allah said :",
      "english_text": "\"The companion who is the best to Allah is the one who is best to his companion. And the neighbor that is the best to Allah is the one that is best to his neighbor.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 2013,
      "title": "Jami` at-Tirmidhi 1945",
      "narrator": "Abu Dharr  narrated that the Messenger of Allah said :",
      "english_text": "\"Allah has made some of your brothers as slaves under your care. So whoever has his brother under his care, then let him feed him from his food, and let him clothe him from his clothes. And do not give him a duty that he cannot bear, and if you give him a duty he cannot bear, then assist him with it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 2014,
      "title": "Jami` at-Tirmidhi 1946",
      "narrator": "Abu Bakr As-Siddiq  narrated that the Messenger of Allah said :",
      "english_text": "\"The one who treats his slaves badly will not enter paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 2015,
      "title": "Jami` at-Tirmidhi 1947",
      "narrator": "Abu Hurairah narrated that Abul-Qasim, the Prophet of Repentance, said :",
      "english_text": "\"If somebody slanders his slave (by accusing him of committing illegal sexual intercourse) and the slave is innocent from what he says, Allah will impose the punishment upon him on the Day of Resurrection, unless it is as he said about him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 2016,
      "title": "Jami` at-Tirmidhi 1948",
      "narrator": "Abu Mas'ud [Al-Ansari] said:",
      "english_text": "\"I was beating a slave of mine and I heard someone behind me saying: 'Beware O Abu Mas'ud! Beware O Abu Mas'ud!' So I turned around and saw that it was the Messenger of Allah. He said: 'Allah has more power over you than you do over him.\" Abu Mas'ud said: \"I have not beaten any slave of mine since then.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 2017,
      "title": "Jami` at-Tirmidhi 1949",
      "narrator": "'Abdullah bin 'Umar narrated:",
      "english_text": "\"A man came to the Prophet and said: 'O Messenger of Allah! How many times should the servant be pardoned?' The Prophet was silent. Then he said: 'O Messenger of Allah! How many times should the servant be pardoned?' He said: ' Seventy times each day.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 2018,
      "title": "Jami` at-Tirmidhi 1950",
      "narrator": "Abu Sa'eed Al-Khudri  narrated that the Messenger of Allah said :",
      "english_text": "\"When one of you beats his servant then he (should) remember Allah and, withhold your hands.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 2019,
      "title": "Jami` at-Tirmidhi 1951",
      "narrator": "Jabir bin Sumurah narrated that the Messenger of Allah said :",
      "english_text": "\"That a man should discipline his son is better for him than to have given a Sa' in charity.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 2020,
      "title": "Jami` at-Tirmidhi 1952",
      "narrator": "Ayyub bin Musa narrated from his father, from his grandfather, that the Messenger of Allah said :",
      "english_text": "\"There is no gift that a father gives his son more virtuous than good manners.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 2021,
      "title": "Jami` at-Tirmidhi 1953",
      "narrator": "Aishah narrated:",
      "english_text": "\"The Prophet would accept gifts and he would give something in return.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 2022,
      "title": "Jami` at-Tirmidhi 1954",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said :",
      "english_text": "\"Whoever is not grateful to the people, he is not grateful to Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 2023,
      "title": "Jami` at-Tirmidhi 1955",
      "narrator": "Abu Sa'eed narrated that the Messenger of Allah said :",
      "english_text": "\"Whoever is not grateful to the people, he is not grateful to Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 2024,
      "title": "Jami` at-Tirmidhi 1956",
      "narrator": "Abu Dharr narrated that the Messenger of Allah said :",
      "english_text": "\"Your smiling in the face of your brother is charity, commanding good and forbidding evil is charity, your giving directions to a man lost in the land is charity for you. Your seeing for a man with bad sight is a charity for you, your removal of a rock, a thorn  or a bone from the road is charity for you. Your pouring what remains from your bucket into the bucket of your brother is charity for you.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 2025,
      "title": "Jami` at-Tirmidhi 1957",
      "narrator": "Al-Bara bin Azib narrated that the Messenger of Allah said :",
      "english_text": "\"Whoever gives someone some milk or silver, or guides him through a strait, then he will have the reward similar to freeing a slave.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 2026,
      "title": "Jami` at-Tirmidhi 1958",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said :",
      "english_text": "\"When a man was walking on the road, he found a thorny branch and removed it. Allah appreciated his action by forgiving him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 2027,
      "title": "Jami` at-Tirmidhi 1959",
      "narrator": "Jabir bin Abdullah narrated that the Messenger of Allah said :",
      "english_text": "\"When a man narrates a narration, then he looks around, then it is a trust.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 2028,
      "title": "Jami` at-Tirmidhi 1960",
      "narrator": "Asma bint Abi Bakr  said:",
      "english_text": "\" O the Messenger of Allah! I have nothing except what was given to me by (my husband) Az-Zubair, shall I give it (in charity)?'\" It was said: \"Do not hold (your wealth) so that Allah will hold against you.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 2029,
      "title": "Jami` at-Tirmidhi 1961",
      "narrator": "Abu  Hurairah  narrated that the Prophet said:",
      "english_text": "\"Generosity is close to Allah, close to Paradise, close to the people and far from the Fire. Stinginess is far from Allah, far from Paradise, far from the people and close to the Fire. The ignorant generous person, is more beloved to Allah than the worshiping stingy person.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 2030,
      "title": "Jami` at-Tirmidhi 1962",
      "narrator": "Abu  Sa'eed Al-Khudri narrated that the Messenger of Allah said:",
      "english_text": "\"Two traits are not combined  in a believer: Stinginess and bad manners.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 2031,
      "title": "Jami` at-Tirmidhi 1963",
      "narrator": "-Abu  Bakr As-Siddiq narrated that the Messenger of Allah said:",
      "english_text": "\"The swindler, the stingy person, and the Mannan shall not enter Paradise.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 2032,
      "title": "Jami` at-Tirmidhi 1964",
      "narrator": "Abu  Hurairah  narrated that the Messenger of Allah said:",
      "english_text": "\"The believer is naively noble and the stingy person is deceitfully treacherous.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 2033,
      "title": "Jami` at-Tirmidhi 1965",
      "narrator": "Abu  Mas'ud Al-Ansari narrated that the Messenger of Allah said:",
      "english_text": "\"A man's spending on his family is charity.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 2034,
      "title": "Jami` at-Tirmidhi 1966",
      "narrator": "Thawban narrated that the Messenger of Allah said:",
      "english_text": "\"The most virtuous of the Dinar is the Dinar spent by a man on his dependants, and the Dinar spent by a man on his beast in the Cause of Allah, and the Dinar spent by a man on his companions in the Cause of Allah.\" Abu Qilabah (one of the narrators) said: \" He began with the dependants.\" Then he said: \"And which man is greater in reward than a man who spends upon his depandants, having little ones by which Allah causes him to abstain (from the unlawful) and by which Allah enriches him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 2035,
      "title": "Jami` at-Tirmidhi 1967",
      "narrator": "Abu  Shuraih Al-'Adawf said:",
      "english_text": "\"My eyes saw the Messenger of Allah, and my ears  heard him speaking when he was speaking and he said: 'Whoever believes in Allah and the Last Day, then let him honor his guest with his reward.' They said: 'What is the reward?' He said: ' A day and a night.' He said: 'And hospitality is for three days, whatever is beyond that is charity. And whoever believes in Allah and the Last Day, then let him say what is good or keep silent.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 2036,
      "title": "Jami` at-Tirmidhi 1968",
      "narrator": "Abu  Shuraih Al-Kabi narrated that the Messenger of Allah said:",
      "english_text": ":\n\"Hospitality is for three days, and his reward is a day and a night, and whatever is spent on him after that is charity. And it is not lawful for him (the guest) to stay so long as to cause him harm.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 2037,
      "title": "Jami` at-Tirmidhi 1969",
      "narrator": "Safwan bin Sulaim narrated that the Prophet said:",
      "english_text": "\"The one who looks after a widow and a poor person is like the Mujahid in the cause of Allah, or like the one who fasts all the day and stands (in prayer) all the night.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 2038,
      "title": "Jami` at-Tirmidhi 1970",
      "narrator": "Jabir bin Abdullah narrated that the Messenger of Allah said:",
      "english_text": "\"Every good is charity. Indeed among the good is to meet your brother with a smiling face, and to pour what is left in your bucket into the vessel of your brother.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 2039,
      "title": "Jami` at-Tirmidhi 1971",
      "narrator": "Abdullah bin Mas'ud narrated that the Messenger of Allah said:",
      "english_text": "\"Abide by truthfulness. For indeed truthfulness leads to righteousness. And indeed righteousness leads to Paradise. A man continues telling the truth and trying hard to tell the truth until he is recorded with Allah as a truthful person. Refrain from falsehood. For indeed falsehood leads to wickedness, and wickedness leads to the Fire. A slave (of Allah) continues lying and trying hard to lie, until he is recorded with Allah as a liar.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 2040,
      "title": "Jami` at-Tirmidhi 1972",
      "narrator": "Ibn 'Umar narrated that the Messenger of Allah said:",
      "english_text": "\"When the slave (of Allah) lies, the angel goes a mile away from him because of the stench of what he has done.\"Yahya said: \"(I asked) 'Abdur-Rahim bin Harun if he approved of it,and he said 'Yes'.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 2041,
      "title": "Jami` at-Tirmidhi 1973",
      "narrator": "Aishah  narrated:",
      "english_text": "\"There was no behavior more hated to the Messenger of Allah than lying. A man would lie in narrating something in the presence of the Prophet, and he would not be content until he knew that he had repented.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 2042,
      "title": "Jami` at-Tirmidhi 1974",
      "narrator": "Anas narrated that the Messenger of Allah said:",
      "english_text": "\"Al-Fuhsh is not present in anything but it mars it, and Al-Haya' is not present in anything but it beautifies it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 2043,
      "title": "Jami` at-Tirmidhi 1975",
      "narrator": "'Abdullah bin 'Amr said; \"The Messenger of Allah said:",
      "english_text": "\"The best of you are those best in conduct.' And the Prophet was not one who was obscene, nor one who uttered obscenities.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 2044,
      "title": "Jami` at-Tirmidhi 1976",
      "narrator": "'Samurah bin Jundab narrated that the Messenger of Allah said:",
      "english_text": "\"Do not curse yourselves with Allah's curse, nor with His anger, nor with the Fire.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 2045,
      "title": "Jami` at-Tirmidhi 1977",
      "narrator": "'Abdullah narrated that the Messenger of Allah said:",
      "english_text": "\"The believer does not insult the honor of others, nor curse, nor commit Fahishah, nor is he foul.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 2046,
      "title": "Jami` at-Tirmidhi 1978",
      "narrator": "'Ibn 'Abbas narrated that a man cursed the wind in the presence of the Prophet, so he said:",
      "english_text": "\"Do not curse the wind, for it is merely doing as ordered , and whoever curses something undeservingly, then the curse returns upon him.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 2047,
      "title": "Jami` at-Tirmidhi 1979",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"Learn enough about your lineage to facilitate keeping your ties of kinship. For indeed keeping the ties of kinship encourages affection among the relatives, increases the wealth, and increases the lifespan.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 2048,
      "title": "Jami` at-Tirmidhi 1980",
      "narrator": "'Abudullah bin 'Amr narrated that the Messenger of Allah said:",
      "english_text": "\"No supplication is more readily responded to, than the supplication made for someone who is absent.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 2049,
      "title": "Jami` at-Tirmidhi 1981",
      "narrator": "'Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"(The burden of) what is said by the two who vilify each other is upon the one who initiated it, as long as the one who was wronged does not transgress.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 2050,
      "title": "Jami` at-Tirmidhi 1982",
      "narrator": "' Al-Mughirah bin Shu'bah narrated that the Messenger of Allah said:",
      "english_text": "\"Do not vilify the dead (and) by that harm the living.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 2051,
      "title": "Jami` at-Tirmidhi 1983",
      "narrator": "'Abdullah bin Mas'ud narrated that the Messenger of Allah said:",
      "english_text": "\"Verbally abusing the Muslim is disobedience and fighting him is disbelief.\" Zubaid said:\"I said to Abu Wa'il: 'Did you hear it from 'Abdullah?' He said: 'Yes.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 2052,
      "title": "Jami` at-Tirmidhi 1984",
      "narrator": "'Ali narrated that the Messenger of Allah said:",
      "english_text": "\"Indeed in Paradise there are chambers, whose outside can be seen from their inside, and their inside can be seen from their outside.\" A Bedouin stood and said : 'Who are they for, O Messenger of Allah?\" He said: \"For those who speak well, feed others, fast regularly, and perform salat [for Allah] during the night while the people sleep.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 2053,
      "title": "Jami` at-Tirmidhi 1985",
      "narrator": "'Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"How wonderful it is for one of them that he obeys Allah and fulfills the rights of his master.\" Meaning the slave. And Ka'b said: \"Allah and His Messenger spoke the truth.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 2054,
      "title": "Jami` at-Tirmidhi 1986",
      "narrator": "Ibn 'Umar narrated that the Messenger of Allah said:",
      "english_text": "\"There shall be upon dunes of musk- I think he said: On the Day of Judgment- a slave who fulfills Allah's right and the right of his patron (master), a man who leads a people (in prayer)) and they are pleased with him. And a man who calls for the five prayers during every day and night.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 2055,
      "title": "Jami` at-Tirmidhi 1987",
      "narrator": "Abu Dharr said:",
      "english_text": "\"The Messenger of Allah said to me:\n'Have Taqwa of Allah wherever you are, and follow an evil deed with a good one to wipe it out, and treat the people with good behavior.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 2056,
      "title": "Jami` at-Tirmidhi 1988",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"Beware of Zann (suspicion), for indeed Zann is the falsest of speech.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 2057,
      "title": "Jami` at-Tirmidhi 1989",
      "narrator": "Anas narrated:",
      "english_text": "\"\nThe Messenger of Allah used to mingle with us such that he said to my younger brother: 'O Abu 'Umair! What did the Nughair do?'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 2058,
      "title": "Jami` at-Tirmidhi 1990",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"They said: 'O Messenger of Allah! You joke with us?' He said: 'Indeed I do not say except what is true.'\" (Hasan)'",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 2059,
      "title": "Jami` at-Tirmidhi 1991",
      "narrator": "Anas narrated:",
      "english_text": "\"A man sought a mount from the Messenger of Allah who said: 'Indeed, I will let you ride on a she-camel's child.' So he said: 'O Messenger of Allah! What can ashe-camel's child do?' So the Messenger of Allah said: 'Are camels borne from other than she-camels?'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 2060,
      "title": "Jami` at-Tirmidhi 1992",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah said:",
      "english_text": "\"O possessor of two ears!\" Mahmud said: \"Abu Usamah said: 'He only meant it as a joke.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 2061,
      "title": "Jami` at-Tirmidhi 1993",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever avoids lying while he is doing so falsely, a house will be built for him on the skirts of Paradise. Whoever avoids arguing while he is in the right, a house will be built for him in its midst. And whoever has good character, a house will be built for him in its heights.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 2062,
      "title": "Jami` at-Tirmidhi 1994",
      "narrator": "Ibn Abbas narrated that the Messenger of Allah said:",
      "english_text": "\"It is enough sin for you that you never stop disputing.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 2063,
      "title": "Jami` at-Tirmidhi 1995",
      "narrator": "Ibn Abbas narrated that the Messenger of Allah said:",
      "english_text": "\"Do not argue with your brother, do not joke with him, and do not make a promise, only to not fulfill it.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 2064,
      "title": "Jami` at-Tirmidhi 1996",
      "narrator": "Aisha narrated:",
      "english_text": "\"A man sought permission to enter upon the Messenger of Allah while I was with him, so he said:\n'What an evil son of his tribe, or brother of his tribe.' Then he admitted him and spoke with him. When he left, I said: 'O Messenger of Allah! You said what you said about him. Then you talked politely with him?' He said: 'O 'Aishah! Indeed among the evilest of people are those whom the people avoid, or who the people leave, fearing his filthy speech.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 2065,
      "title": "Jami` at-Tirmidhi 1997",
      "narrator": "Muhammad bin Sirin narrated from Abu Hurairah - and I think he (narrated it from the Prophet) who said:",
      "english_text": "\"Love your beloved moderately, perhaps he becomes hated to you someday. And hate whom you hate moderately, perhaps he becomes your beloved someday.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 2066,
      "title": "Jami` at-Tirmidhi 1998",
      "narrator": "Abdullah narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever has a mustard seed's weight of pride (arrogance) in his heart, shall not be admitted into Paradise. And whoever has a mustard seed's weight of faith in his heart, shall not be admitted into the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 2067,
      "title": "Jami` at-Tirmidhi 1999",
      "narrator": "Abdullah narrated:",
      "english_text": "\"The Messenger of Allah said:\n'Whoever has a speck of pride (arrogance) in his heart, shall not be admitted into Paradise. And whoever has a speck of faith in his heart, shall not be admitted in to the Fire.'\" He said: \"So a man said to him: 'I like for my clothes to be nice, and my sandals to be nice?' So he said: 'Indeed Allah loves beauty. But pride is refusing the truth and belittling the people.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 2068,
      "title": "Jami` at-Tirmidhi 2000",
      "narrator": "Iylas bin Salamah bin Al-Akwa' narrated from his father that the Messenger of Allah said:",
      "english_text": "\"A man shall remain exalting himself until he is written among the tyrants, so that he suffers from their afflictions.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 2069,
      "title": "Jami` at-Tirmidhi 2001",
      "narrator": "Jubair bin Mut'im narrated from his father who said:",
      "english_text": "\"They (meaning the people in general) told me that I was proud, while I rode a donkey, wore a cloak, and I milked the sheep. And the Messenger of Allah said to me:\n\"Whoever does these, then there is no pride (arrogance) in him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 2070,
      "title": "Jami` at-Tirmidhi 2002",
      "narrator": "Abu Ad-Dardh narrated that the Messenger of Allah said:",
      "english_text": "\"Nothing is heavier on the believer's Scale on the Day of Judgment than good character. For indeed Allah, Most High, is angered by the shameless obscene person.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 2071,
      "title": "Jami` at-Tirmidhi 2003",
      "narrator": "Abu Ad-Dardh narrated that the Messenger of Allah said:",
      "english_text": "\"Nothing is placed on the Scale that is heavier than good character. Indeed the person with good character will have attained the rank of the person of fasting and prayer.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 2072,
      "title": "Jami` at-Tirmidhi 2004",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah was asked about that for which people are admitted into Paradise the most, so he said:",
      "english_text": "\"Taqwa of Allah, and good character.\" And  he was asked about that for which people are admitted into the Fire the most, and he said: \" The mouth and the private parts.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 2073,
      "title": "Jami` at-Tirmidhi 2005",
      "narrator": "Abu Wahb narrated that  :",
      "english_text": "'Abdullah bin Al-Mubarak explained good character, and then he said: \"It is a smiling face, doing one's best in good, and refraining from harm.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 2074,
      "title": "Jami` at-Tirmidhi 2006",
      "narrator": "Abu Al-Ahwas narrated from his father who said:",
      "english_text": "\"I said: 'O Messenger of Allah! I stayed with a man who did not entertain me nor behave hospitably with me. Then he came to stay with me, shall I reciprocate the same to him?' He (ﷺ said: 'No, entertain him.\" He said: 'He (ﷺ saw me wearing tattered clothes and said:'(Do you have any wealth?' I said: 'Allah has given me various kinds of wealth through camels and goats.' He said: 'Then let it be seen on you.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 2075,
      "title": "Jami` at-Tirmidhi 2007",
      "narrator": "Hudhaifah narrated that the Messenger of Allah said:",
      "english_text": "“Do not be a people without a will of your own, saying: 'If people treat us well, we will treat them well; and if they do wrong, we will do wrong,' but accustom yourselves to do good if people do good, and do not behave unjustly if they do evil.”",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 2076,
      "title": "Jami` at-Tirmidhi 2008",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever visits the sick, or visits his brother in Allah (faith), a caller calls out: 'May you have goodness and livelihood be good, and may you dwell in an adobe in Paradise.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 2077,
      "title": "Jami` at-Tirmidhi 2009",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"Al-Haya is from faith, and faith is in Paradise. Obscenity is from rudeness, and rudeness is in the Fire.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 2078,
      "title": "Jami` at-Tirmidhi 2010",
      "narrator": "Abdullah bin Sarjis Al-Muzam narrated that the Messenger of Allah said:",
      "english_text": "\"Taking the good route is a part of the twenty-four parts of Prophethood.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 2079,
      "title": "Jami` at-Tirmidhi 2011",
      "narrator": "Ibn 'Abbas narrated that the Messenger of Allah said to the Ashajj 'Abdul-Qais:",
      "english_text": "\"Indeed there are two traits in you that Allah loves: Forbearance, and deliberateness.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 2080,
      "title": "Jami` at-Tirmidhi 2012",
      "narrator": "Abdullah-Muhaimin bin 'Abbas bin Sahl bin Sa'd As-Saidi narrated from his father, from his grandfather, who said that the Messenger of Allah said:",
      "english_text": "\"Deliberateness is from Allah, and haste is from the Ash-shaitan.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 2081,
      "title": "Jami` at-Tirmidhi 2013",
      "narrator": "Abu Ad-Darda narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever was given his share of gentleness, then he has been given a share of good. And whoever has been prevented from his share of gentleness, then he has been prevented from his share of good.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 2082,
      "title": "Jami` at-Tirmidhi 2014",
      "narrator": "Ibn 'Abbas narrated:",
      "english_text": "\"The Messenger of Allah sent Mu'adh [bin Jabal] to Yemen, and said:\n'Beware of the supplication of the oppressed; for indeed there is no barrier between it and Allah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 2083,
      "title": "Jami` at-Tirmidhi 2015",
      "narrator": "Anas narrated:",
      "english_text": "that\n\"I served the Prophet for ten years. He never said Uff and never blamed me by saying: 'Why did you do so' or why did you not do so?' And the Messenger Of Allah had the best character among all of the people. I never touched Khazz nor silk, nor anything softer than the hand of the Messenger of Allah, nor have I smelled musk, or a fragrance sweeter than the sweat of the Messenger of Allah",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 2084,
      "title": "Jami` at-Tirmidhi 2016",
      "narrator": "Abu Abdullah Al-Jadali narrated:",
      "english_text": "\"I asked 'Aishah about the character of the Messenger of Allah. She said: 'He was not obscene, nor uttering obscenities, nor screaming in the markets, he would not return an evil with an evil, but rather he was pardoning and forgiving.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 2085,
      "title": "Jami` at-Tirmidhi 2017",
      "narrator": "Aishah narrated:",
      "english_text": "\"I was not jealous of any wife of the Prophet as I was jealous of Khadijah, and it was not because I saw her. It was only because the Messenger of Allah mentioned her so much, and because whenever he would slaughter a sheep, he would look for Khadijah's friends to gift them some of it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 2086,
      "title": "Jami` at-Tirmidhi 2018",
      "narrator": "Jabir narrated that the Messenger of Allah said:",
      "english_text": "\"Indeed the most beloved among you to me, and the nearest to sit with me on the Day of Judgment is the best of you in character. And indeed, the most disliked among you to me, and the one sitting furthest from me on the Day of Judgement are the Thartharun, and the Mutashaddiqun and the Muthafaihiqun.\" They said: \"O Messenger of Allah! We know about the Thartharun, and the Mutashaddiqun, but what about the Muthafaihiqun?\"' He said:\"The arrogant.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 2087,
      "title": "Jami` at-Tirmidhi 2019",
      "narrator": "Ibn 'Umar narrated that the Messenger of Allah said:",
      "english_text": "\"The believer is not one who curses others.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 2088,
      "title": "Jami` at-Tirmidhi 2020",
      "narrator": "Abu Hurairah narrated that a man came to the Messenger of Allah and said:",
      "english_text": "\"Teach me something that is not too much for me so that, perhaps, I may abide by it.\" He (S.A.W) said: \"Do not get angry.\" He repeated that (the request) a number of times, each time he replied: 'Do not get angry.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 2089,
      "title": "Jami` at-Tirmidhi 2021",
      "narrator": "Sahl bim Mu'adh bin Anas Al-Juhani narrated that the Messenger of Allah said:",
      "english_text": "\"Whoever suppresses his rage while he is able to unleash it, Allah will call him before the heads (leaders) of creation on the Day of Judgement, so that he can inform Him of which of the Hur he would like.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 2090,
      "title": "Jami` at-Tirmidhi 2022",
      "narrator": "Anas bin Malik narrated that the Messenger of Allah said:",
      "english_text": "\"No young person honors an elder due to his age, except that Allah appoints for him one who will honor him at that age.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 2091,
      "title": "Jami` at-Tirmidhi 2023",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.A.W) said:",
      "english_text": "\"The gates of Paradise are opened on Monday and Thursday. In them, (will enter) whoever has not associated anything with Allah will be forgiven, except for the two who shun each other, (about whom) it is said: 'Return these two until they make amends.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 2092,
      "title": "Jami` at-Tirmidhi 2024",
      "narrator": "Abu Sa'eed narrated:",
      "english_text": "\"Some persons from the Ansar asked for (something) from the Messenger of Allah (s.a.w) and he gave them. They again asked him for (something), and he gave them. Then he said: 'whatever of good that I have, I would never hoard it from any of you. (Remember) whoever abstains from asking others, Allah will make him content, and whoever tries to make due, Allah will suffice him. And whoever remains patient, Allah will make him patient. Nobody can be given a blessing better and more encompassing than patience.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 2093,
      "title": "Jami` at-Tirmidhi 2025",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Indeed among the worst of people to Allah, on the Day of Judgment, is the two faced person.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 2094,
      "title": "Jami` at-Tirmidhi 2026",
      "narrator": "Hammam bin Al-Harith said:",
      "english_text": "\"Aman passed by Hudhaifah bin Al-Yaman and it was said to him: \"This person conveys news about the people to the leaders.' So Hudaifah said: 'The Messenger of Allah said: 'The Qatat shall not enter paradise.'\" (Sahih)Sufyan said: \"The Qatat is the Nammam.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 2095,
      "title": "Jami` at-Tirmidhi 2027",
      "narrator": "Abu Umamah narrated that the Messenger of Allah (s.A.W) said:",
      "english_text": "\"Al-Haya' and Al-'Iy are two branches of faith, and Al-Badha and Al-Bayan are two branches of Hypocrisy.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 2096,
      "title": "Jami` at-Tirmidhi 2028",
      "narrator": "Ibn 'Umar narrated that two men arrived during the time of the Messenger of Allah delivering an address. The people were amazed by their speech, so the Messenger of Allah turned to us and said:",
      "english_text": "\"Indeed there is magic in eloquence'-or- 'Indeed some eloquence is magic.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 2097,
      "title": "Jami` at-Tirmidhi 2029",
      "narrator": "Abu Hurairah narrated that the Messenger of Allah said:",
      "english_text": "\"Charity does not diminish wealth, Allah does not increase a man in anything for his pardoning (others) but in honor, and none humbles himself for Allah but Allah raises him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 2098,
      "title": "Jami` at-Tirmidhi 2030",
      "narrator": "Ibn 'Umar narrated that Prophet said:",
      "english_text": "\"Oppression shall be darkness on the Day of Judgment.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 2099,
      "title": "Jami` at-Tirmidhi 2031",
      "narrator": "Abu Hurairah narrated:",
      "english_text": "\"The Messenger of Allah (s.a.w) never criticized any food. if he liked it, he would eat it, and if not, he would leave it.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 2100,
      "title": "Jami` at-Tirmidhi 2032",
      "narrator": "Nafi' narrated that Ibn ‘Umar said:",
      "english_text": "“The Messenger of Allah (s.a.w) ascended the Minbar and called out with a raised voice: ’O you who accepted Islam with his tongue, while faith has not reached his heart! Do not harm the Muslims, nor revile them, nor spy on them to expose their secrets. For indeed whoever tries to expose his Muslims brother’s secrets, Allah exposes his secrets wide open, even if he were in the depth of his house.’” He (Nafl’) said: ‘ One day Ibn ‘Umar looked at the House- or – the Ka’bah and said: ‘What is it that is more honored than you, and whose honor is more sacred than yours! And the believer’s honor is more sacred to Allah than yours.’”",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 2101,
      "title": "Jami` at-Tirmidhi 2033",
      "narrator": "Abu Sa'eed narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"There is no forbearance except for the one who stumbled, and there is no wisdom except for the one who has experience.\" (Dai'f)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 2102,
      "title": "Jami` at-Tirmidhi 2034",
      "narrator": "Jabir narrated that the Prophet (s.a.w) said:",
      "english_text": "\"Whoever is given a gift, then if he finds something let him reciprocate. If he has nothing, then let him mention some praise. For whoever has mentioned some praise, then he has expressed his gratitude. And whoever refrains (from doing so) then he has committed Kufr. And whoever pretends to be satisfied by that which he was not given, he is like the one who wears a garment of falsehood.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 2103,
      "title": "Jami` at-Tirmidhi 2035",
      "narrator": "Usamah bin Zaid narrated that the Messenger of Allah (s.a.w) said:",
      "english_text": "\"Whoever some good was done to him, and he says: 'May Allah reward you in goodness' then he has done the most that he can of praise.\"",
      "grade": "Hasan (Darussalam)"
    }
  ]
}