{
  "chapterNum": 37,
  "english_title": "The Book of Fighting [The Prohibition of Bloodshed]",
  "totalHadiths_inChapter": 167,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 3893,
      "title": "Sunan an-Nasa'i 3966",
      "narrator": "It was narrated from Anas bin Malik that:",
      "english_text": "The Prophet [SAW] said: \"I have been commanded to fight the idolators until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is His slave and Messenger. If they bear witness to La ilaha illallah and that Muhammad is His slave and Messenger, and they pray as we pray and face our Qiblah, and eat our slaughtered animals, then their blood and wealth becomes forbidden to us except for a right that is due.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 3894,
      "title": "Sunan an-Nasa'i 3967",
      "narrator": "It was narrated from Anas bin Malik that :",
      "english_text": "The Messenger of Allah [SAW] said: \"I have been commanded to fight the idolators until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is the Messenger of Allah [SAW]. If they bear witness to La ilaha illallah and that Muhammad is the Messenger of Allah [SAW], and they face our Qiblah, eat our slaughtered animals, and pray as we do, then their blood and wealth become forbidden except for a right that is due, and they will have the same rights and obligations as the Muslims.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 3895,
      "title": "Sunan an-Nasa'i 3968",
      "narrator": "Maimun bin Siyah asked Anas bin Malik:",
      "english_text": "\"O Abu Hamzah, what makes the blood and wealth of a Muslim forbidden?\" He said: \"Whoever bears witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is the Messenger of Allah [SAW], faces our Qiblah, prays as we pray, and eats our slaughtered animals, he is a Muslim, and has the same rights and obligations as the Muslims.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 3896,
      "title": "Sunan an-Nasa'i 3969",
      "narrator": "It was narrated that Anas bin Malik said:",
      "english_text": "\"When the Messenger of Allah [SAW] died, the 'Arabs apostatized, so 'Umar said: 'O Abu Bakr, how can you fight the 'Arabs?' Abu Bakr said: 'The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah, and they establish Salah and pay Zakah.\" By Allah, if they withhold from me a young goat that they used to give to the Messenger of Allah [SAW], I will fight them for it.' 'Umar said: 'By Allah, as soon as I realized how certain Abu Bakr was, I knew that it was the truth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 3897,
      "title": "Sunan an-Nasa'i 3970",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"When the Messenger of Allah [SAW] died and Abu Bakr became the Khalifah after him, and some of the 'Arabs reverted to Kufr, 'Umar said to Abu Bakr: 'How can you fight the people when the Messenger of Allah [SAW] said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship but Allah). Whoever says La ilaha illallah, his wealth and his life are safe from me except for a right that is due, and his reckoning will be with Allah.?' Abu Bakr said: 'By Allah, I will fight whoever separates Salah and Zakah, for Zakah is the compulsory right to be taken from wealth. By Allah, if they withhold from me a rope that they used to give to the Messenger of Allah [SAW], I will fight them for withholding it.' 'Umar, may Allah be pleased with him, said: 'By Allah, as soon as I realized that Allah has expanded the chest of Abu Bakr for fighting, I knew that it was the truth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 3898,
      "title": "Sunan an-Nasa'i 3971",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they say La ilaha illallah. If they say it then their blood and their wealth are safe from me, except for a right that is due, and their reckoning will be with Allah.' When the people apostatized, 'Umar said to Abu Bakr: 'Will you fight them when you heard the Messenger of Allah [SAW] say such and such?' He said: 'By Allah, I do not separate Salah and Zakah, and I will fight whoever separates them.' So we fought alongside him, and we realized that that was the right thing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 3899,
      "title": "Sunan an-Nasa'i 3972",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship but Allah). Whoever says La ilaha illallah, his wealth and his life are safe from me except for a right that is due, and his reckoning will be with Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 3900,
      "title": "Sunan an-Nasa'i 3973",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"When the Messenger of Allah [SAW] died, and Abu Bakr (became Khalifah) after him, and the 'Arabs reverted to Kufr, 'Umar said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah [SAW] said: I have been commanded to fight the people until they say La ilaha illallah, and whoever says La ilaha illallah, his wealth and his life are safe from me, except for a right that is due, and his reckoning will be with Allah, the Mighty and Sublime?' Abu Bakr said: 'I will fight whoever separates Salah and Zakah, for Zakah is the compulsory right to be taken from wealth. By Allah, if they withhold from me a young goat that they used to give to the Messenger of Allah [SAW], I will fight them for withholding it.' 'Umar said: 'By Allah, as soon as I saw that Allah has expanded the chest of Abu Bakr to fighting, I knew that it was the truth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 3901,
      "title": "Sunan an-Nasa'i 3974",
      "narrator": "Abu Hurairah narrated that :",
      "english_text": "The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they say La ilaha illallah, and whoever says it, his life and his wealth are safe from me, except for a right that is due, and his reckoning will be with Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 3902,
      "title": "Sunan an-Nasa'i 3975",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"So Abu Bakr decided to fight them, then 'Umar said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they say La ilaha illallah, and if they say it, their blood and their wealth will be safe from me except for a right that is due.?' Abu Bakr said: 'I will fight whoever separates prayer and Zakah. By Allah, if they withhold from me a young goat that they used to give to the Messenger of Allah [SAW], I will fight them for withholding it.' 'Umar said: 'By Allah, as soon as I realized that Allah has expanded the chest of Abu Bakr to fight them, I knew that it was the truth.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 3903,
      "title": "Sunan an-Nasa'i 3976",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and wealth are prohibited for me, except for a right that is due, and their reckoning will be with Allah, the Mighty and Sublime.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 3904,
      "title": "Sunan an-Nasa'i 3977",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and wealth are prohibited for me, except for a right that is due, and their reckoning will be with Allah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 3905,
      "title": "Sunan an-Nasa'i 3978",
      "narrator": "It was narrated from Abu Hurairah that :",
      "english_text": "The Messenger of Allah [SAW] said: \"We will fight the people until they say La ilaha illallah. If they say La ilaha illallah then their blood and their wealth become forbidden to us, except for a right that is due, and their reckoning will be with Allah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 3906,
      "title": "Sunan an-Nasa'i 3979",
      "narrator": "It was narrated that An-Nu'man bin Bashir said:",
      "english_text": "\"We were with the Messenger of Allah [SAW] and a man came and whispered to him. He said: 'Kill him.' Then he said: 'Does he bear witness to La ilaha illallah (there is none worthy of worship except Allah)?' He said: 'Yes, but he is only saying it to protect himself.' The Messenger of Allah [SAW] said: 'Do not kill him, for I have been commanded to fight the people until they say La ilaha illallah, and if they say it, their blood and their wealth are safe from me, except for a right that is due, and their reckoning will be with Allah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 3907,
      "title": "Sunan an-Nasa'i 3980",
      "narrator": "It was narrated from An-Nu'man bin Salim that:",
      "english_text": "A man said to him: \"The Messenger of Allah [SAW] came to us while we were in a tent inside the Masjid of Al-Al-Madinah, and he said to us: 'It has been revealed to me that I should fight the people until they say La ilaha illallah.'\" A similar narration.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 3908,
      "title": "Sunan an-Nasa'i 3981",
      "narrator": "It was narrated that An-Nu'man bin Salim said:",
      "english_text": "\"I heard Aws say: 'The Messenger of Allah [SAW] came to us when we were in a tent.'\" And he quoted the same Hadith.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 3909,
      "title": "Sunan an-Nasa'i 3982",
      "narrator": "It was narrated that An-Nu'man bin Salim said:",
      "english_text": "\"I heard Aws say: 'I came to the Messenger of Allah [SAW] among the delegation of Thaqif and I was with him in a tent. Everyone in the tent had gone to sleep except him and I. A man came and whispered to him, and he said: Go and kill him. Then he said: Does he not bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah? He said: He does bear witness to that. The Messenger of Allah [SAW] said: Leave him alone. Then he said: I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and their wealth become forbidden to me, except for a right that is due. (One of the narrators) Muhammad said: I said to Shu'bah: 'Doesn't the Hadith contain: Does he not testify to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah?' He said: 'I think it is both, but I do not know.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 3910,
      "title": "Sunan an-Nasa'i 3983",
      "narrator": "It was narrated from An-Nu'man bin Salim that:",
      "english_text": "'Amr bin Aws told him that his father Aws said: \"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah), then their blood and their wealth become forbidden to me, except for a right that is due.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 3911,
      "title": "Sunan an-Nasa'i 3984",
      "narrator": "It was narrated that Abu Idris said:",
      "english_text": "\"I heard Mu'awiyah delivering the Khutbah, and he narrated a few Hadiths from the Messenger of Allah [SAW].\" He said: \"I heard him delivering a Khutbah and he said: 'I heard the Messenger of Allah [SAW] say: Every sin may be forgiven by Allah except a man who kills a believer deliberately, or a man who dies as a disbeliever.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 3912,
      "title": "Sunan an-Nasa'i 3985",
      "narrator": "It was narrated from 'Abdullah that:",
      "english_text": "The Prophet [SAW] said: \"No person is killed wrongfully, but a share of responsibility for his blood will be upon the first son of Adam, because he was the first one to set the precedence, of killing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 3913,
      "title": "Sunan an-Nasa'i 3986",
      "narrator": "It was narrated that 'Abdullah bin 'Amr bin Al-'As said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'By the One in Whose Hand is my soul, killing a believer is more grievous before Allah than the extinction of the whole world.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 3914,
      "title": "Sunan an-Nasa'i 3987",
      "narrator": "It was narrated from 'Abdullah bin 'Amr that:",
      "english_text": "The Prophet [SAW] said: \"The extinction of the whole world is less significant before Allah than killing a Muslim man.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 3915,
      "title": "Sunan an-Nasa'i 3988",
      "narrator": "It was narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"Killing a believer is more grievous before Allah than the extinction of the whole world.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 3916,
      "title": "Sunan an-Nasa'i 3989",
      "narrator": "It was narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"Killing a believer is more grievous before Allah than the extinction of the whole world.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 3917,
      "title": "Sunan an-Nasa'i 3990",
      "narrator": "It was narrated from 'Abdullah bin Buraidah that his father said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Killing a believer is more grievous before Allah than the extinction of the whole world.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 3918,
      "title": "Sunan an-Nasa'i 3991",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'The first thing concerning which a person will be brought to account will be the Salah, and the first thing concerning which scores will be settled among the people, will be bloodshed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 3919,
      "title": "Sunan an-Nasa'i 3992",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'The first matter concerning which judgment will be passed among the people will be bloodshed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 3920,
      "title": "Sunan an-Nasa'i 3993",
      "narrator": "It was narrated from 'Abdullah that:",
      "english_text": "The Messenger of Allah [SAW] said: \"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 3921,
      "title": "Sunan an-Nasa'i 3994",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 3922,
      "title": "Sunan an-Nasa'i 3995",
      "narrator": "It was narrated that 'Amr bin Shurahbil said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 3923,
      "title": "Sunan an-Nasa'i 3996",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The first matter concerning which scores will be settled among the people will be bloodshed.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 3924,
      "title": "Sunan an-Nasa'i 3997",
      "narrator": "It was narrated from 'Abdullah bin Mas'ud that:",
      "english_text": "The Prophet [SAW] said: \"A man will come, holding another man's hand, and will say: 'O Lord, this man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'I killed him so that the glory would be to you.' He will say: 'It is to Me.' Then (another) man will come holding another man's hand, and will say: 'This man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'So that the glory would be to so and so.' He will say: 'It is not to so and so,' and the burden of sin will be upon him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 3925,
      "title": "Sunan an-Nasa'i 3998",
      "narrator": "It was narrated that Abu 'Imran Al-Jawni said:",
      "english_text": "\"Jundab said: 'So and so told me that the Messenger of Allah [SAW] said: The slain will bring his killer on the Day of Resurrection and will say: Ask him why he killed me. He will say: I killed him defending the kingdom of so and so.'\" Jundab said: \"So be careful.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 3926,
      "title": "Sunan an-Nasa'i 3999",
      "narrator": "It was narrated from Salim bin Abi Ja'd that:",
      "english_text": "Ibn 'Abbas was asked about someone who killed a believer deliberately, then he repented, believed and did righteous deeds, and followed true guidance. Ibn 'Abbas said: \"There is no way the repentance could avail him! I heard the Prophet [SAW] say: 'He (the victim) will come hanging onto his killer, with his jugular veins flowing with blood and saying: O Lord, ask him why he killed me. Then he said: By Allah, Allah revealed it and never abrogated anything of it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 3927,
      "title": "Sunan an-Nasa'i 4000",
      "narrator": "It was narrated that Sa'eed bin Jubair said:",
      "english_text": "\"The people of Al-Kufah differed concerning this Verse: \"And whoever kills a believer intentionally.\" So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 3928,
      "title": "Sunan an-Nasa'i 4001",
      "narrator": "It was narrated that Sa'eed bin Jubair said:",
      "english_text": "\"I said to Ibn 'Abbas: 'Can a person, who killed a believer intentionally, repent?' He said: 'No.' I recited the Verse from Al-Furqan to him: 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right,' he said: 'This Verse was revealed in Makkah and was abrogated by a Verse that was revealed in Al-Madinah: 'And whoever kills a believer intentionally, his recompense is Hell.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 3929,
      "title": "Sunan an-Nasa'i 4002",
      "narrator": "It was narrated that Sa'eed bin Jubair said:",
      "english_text": "\"Abdur-Rahman bin Abi Laila told me to ask Ibn 'Abbas about two Verses: 'And whoever kills a believer intentionally, his recompense is Hell.' I asked him and he said: 'Nothing of this has been abrogated.' (And I asked him about the Verse): 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right,' he said: 'This was revealed concerning the people of Shirk.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 3930,
      "title": "Sunan an-Nasa'i 4003",
      "narrator": "It was narrated from Ibn 'Abbas that :",
      "english_text": "Some people used to kill, and they did a great deal of it, and they used to commit adultery and they did a great deal of it, and they committed violations. They came to the Prophet [SAW] and said: \"O Muhammad, what you say and call people to is good, if only you could tell us that there is any expiation for what we have done.\" Then Allah, the Mighty and Sublime, revealed: \"And those who invoke not any other ilah (god) along with Allah up to for those, Allah will change their sins into good deeds,\" he said: \"So Allah will change their Shirk into faith, and their adultery into chastity. And the Verse: \"Say: O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)\" was revealed.",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 3931,
      "title": "Sunan an-Nasa'i 4004",
      "narrator": "It was narrated from Ibn 'Abbas that :",
      "english_text": "Some of the people of Shirk came to Muhammad [SAW] and said: \"What you say and call people to is good, if only you could tell us that there is any expiation for what we have done.\" Then the Verses: \"And those who invoke not any other ilah (god) along with Allah, or kill such a person as Allah has forbidden, except by right.\" And \"Say: O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)\" were revealed.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 3932,
      "title": "Sunan an-Nasa'i 4005",
      "narrator": "It was narrated from Ibn 'Abbas that:",
      "english_text": "The Prophet [SAW] said: \"The slain will bring his killer on the Day of Resurrection with his forelock and his head in his hand, and with his jugular veins flowing with blood, and will say: 'O Lord, he killed me,' until he draws near to the Throne.\" They mentioned repentance to Ibn 'Abbas and he recited this Verse: \"And whoever kills a believer intentionally, his recompense is Hell\" He said: \"It has not been abrogated since it was revealed; there is no way he could repent.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 3933,
      "title": "Sunan an-Nasa'i 4006",
      "narrator": "It was narrated that Zaid bin Thabit said:",
      "english_text": "\"This Verse - 'And whoever kills a believer intentionally, his recompense is Hell' - was revealed six months after the Verse which was revealed in Surat Al-Furqan.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 3934,
      "title": "Sunan an-Nasa'i 4007",
      "narrator": "It was narrated from Zaid with regard Allah's saying:",
      "english_text": "\"And whoever kills a believer intentionally, his recompense is Hell\" that he said: \"This Verse was revealed eight months after the Verse that is in Tabark Al-Furqan: \"And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 3935,
      "title": "Sunan an-Nasa'i 4008",
      "narrator": "It was narrated that Mujalid bin 'Awf said:",
      "english_text": "\"I heard Kharijah bin Zaid bin Thabit narrate that his father said: (The Verse) 'And whoever kills a believer intentionally, his recompense is Hell' was revealed and we became worried about it. Then the Verse in Al-Furqan 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.' was revealed.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 3936,
      "title": "Sunan an-Nasa'i 4009",
      "narrator": "Abu Ayyub Al-Ansari narrated that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Whoever comes worshipping Allah and not associating anything with Him, establishing Salah, paying Zakah and avoiding major sins, Paradise will be his.\" They asked him about major sins and he said: \"Associating others with Allah, killing a Muslim soul, and fleeing (from the battlefield) on the day of the march.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 3937,
      "title": "Sunan an-Nasa'i 4010",
      "narrator": "It was narrated that 'Ubaidullah bin Abi Bakr said:",
      "english_text": "\"I heard Anas say: 'The Messenger of Allah [SAW] said: The major sins are: Associating others with Allah (Shirk), disobeying one's parents, killing a soul (murder) and speaking falsely.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 3938,
      "title": "Sunan an-Nasa'i 4011",
      "narrator": "It was narrated from 'Abdullah bin 'Amr that:",
      "english_text": "The Prophet [SAW] said: \"The major sins are: Associating others with Allah, disobeying parents, killing a soul (murder) and swearing a false oath knowingly.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 3939,
      "title": "Sunan an-Nasa'i 4012",
      "narrator": "It was narrated from 'Ubaid bin 'Umair that :",
      "english_text": "His father - who was one of the Companions of the Prophet [SAW] - told him: \"A man said: 'O Messenger of Allah, what are the major sins?' He said: 'They are seven; the most grievous of which are associating others with Allah, killing a soul unlawfully and fleeing (from the battlefield) on the day of the march.'\" It is abridged.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 3940,
      "title": "Sunan an-Nasa'i 4013",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"I said: 'O Messenger of Allah, which sin is the most grievous?' He said: 'Setting up a rival to Allah while it is He that has created you.' I said: 'Then what?' He said: 'Killing your child for fear that he may eat with you.' I said: 'Then what?' He said: 'Committing adultery with your neighbor's wife.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 3941,
      "title": "Sunan an-Nasa'i 4014",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"I said: 'O Messenger of Allah, which sin is most grievous?' He said: 'Setting up a rival to Allah while it is He that created you.' I said: 'Then what?' He said: 'Killing your child so that he will not eat with you.' I said: 'Then what?' He said: 'Committing adultery with your neighbor's wife.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 3942,
      "title": "Sunan an-Nasa'i 4015",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"I asked the Messenger of Allah [SAW], which sin is most grievous?\" He said: \"Shirk, setting up a rival to Allah, committing adultery with your neighbor's wife, and killing your child for fear of poverty, and that he may eat with you.\" Then 'Abdullah recited the Verse: \"And those who invoke not any other Ilah (god) along with Allah.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 3943,
      "title": "Sunan an-Nasa'i 4016",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'By the One besides Whom there is no other god, it is not permissible to shed the blood of a Muslim who bears witness to La ilaha illalla (there is none worthy of worship except Allah) and that I am the Messenger of Allah, except in three cases: One who leaves Islam and splits away from the Jama'ah, a person who has been married and then commits adultery, and a life for a life.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 3944,
      "title": "Sunan an-Nasa'i 4017",
      "narrator": "It was narrated that 'Amr bin Ghalib said:",
      "english_text": "\"Aishah said: 'Do you not know that the Messenger of Allah [SAW] said: It is not permissible to shed the blood of a Muslim, except a man who committed adultery after being married, or one who reverted to Kufr after becoming Muslim, or a life for a life.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 3945,
      "title": "Sunan an-Nasa'i 4018",
      "narrator": "It was narrated that 'Amr bin Ghalib said:",
      "english_text": "\"Aishah said: 'O 'Ammar! Do you not know that it is not permissible to shed the blood of a Muslim except in three cases: a life for a life, a man who commits adultery after being married.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 3946,
      "title": "Sunan an-Nasa'i 4019",
      "narrator": "Abu Umamah bin Sahl and 'Abdullah bin 'Amir bin Rabi'ah said:",
      "english_text": "\"We were with 'Uthman when he was under siege and we could hear what was said from Al-Balat. 'Uthman came in one day, then he came out, and said: 'They are threatening to kill me.' We said: 'Allah will suffice you against them.' He said: 'Why would they kill me? I heard the Messenger of Allah [SAW] say: It is not permissible to shed the blood of a Muslim except in one of three cases: A man who reverts to Kufr after becoming Muslim, or commits adultery after being married, or one who kills a soul unlawfully. By Allah, I did not commit adultery during Jahiliyyah or in Islam, I never wished to follow any other religion since Allah guided me, and I have never killed anyone, so why do they want to kill me?'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 3947,
      "title": "Sunan an-Nasa'i 4020",
      "narrator": "It was narrated that 'Arfajah bin Shuraih Al-Ashja'I said:",
      "english_text": "\"I saw the Prophet [SAW] on the Minbar addressing the people. He said: 'After me there will be many calamities and much evil behavior. Whoever you see splitting away from the Jama'ah or trying to create division among the Ummah of Muhammad [SAW], then kill him, for the Hand of Allah is with the Jama'ah, and the Shaitan is with the one who splits away from the Ummah, running with him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 3948,
      "title": "Sunan an-Nasa'i 4021",
      "narrator": "It was narrated that 'Arfajah bin Shuraih said:",
      "english_text": "\"The Prophet [SAW] said: 'After me there will be many calamities and much evil behavior.' He raised his hands (and said): 'Whomever you see trying to create division among the Ummah of Muhammad [SAW] when they are all united, kill him, no matter who he is among the people.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 3949,
      "title": "Sunan an-Nasa'i 4022",
      "narrator": "It was narrated that 'Arfajah said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'After me there will be many calamities and much evil behavior. Whoever wants to create division among the Ummah (of Muhammad [SAW]) when they are all united, strike him with the sword.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 3950,
      "title": "Sunan an-Nasa'i 4023",
      "narrator": "It was narrated that Usamah bin Sharik said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Any man who goes out and tries to create division among my Ummah, strike his neck (kill him).'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 3951,
      "title": "Sunan an-Nasa'i 4024",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "A group of eighty people from 'Ukl came to the Prophet [SAW], but the climate of Al-Madinah did not suit them and they fell sick. They complained about that to the Messenger of Allah [SAW] and he said: \"Why don't you go out with our herdsmen and drink the milk and urine of the camels?\" They said: \"Yes (we will do that).\" They went out and drank some of the (camels') milk and urine, and they recovered. Then they killed the herdsman of the Messenger of Allah [SAW], so he sent (men after them) and they caught them and brought them back. He had their hands and feet cut off and branded their eyes, and left them in the sun to die.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 3952,
      "title": "Sunan an-Nasa'i 4025",
      "narrator": "It was narrated from Anas that :",
      "english_text": "Some people from 'Ukl came to the Prophet [SAW] but the climate of Al-Madinah did not suit them. The Prophet [SAW] told them to go to the camels that had been given in Sadaqah and drink some of their milk and urine. They did that, then they killed their herdsman and drove off the camels. The Prophet [SAW] sent (men) after them, and they were brought to him. He had their hands and feet cut off, and their eyes gouged out, and he did not have (their wounds) cauterized, and he left them to die. Then Allah, the Mighty and Sublime, revealed: \"The recompense of those who wage war against Allah and His Messenger.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 3953,
      "title": "Sunan an-Nasa'i 4026",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"Eighty men from 'Ukl came to the Messenger of Allah [SAW]\" and he (the narrator) mentioned a similar report up to the words: \"And he did not have (their wounds) cauterized.\" And he said: \"They killed the herdsman.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 3954,
      "title": "Sunan an-Nasa'i 4027",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"A group of men from 'Ukl, or 'Uraynah, came to the Prophet [SAW], and when the climate of Al-Madinah did not suit them, he told them to go to some camels and drink their milk and urine. Then they killed the herdsman and stole the camels. He sent (men) after them, and had their hands and feet cut off, and their eyes gouged out.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 3955,
      "title": "Sunan an-Nasa'i 4028",
      "narrator": "It was narrated from Anas bin Malik that:",
      "english_text": "Some people from 'Uraynah came to the Messenger of Allah [SAW], but the climate of Al-Madinah did not suit them. The Prophet [SAW] sent them to some camels of his, and he drank some of their milk and urine. When they recovered, they apostatized from Islam and killed the herdsman of the Messenger of Allah [SAW], who was a believer, and drove the camels off. The Messenger of Allah [SAW] sent (men) after them, and they were caught. He had their hands and feet cut off, their eyes gouged out, and had them crucified.",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 3956,
      "title": "Sunan an-Nasa'i 4029",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"Some people from 'Uraynah came to the Messenger of Allah [SAW] and the Messenger of Allah [SAW] said to them: 'Why don't you go out to our camels and stay with them and drink their milk and urine?' So they did that, and when they recovered, they went to the herdsman of the Messenger of Allah [SAW] and killed him, reverted to being disbelievers, and drove off the camels of the Prophet [SAW]. He sent (men) after them, and they were brought to him. He had their hands and feet cut off, and their eyes gouged out.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 3957,
      "title": "Sunan an-Nasa'i 4030",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"Some people from 'Uraynah came to the Messenger of Allah [SAW], but the climate of Al-Madinah did not suit them. The Messenger of Allah [SAW] said to them: 'Why don't you go out to our camels and drink their milk?'\" - (one of the narrators) Qatadah said: 'And their urine.' - \"So they went out to the camels of the Messenger of Allah [SAW], but when they recovered they killed the herdsman of the Messenger of Allah [SAW], who was a believer, and drove off the camels of the Messenger of Allah [SAW], and left as those at war. He sent (men) after them and they were caught. Then he had their hands and feet cut off, and branded their eyes.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 3958,
      "title": "Sunan an-Nasa'i 4031",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"Some people from 'Uraynah became Muslim, but the climate of Al-Madinah did not suit them. The Messenger of Allah [SAW] said to them: 'Why don't you go out to some camels of ours and drink their milk?'\" - (one of the narrators) Humaid said: \"And Qatadah said, narrating from Anas: 'And their urine.'\" - \"So they did that, and when they recovered they reverted to disbelief after their Islam, killed the herdsman of the Messenger of Allah [SAW], who was a believer, drove off the camels of the Messenger of Allah [SAW], and fled as those at war. The Messenger of Allah [SAW] sent someone to bring them and they were caught. He had their hands and feet cut off and their eyes branded, then he left them in Al-Harrah until they died.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 3959,
      "title": "Sunan an-Nasa'i 4032",
      "narrator": "Anas bin Malik narrated that:",
      "english_text": "Some people or some men from 'Ukl, or 'Uraynah came to the Messenger of Allah [SAW] and said: \"O Messenger of Allah, we are herdsmen, not tillers,\" the climate of Al-Madinah did not suit them. So the Messenger of Allah [SAW] ordered that they be allocated some camels and a herdsman, and he told them to go out with them and drink their milk and urine. When they recovered and they were in the vicinity of Al-Harrah, they reverted to disbelief after their Islam, killed the herdsman of the Messenger of Allah [SAW] and drove off the camels. He sent (men) after them and they were brought, and he had their eyes gouged out, and their hands and feet cut off. Then he left them in Al-Harrah in that state until they died.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 3960,
      "title": "Sunan an-Nasa'i 4033",
      "narrator": "Narrated from 'Abdul-A'la:",
      "english_text": "A similar report was narrated from 'Abdul-A'la.",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 3961,
      "title": "Sunan an-Nasa'i 4034",
      "narrator": "It was narrated from Anas that :",
      "english_text": "Some people from 'Uraynah camped in Al-Harrah and came to the Messenger of Allah [SAW]. The climate of Al-Madinah did not suit them, so the Messenger of Allah [SAW] told them to go and stay near the camels that had been given in Sadaqah, and to drink their milk and urine. Then they killed the herdsman and apostatized from Islam, and drove off the camels. The Messenger of Allah [SAW] sent (men) after them, who brought them, then he had their hands and feet cut off, and their eyes gouged out, and left them in Al-Harrah. Anas said: \"I saw one of them biting at the ground from thirst, until they died.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 3962,
      "title": "Sunan an-Nasa'i 4035",
      "narrator": "It was narrated that Anas bin Malik said:",
      "english_text": "\"Some Bedouin from 'Uraynah came to the Prophet of Allah [SAW] and accepted Islam, but the climate of Al-Madinah did not suit them; their skin turned yellow and their bellies became swollen. The Prophet of Allah sent them to some milk camels of his and told them to drink their milk and urine until they recovered. Then they killed their herdsmen and drove off the camels. The Prophet of Allah sent (men) after them and they were brought back, then he had their hands and feet cut off, and their eyes were branded.\" The Commander of the Believers, 'Abdul-Malik, said to Anas, when he was narrating this Hadith: \"Was that (punishment) for Kufr or for sin?\" He said: \"For Kufr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 3963,
      "title": "Sunan an-Nasa'i 4036",
      "narrator": "It was narrated that Sa'eed bin Al-Musayyab said:",
      "english_text": "\"Some 'Arab people came to the Messenger of Allah [SAW] and accepted Islam, then they became sick. The Messenger of Allah [SAW] sent them to some milk camels to drink their milk. While they were with them, they attacked the herdsman, who was a slave of the Messenger of Allah [SAW], and killed him. They drove off the camels, and claimed that the Messenger of Allah [SAW] had said: 'O Allah, make thirsty the one who makes the family of Muhammad thirsty tonight.' The Messenger of Allah [SAW] sent (men) after them, and they were caught. Then he had their hands and feet cut off, and their eyes gouged out.\" Some of them (the narrators) added more than others, except that in his narration of this Hadith, Mu'awiyah said: \"They drove them off to the land of Shirk.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 3964,
      "title": "Sunan an-Nasa'i 4037",
      "narrator": "It was narrated that 'Aishah said:",
      "english_text": "\"Some people raided the milk camels of the Messenger of Allah [SAW]. He caught them and had their hands and feet cut off and their eyes gouged out.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 3965,
      "title": "Sunan an-Nasa'i 4038",
      "narrator": "It was narrated from 'Aishah:",
      "english_text": "\"Some people raided the milk camels of the Messenger of Allah [SAW]. They were brought to the Prophet [SAW], and the Prophet [SAW] had their hands and feet cut off and their eyes gouged out.\" This is the wording of Ibn Al-Muthanna.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 3966,
      "title": "Sunan an-Nasa'i 4039",
      "narrator": "It was narrated from Hisham, from his father, that:",
      "english_text": "Some people raided the camels of the Messenger of Allah [SAW]. He had their hands and feet cut off and their eyes gouged out.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 3967,
      "title": "Sunan an-Nasa'i 4040",
      "narrator": "It was narrated that 'Urwah bin Az-Zubair said:",
      "english_text": "\"Some people from 'Uraynah raided the milk camels of the Messenger of Allah [SAW] and drove them off, and killed a slave of his. The Messenger of Allah [SAW] sent (men) after them, and they were caught, and he had their hands and feet cut off, and their eyes gouged out.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 3968,
      "title": "Sunan an-Nasa'i 4041",
      "narrator": "It was narrated from 'Abdullah bin 'Umar:",
      "english_text": "From the Messenger of Allah [SAW]: \"The Verse about Al-Muharabah was revealed concerning them.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 3969,
      "title": "Sunan an-Nasa'i 4042",
      "narrator": "It was narrated from Abu Az-Zinad that:",
      "english_text": "The Messenger of Allah [SAW] had the (hands and feet) of those who drove off his camels cut off, and their eyes gouged out with fire. Allah rebuked him for that, and Allah, Most High, revealed the entire verse: \"The recompense of those who wage war against Allah and His Messenger.\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 3970,
      "title": "Sunan an-Nasa'i 4043",
      "narrator": "It was narrated that Anas said:",
      "english_text": "\"The Prophet [SAW] only had the eyes of those people gouged out, because they had gouged out the eyes of the herdsmen.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 3971,
      "title": "Sunan an-Nasa'i 4044",
      "narrator": "It was narrated from Anas bin Malik that:",
      "english_text": "A Jewish man killed an Ansari girl for her jewelry, and threw her in an empty well, and crushed her head with a rock. He was caught and the Messenger of Allah [SAW] ordered that he be stoned to death.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 3972,
      "title": "Sunan an-Nasa'i 4045",
      "narrator": "It was narrated from Anas that:",
      "english_text": "A man killed an Ansari girl for her jewelry, then he threw her in an empty well, and crushed her head with a rock. The Prophet [SAW] ordered that he be stoned to death.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 3973,
      "title": "Sunan an-Nasa'i 4046",
      "narrator": "It was narrated that Ibn 'Abbas said, :",
      "english_text": "Concerning the statement of Allah, the Most High: The recompense of those who wage war against Allah and His Messenger. \"This Verse was revealed concerning the idolators. Whoever among them repents before he is captured, you have no way against him. This Verse does not apply to the Muslims. Whoever kills, spreads mischief in the land, and wages war against Allah and His Messenger, then joins the disbelievers before he can be caught, there is nothing to prevent the Hadd punishment being carried out on him because of what he did.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 3974,
      "title": "Sunan an-Nasa'i 4047",
      "narrator": "It was narrated from Anas who said:",
      "english_text": "\"The Messenger of Allah [SAW] used to stress charity in his sermons, and prohibit mutilation.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 3975,
      "title": "Sunan an-Nasa'i 4048",
      "narrator": "It was narrated from 'Aishah that:",
      "english_text": "The Messenger of Allah [SAW] said: \"It is not permissible to shed the blood of a Muslim except in three cases: An adulterer who had been married, who should be stoned to death; a man who killed another man intentionally, who should be killed; and a man who left Islam and waged war against Allah, the Might and Sublime, and His Messenger, who should be killed, or crucified, or banished from the land.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 3976,
      "title": "Sunan an-Nasa'i 4049",
      "narrator": "It was narrated that Jarir said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'If a slave runs away, no Salah will be accepted from him until he goes back to his masters.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 3977,
      "title": "Sunan an-Nasa'i 4050",
      "narrator": "Jarir used to narrate from the Prophet [SAW]:",
      "english_text": "\"If a slave runs away, no Salah will be accepted from him, and if he dies he will die a disbeliever.\" A slave of Jarir's ran away, and he caught him and struck his neck (killing him).",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 3978,
      "title": "Sunan an-Nasa'i 4051",
      "narrator": "It was narrated that Jarir bin 'Abdullah said:",
      "english_text": "\"If a slave runs away to the land of Shirk, there is no protection (or immunity) for him.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 3979,
      "title": "Sunan an-Nasa'i 4052",
      "narrator": "It was narrated that Jarir said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'If a slave runs away to the land of Shirk, it becomes permissible to shed his blood.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 3980,
      "title": "Sunan an-Nasa'i 4053",
      "narrator": "It was narrated from Jarir that:",
      "english_text": "The Prophet [SAW] said: \"If a slave runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 3981,
      "title": "Sunan an-Nasa'i 4054",
      "narrator": "It was narrated that Jarir said:",
      "english_text": "\"Any slave who runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 3982,
      "title": "Sunan an-Nasa'i 4055",
      "narrator": "It was narrated that Jarir said:",
      "english_text": "\"Any slave who runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 3983,
      "title": "Sunan an-Nasa'i 4056",
      "narrator": "It was narrated that Jarir said:",
      "english_text": "\"Any slave who runs away from his masters and joins the enemy, he has made it permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 3984,
      "title": "Sunan an-Nasa'i 4057",
      "narrator": "It was narrated from Ibn 'Umar that:",
      "english_text": "'Uthman said: \"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills intentionally, in which case he deserves retaliation; or one who apostatizes after having become Muslim, in which case he deserves to be killed.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 3985,
      "title": "Sunan an-Nasa'i 4058",
      "narrator": "It was narrated that 'Uthman bin 'Affan said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills another person, who is to be killed; or who reverts to Kufr after having accepted Islam, who is to be killed.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 3986,
      "title": "Sunan an-Nasa'i 4059",
      "narrator": "Ibn 'Abbas said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 3987,
      "title": "Sunan an-Nasa'i 4060",
      "narrator": "It was narrated from 'Ikrimah:",
      "english_text": "\"Some people apostatized after accepting Islam, and 'Ali burned them with fire. Ibn 'Abbas said: 'If it had been me, I would not have burned them; the Messenger of Allah [SAW] said: 'No one should be punished with the punishment of Allah.' If it had been me, I would have killed them; the Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 3988,
      "title": "Sunan an-Nasa'i 4061",
      "narrator": "It was narrated that Ibn 'Abbas said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 3989,
      "title": "Sunan an-Nasa'i 4062",
      "narrator": "It was narrated that Ibn 'Abbas said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 3990,
      "title": "Sunan an-Nasa'i 4063",
      "narrator": "It was narrated that Al-Hasan said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 3991,
      "title": "Sunan an-Nasa'i 4064",
      "narrator": "It was narrated from Anas that :",
      "english_text": "Ibn 'Abbas said: \"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 3992,
      "title": "Sunan an-Nasa'i 4065",
      "narrator": "It was narrated from Anas that :",
      "english_text": "'Ali came to some people of Az-Zutt, who worshipped idols, and burned them. Ibn 'Abbas said: \"But the Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 3993,
      "title": "Sunan an-Nasa'i 4066",
      "narrator": "It was narrated from Abu Burdah bin Abi Musa Al-Ash'ari, from his father:",
      "english_text": "\"That the Prophet [SAW] sent him to Yemen, then he sent Mu'adh bin Jabal after that. When he arrived he said: 'O people, I am the envoy of the Messenger of Allah [SAW] to you.' Abu Musa gave him a cushion to sit down, then a man was brought who had been a Jew, then he became a Muslim, then he reverted to Kufr. Mu'adh said: 'I will not sit down until he is killed; this is the decree of Allah and His Messenger,' (saying it) three times. When he was killed, he sat down.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 3994,
      "title": "Sunan an-Nasa'i 4067",
      "narrator": "It was narrated from Mus'ab bin Sa'd that his father said:",
      "english_text": "\"On the day of the Conquest of Makkah, the Messenger of Allah [SAW] granted amnesty to the people, except four men and two women. He said: 'Kill them, even if you find them clinging to the covers of Ka'bah.' (They were) 'Ikrimah bin Abi Jahl, 'Abdullah bin Khatal, Miqyas bin Subabah and 'Abdullah bin Sa'd bin Abi As-Sarh. 'Abdullah bin Khatl was caught while he was clinging to the covers of Ka'bah. Sa'eed bin Huraith and 'Ammar bin Yasir both rushed toward him, but Sa'eed, who was the younger of the two, got there before 'Ammar, and he killed him. Miqyas bin Subabah was caught by the people in the marketplace, and they killed him. 'Ikrimah traveled by sea, and he was caught in a storm. The crew of the ship said: 'Turn sincerely toward Allah, for your (false) gods cannot help you at all in this situation.' 'Ikrimah said: 'By Allah, if nothing came to save me at sea except sincerity toward Allah then nothing else will save me on land. O Allah, I promise You that if You save me from this predicament I will go to Muhammad [SAW] and put my hand in his, and I am sure that I will find him generous and forgiving.' So he came, and accepted Islam. 'Abdullah (bin Sa'd) bin Abi Sarh hid in the house of 'Uthman bin 'Affan, and when the Messenger of Allah [SAW] called the people to give their Oath of Allegiance, he brought him, and made him stand before the Prophet [SAW]. He ('Uthman) said: 'O Messenger of Allah! Accept the allegiance of 'Abdullah.' He raised his head and looked at him three times, refusing his allegiance each time, then he accepted his allegiance after three times. Then he turned to his Companions and said: 'Was there not any sensible man among you who would get up when he saw me refusing to give him my hand and kill him?' They said: 'We did not know, O Messenger of Allah, what was in your heart. Why did you not gesture to us with your eyes?' He said: 'It is not befitting for a Prophet that his eyes be deceitful.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 3995,
      "title": "Sunan an-Nasa'i 4068",
      "narrator": "It was narrated that Ibn 'Abbas said:",
      "english_text": "\"A man from among the Ansar accepted Islam, then he apostatized and went back to Shirk. Then he regretted that, and sent word to his people (saying): 'Ask the Messenger of Allah [SAW], is there any repentance for me?' His people came to the Messenger of Allah [SAW] and said: 'So and so regrets (what he did), and he has told us to ask you if there is any repentance for him?' Then the Verses: 'How shall Allah guide a people who disbelieved after their Belief up to His saying: Verily, Allah is Oft-Forgiving, Most Merciful' was revealed. So he sent word to him, and he accepted Islam.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 3996,
      "title": "Sunan an-Nasa'i 4069",
      "narrator": "It was narrated that Ibn 'Abbas said concerning Surat An-Nahl - :",
      "english_text": "\"Whoever disbelieved in Allah after his belief, except him who is forced thereto and whose heart is at rest with Faith; but such as open their breasts to disbelief, on them is wrath from Allah, and theirs will be a great torment.\" \"This was abrogated, and an exception was made, as Allah said: \"Then, verily, your Lord for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allah) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.\" This was 'Abdullah bin Sa'd bin Abi As-Sarh who was the governor of Egypt and used to write to the Messenger of Allah [SAW]. The Shaitan misled him and he went and joined the unbelievers. So he (the Prophet [SAW]) commanded that he be killed on the day of the Conquest of Makkah. Then, 'Uthman bin 'Afan sought protection for him, and the Messenger of Allah [SAW] granted him protection.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 3997,
      "title": "Sunan an-Nasa'i 4070",
      "narrator": "Ibn 'Abbas narrated that :",
      "english_text": "There was a blind man during the time of the Messenger of Allah [SAW] who had an Umm Walad by whom he had two sons. She used to slander and defame the Messenger of Allah [SAW] a great deal, and he would rebuke her, but she would not pay heed, and he would forbid her to do that, but she ignored him. (The blind man said) One night I mentioned the Prophet [SAW], and she slandered him. I could not bear it so I went and got a dagger which I thrust into her stomach and leaned upon it, and killed her. In the morning she was found slain. Mention of that was made to the Prophet [SAW] and he gathered the people and said: \"I adjure by Allah; a man over whom I have the right, that he should obey me, and he did what he did, to stand up.\" The blind man started to tremble and said: \"O Messenger of Allah [SAW], I am the one who killed her. She was my Umm Walad and she was kind and gentle toward me, and I have two sons like pearls from her, but she used to slander and defame you a great deal. I forbade her, but she did not stop, and I rebuked her, but she did not pay heed. Finally, I mentioned your name and she slandered you, so I went and got a dagger which I thrust into her stomach, and leaned on it until I killed her. The Messenger of Allah [SAW] said: \"I bear witness that her blood is permissible.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 3998,
      "title": "Sunan an-Nasa'i 4071",
      "narrator": "It was narrated that Abu Barzah Al-Aslami said:",
      "english_text": "\"A man spoke harshly to Abu Bakr As-Siddiq, and I said: 'Shall I kill him?' He told me off, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 3999,
      "title": "Sunan an-Nasa'i 4072",
      "narrator": "It was narrated that Abu Barzah said:",
      "english_text": "\"Abu Bakr got infuriated with a man, and I said: 'Who is he, O Khalifah of the Messenger of Allah?' He said: 'Why?' I said: 'So that I might strike his neck (killing him) if you tell me to.' He said: 'Would you really do that?' I said: 'Yes. By Allah,' the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 4000,
      "title": "Sunan an-Nasa'i 4073",
      "narrator": "It was narrated that Abu Barzah said:",
      "english_text": "\"I passed by Abu Bakr and he was furious with one of his companions. I said: 'O Khalifah of the Messenger of Allah, who is the one with whom you are furious?' He said: 'Why are you asking about him?' I said: 'I will strike his neck (kill him).' By Allah, the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 4001,
      "title": "Sunan an-Nasa'i 4074",
      "narrator": "It was narrated that Abu Barzah said:",
      "english_text": "\"Abu Bakr became infuriated with a man.\" He said: \"If you tell me to, I will do it.\" He said: \"By Allah, that is not for any human being after Muhammad [SAW].\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 4002,
      "title": "Sunan an-Nasa'i 4075",
      "narrator": "It was narrated from Abu Nadrah, that Abu Barzah said:",
      "english_text": "\"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 4003,
      "title": "Sunan an-Nasa'i 4076",
      "narrator": "Abu Nasr narrated from Abu Barzah, that he said:",
      "english_text": "\"I came to Abu Bakr when he had spoken harshly to a man who had answered back. I said: 'Shall I not strike his neck (kill him)?' He rebuked me, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 4004,
      "title": "Sunan an-Nasa'i 4077",
      "narrator": "It was narrated from Yunus bin 'Ubaid, from Humaid bin Hilal, from 'Abdullah bin Mutarrif bin Ash-Shikhkhir, from Abu Barzah Al-Aslami, that he said:",
      "english_text": "\"We were with Abu Bakr As-Siddiq, and he got angry with a man from among the Muslims, and became very angry indeed. When I saw that, I said: 'O Khalifah of the Messenger of Allah, shall I strike his neck?' When I mentioned killing him, he stopped being angry with him and changed the subject. When we parted, he sent for me and said: 'O Abu Barzah, what did you say?' I said: 'I have forgotten what I said; remind me.' He said: 'Do you not remember what you said?' I said: 'No, by Allah.' He said: 'Don't you remember, when you saw me angry with a man, and said, 'I will strike his neck O Khalifah of the Messenger of Allah?' Don't you remember that? Would you really have done that?' I said: 'Yes, by Allah, and if you tell me to do it now, I will do it.' He said: 'By Allah, that is not for anyone after Muhammad [SAW].'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 4005,
      "title": "Sunan an-Nasa'i 4078",
      "narrator": "It was narrated that Safwan bin 'Assal said:",
      "english_text": "\"A Jew said to his companion: 'Let us go to this Prophet.' His companion said to him: 'Do not say Prophet; if he hears you, he will become big-headed.' So they came to the Messenger of Allah [SAW] and asked him about nine clear signs. He said to them: 'Do not associate anything with Allah, do not steal, do not commit adultery, do not kill any soul whom Allah has forbidden you to kill, except by right, do not speak falsely about an innocent man before a ruler, do not engage in magic, do not consume Riba (usury), do not slander chaste women, and do not flee on the day of the march (to battle). And for you Jews especially, do not break the Sabbath.' They kissed his hands and feet and said: 'We bear witness that you are a Prophet.' He said: 'What is keeping you from following me?' They said: 'Dawud prayed that there would always be a Prophet among his descendants, and we are afraid that if we follow you, the Jews will kill us.'\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 4006,
      "title": "Sunan an-Nasa'i 4079",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever ties a know and blows on it, he has practiced magic; and whoever practices magic, he has committed Shirk; and whoever hangs up something (as an amulet) will be entrusted to it.'\"",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 4007,
      "title": "Sunan an-Nasa'i 4080",
      "narrator": "It was narrated that Zaid bin Arqam said:",
      "english_text": "\"A Jewish man cast a spell on the Prophet [SAW], and he fell ill as a result of it, for several days. Then Jibra'il, peace be upon him, came to him and said: 'A Jewish man has put a spell on you. In such and such a well there is a knot that he tied for you.' The Messenger of Allah [SAW] sent them to take it out and bring it to him. Then the Messenger of Allah [SAW] got up as if he had been released from some bonds. No mention of that was made to that Jew, and he did not see that in his face at all.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 4008,
      "title": "Sunan an-Nasa'i 4081",
      "narrator": "It was narrated from Qabus bin Mukhariq that his father said:",
      "english_text": "\"I heard Sufyan Ath-Thawri narrating this Hadith. He said: 'A man came to the Prophet [SAW] and said: \"What if a man comes to me and wants to take my wealth?\" He said: \"Remind him of Allah.\" He said: \"What if he pays no heed?\" He said: \"Seek the help of the Muslims around you against him.\" He said: \"What if there are no Muslims around me?\" He said: \"Seek the help of the ruler against him.\" He said: \"What if the ruler is far away from me?\" He said: \"Fight to defend your wealth until you either become one of the martyrs of the Hereafter, or you protect your wealth (successfully).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 4009,
      "title": "Sunan an-Nasa'i 4082",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"A man came to the Messenger of Allah [SAW] and said: 'O Messenger of Allah, what do you think if someone comes to steal my wealth?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Then fight. If you are killed you will be in Paradise, and if you kill him, he will be in the Fire.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 4010,
      "title": "Sunan an-Nasa'i 4083",
      "narrator": "It was narrated from Abu Hurairah that:",
      "english_text": "A man came to the Messenger of Allah [SAW] and said: \"O Messenger of Allah, what do you think if someone comes to steal my wealth?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Then fight. If you are killed you will be in Paradise and if you kill him, he will be in the Fire.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 4011,
      "title": "Sunan an-Nasa'i 4084",
      "narrator": "It was narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 4012,
      "title": "Sunan an-Nasa'i 4085",
      "narrator": "It was narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 4013,
      "title": "Sunan an-Nasa'i 4086",
      "narrator": "It was narrated from 'Abdullah bin 'Amr bin Al-'As that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Whoever is killed defending his wealth and is killed unjustly, Paradise will be his.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 4014,
      "title": "Sunan an-Nasa'i 4087",
      "narrator": "It was narrated that 'Abudllah bin 'Amr said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 4015,
      "title": "Sunan an-Nasa'i 4088",
      "narrator": "It was narrated from Ibrahim bin Muhammad bin Talhah that he heard 'Abdullah bin 'Amr narrating:",
      "english_text": "From the Prophet [SAW], that he said: \"If a person's wealth is sought without right, and he fights (to protect it) and is killed, he is a martyr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 4016,
      "title": "Sunan an-Nasa'i 4089",
      "narrator": "It was narrated that 'Abdullah bin 'Amr said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 4017,
      "title": "Sunan an-Nasa'i 4090",
      "narrator": "It was narrated from Sa'eed bin Zaid that:",
      "english_text": "The Prophet [SAW] said: \"Whoever is killed defending his wealth, he is a martyr.\" This is an abridgement of it.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 4018,
      "title": "Sunan an-Nasa'i 4091",
      "narrator": "It was narrated from Sa'eed bin Zaid that:",
      "english_text": "The Prophet [SAW] said: \"Whoever is killed defending his wealth, he is a martyr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 4019,
      "title": "Sunan an-Nasa'i 4092",
      "narrator": "It was narrated from Sulaiman bin Buraidah that his father said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 4020,
      "title": "Sunan an-Nasa'i 4093",
      "narrator": "It was narrated that Abu Ja'far said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth and is killed unjustly, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 4021,
      "title": "Sunan an-Nasa'i 4094",
      "narrator": "It was narrated from Sa'eed bin Zaid that:",
      "english_text": "The Prophet [SAW] said: \"Whoever fights to protect his wealth and is killed, he is a martyr. Whoever fights to protect himself, he is a martyr. Whoever fights to protect his family is a martyr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 4022,
      "title": "Sunan an-Nasa'i 4095",
      "narrator": "It was narrated that Sa'eed bin Zaid said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever is killed protecting his wealth, he is a martyr. Whoever is killed protecting his family, he is a martyr. Whoever is killed protecting his religion, he is a martyr. Whoever is killed protecting himself, he is a martyr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 4023,
      "title": "Sunan an-Nasa'i 4096",
      "narrator": "It was narrated that Abu Ja'far said:",
      "english_text": "\"I was sitting with Suwaid bin Muqarrin, and he said: The Messenger of Allah [SAW] said: \"Whoever is killed defending himself against injustice, he is a martyr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 4024,
      "title": "Sunan an-Nasa'i 4097",
      "narrator": "It was narrated from Ibn Az-Zubair that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Whoever unsheathes his sword and starts to strike the people with it, it is permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 4025,
      "title": "Sunan an-Nasa'i 4098",
      "narrator": "'Abdur-Razzaq narrated:",
      "english_text": "'Abdur-Razzaq narrated a similar report with the same chain, but he did not attribute it to the Prophet [SAW]",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 4026,
      "title": "Sunan an-Nasa'i 4099",
      "narrator": "It was narrated that Ibn Az-Zubair said:",
      "english_text": "\"Whoever wields a weapon and starts to strike (the people) with it, it is permissible to shed his blood.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 4027,
      "title": "Sunan an-Nasa'i 4100",
      "narrator": "It was narrated from 'Abdullah bin 'Umar that :",
      "english_text": "The Prophet [SAW] said: \"Whoever bears weapons against us, he is not one of us.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 4028,
      "title": "Sunan an-Nasa'i 4101",
      "narrator": "It was narrated that Abu Sa'eed Al-Khudri said:",
      "english_text": "\"When 'Ali was in Yemen, he sent some gold that was still enclosed in rock to the Prophet [SAW], who distributed it among Al-Aqra' bin Habis Al-Hanzali, who belonged to Banu Mujashi', 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al-'Amiri, who belonged to Banu Kilab and Zaid Al-Khail At-Ta'I, who belonged to Banu Nabhan. The Quraish and the Ansar became angry and said: 'He gives to the chiefs of Najd and ignores us!' He said: 'I am seeking to win them over (firmly to Islam).' Then a man with sunken eyes, a bulging forehead, a thick beard and a shaven head came and said: 'O Muhammad, fear Allah!' He said: 'Who will obey Allah if I do not? He trusts me with the people of this Earth but you do not trust me.' A man among the people asked for permission to kill him, but he did not let him do that. When (the man) went away, he (the Prophet [SAW]) said: 'Among the offspring of this man there will be people who will recite the Qur'an but it will not go beyond their throats, and they will go out of Islam as an arrow goes through the target. They will kill the Muslims and leave the idol-worshippers alone. If I live to see them, I will kill them as the killing of 'Ad.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 4029,
      "title": "Sunan an-Nasa'i 4102",
      "narrator": "It was narrated that 'Ali said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'At the end of time there will appear young people with foolish minds. Their faith will not pass through their throats, and they will go out of Islam as an arrow goes through the target. If you meet them, then kill them, for killing them will bring reward to the one who killed them on the Day of Resurrection.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 4030,
      "title": "Sunan an-Nasa'i 4103",
      "narrator": "it was narrated that Sharik bin Shihab said:",
      "english_text": "\"I used to wish that I could meet a man among the Companions of the Prophet [SAW] and ask him about the Khawarij. Then I met Abu Barzah on the day of 'Id, with a number of his companions. I said to him: 'Did you hear the Messenger of Allah [SAW] mention the Khawarij?' He said: 'Yes. I heard the Messenger of Allah [SAW] with my own ears, and saw him with my own eyes. Some wealth was brought to the Messenger of Allah [SAW] and he distributed it to those on his right and on his left, but he did not give anything to those who were behind him. Then a man stood behind him and said: \"O Muhammad! You have not been just in your division!\" He was a man with black patchy (shaved) hair, wearing two white garments. So Allah's Messenger [SAW] became very angry and said: \"By Allah! You will not find a man after me who is more just than me.\" Then he said: \"A people will come at the end of time; as if he is one of them, reciting the Qur'an without it passing beyond their throats. They will go through Islam just as the arrow goes through the target. Their distinction will be shaving. They will not cease to appear until the last of them comes with Al-Masih Ad-Dajjal. So when you meet them, then kill them, they are the worst of created beings.\"",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 4031,
      "title": "Sunan an-Nasa'i 4104",
      "narrator": "Sa'd bin Abi Waqas told us that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Fighting a Muslim is Kufr and defaming him is evildoing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 4032,
      "title": "Sunan an-Nasa'i 4105",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"Defaming a Muslim is evildoing and fighting him is Kufr.\" (Sahih Mawquf)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 4033,
      "title": "Sunan an-Nasa'i 4106",
      "narrator": "It was narrated from Shu'bah, from Abu Ishaq who said:",
      "english_text": "\"I heard Abu Al-Ahwas (narrate) that 'Abdullah said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\" So Aban said to him: \"O Abu Ishaq! You heard it only from Abu Al-Ahwas?\" He said: \"Rather, I heard it from Al-Aswad and Hubairah.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 4034,
      "title": "Sunan an-Nasa'i 4107",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"Defaming a Muslim is evildoing and fighting him is Kufr.\" (Sahih Mawquf)",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 4035,
      "title": "Sunan an-Nasa'i 4108",
      "narrator": "It was narrated from 'Abdur-Rahman bin 'Abdullah, from his father, that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 4036,
      "title": "Sunan an-Nasa'i 4109",
      "narrator": "It was narrated from Shu'bah who said:",
      "english_text": "\"I said to Hammad: 'I heard Mansur, and Sulaiman, and Zubaid narrating from Abu Wa'il, from 'Abdullah, that the Messenger of Allah [SAW] said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\" - Who are you worried about? Are you worried about Mansur? Are you worried about Zubaid? Are you worried about Sulaiman?' He said: 'No, but I am worried about Abu Wa'il.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 4037,
      "title": "Sunan an-Nasa'i 4110",
      "narrator": "It was narrated from Sufyan bin Zubaid, from Abu Wa'il, from 'Abdullah:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\" I said to Abu Wa'il: \"Did you hear it from 'Abdullah?\" He said: \"Yes.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 4038,
      "title": "Sunan an-Nasa'i 4111",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 4039,
      "title": "Sunan an-Nasa'i 4112",
      "narrator": "It was narrated that Abu Wa'il said:",
      "english_text": "\"'Abdullah said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 4040,
      "title": "Sunan an-Nasa'i 4113",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"Fighting a believer is Kufr and defaming him is evildoing.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 4041,
      "title": "Sunan an-Nasa'i 4114",
      "narrator": "It was narrated that Abu Hurairah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever parts from obedience, and splits away from the Jama'ah and dies, then he has died a death of Jahiliyyah. Whoever rebels against my Ummah, killing good and evil people alike, and does not try to avoid killing the believers, and does not pay attention to those who are under a covenant, then he is not of me. Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, and he is killed, then he has died a death of Jahiliyyah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 4042,
      "title": "Sunan an-Nasa'i 4115",
      "narrator": "It was narrated that Jundab bin 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, then he has died a death of Jahiliyyah.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 4043,
      "title": "Sunan an-Nasa'i 4116",
      "narrator": "It was narrated that Abu Bakrah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'If a Muslim points a weapon at his fellow Muslim, then they are on the brink of Hell, and if he kills him, then they will both fall into it.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 4044,
      "title": "Sunan an-Nasa'i 4117",
      "narrator": "It was narrated that Abu Bakrah said:",
      "english_text": "\"If two Muslim men bear weapons against each other, then they are both on the brink of Hell. And if one of them kills the other, they will both be in Hell.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 4045,
      "title": "Sunan an-Nasa'i 4118",
      "narrator": "It was narrated from Abu Musa that:",
      "english_text": "The Prophet [SAW] said: \"If two Muslims confront each other with swords, and one kills the other, they will both be in Hell.\" It was said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 4046,
      "title": "Sunan an-Nasa'i 4119",
      "narrator": "It was narrated from Abu Musa Al-Ash'ari that:",
      "english_text": "The Prophet [SAW] said: \"If two Muslims confront each other with swords and one of them kills the other, they will both be in Hell.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 4047,
      "title": "Sunan an-Nasa'i 4120",
      "narrator": "It was narrated from Abu Bakrah that :",
      "english_text": "The Prophet [SAW] said: \"If two Muslims confront each other with swords, each of them wanting to kill the other, they will both be in Hell.\" It was said to him: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He was determined to kill his companion.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 4048,
      "title": "Sunan an-Nasa'i 4121",
      "narrator": "It was narrated that Abu Bakrah said:",
      "english_text": "\"The Messenger [SAW] said: 'If two Muslims meet (and fight) with their swords and one of them kills the other, the killer and the slain will both be in Hell.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 4049,
      "title": "Sunan an-Nasa'i 4122",
      "narrator": "It was narrated that Abu Bakrah said:",
      "english_text": "\"I heard the Messenger of Allah [SAW] say: 'If two Muslims confront each other with their swords and one of them kills the other, both the killer and the slain will be in Hell.'\" They said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 4050,
      "title": "Sunan an-Nasa'i 4123",
      "narrator": "It was narrated that Abu Bakrah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'If two Muslims fight with swords, and one of them kills the other, then the killer and the slain will both be in Hell.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 159,
      "hadithNum_inBook": 4051,
      "title": "Sunan an-Nasa'i 4124",
      "narrator": "It was narrated from Abu Musa Al-Ash'ari that :",
      "english_text": "The Messenger of Allah [SAW] said: \"If two Muslims confront each other with swords and one of them kills the other, then the killer and the slain will both be in Hell.\" A man said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 160,
      "hadithNum_inBook": 4052,
      "title": "Sunan an-Nasa'i 4125",
      "narrator": "It was narrated from Ibn 'Umar that :",
      "english_text": "The Prophet [SAW] said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 161,
      "hadithNum_inBook": 4053,
      "title": "Sunan an-Nasa'i 4126",
      "narrator": "It was narrated that Ibn 'Umar said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or for the sins of his brother.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 162,
      "hadithNum_inBook": 4054,
      "title": "Sunan an-Nasa'i 4127",
      "narrator": "It was narrated that 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or the sins of his brother.'\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 163,
      "hadithNum_inBook": 4055,
      "title": "Sunan an-Nasa'i 4128",
      "narrator": "It was narrated that Masruq said:",
      "english_text": "\"The Messenger of Allah [SAW] said: 'I do not want to see you after I am gone reverting to disbelievers, striking the necks of one another (killing one another). No man is punished for the crime of his father, or the crime of his brother.'\" This is correct.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 164,
      "hadithNum_inBook": 4056,
      "title": "Sunan an-Nasa'i 4129",
      "narrator": "It was narrated from Masruq that:",
      "english_text": "The Messenger of Allah [SAW] said: \"Do not revert to disbelievers after I am gone.\" It is Mursal.",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 165,
      "hadithNum_inBook": 4057,
      "title": "Sunan an-Nasa'i 4130",
      "narrator": "It was narrated from Abu Bakrah that:",
      "english_text": "The Prophet [SAW] said: \"Do not revert to misguidance after I am gone, striking the necks of one another (killing one another).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 166,
      "hadithNum_inBook": 4058,
      "title": "Sunan an-Nasa'i 4131",
      "narrator": "It was narrated from Jarir that :",
      "english_text": "During the Farewell Pilgrimage, the Messenger of Allah [SAW] asked the people to be quiet and listen, and said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 167,
      "hadithNum_inBook": 4059,
      "title": "Sunan an-Nasa'i 4132",
      "narrator": "It was narrated that Jarir bin 'Abdullah said:",
      "english_text": "\"The Messenger of Allah [SAW] said to me: 'Ask the people to be quiet and listen.' Then he said: 'I do not want to see you after I am gone reverting to disbelievers, striking the necks of one another (killing one another).'\"",
      "grade": "Sahih (Darussalam)"
    }
  ]
}