{
  "chapterNum": 20,
  "arabic_title": "كتاب قيام الليل وتطوع النهار",
  "totalHadiths_inChapter": 220,
  "hadith_list": [
    {
      "hadithNum_inChapter": 1,
      "hadithNum_inBook": 1603,
      "title": "Sunan an-Nasa'i 1598",
      "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنِ الْوَلِيدِ بْنِ أَبِي هِشَامٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" صَلُّوا فِي بُيُوتِكُمْ وَلاَ تَتَّخِذُوهَا قُبُورًا \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 2,
      "hadithNum_inBook": 1604,
      "title": "Sunan an-Nasa'i 1599",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ سَمِعْتُ مُوسَى بْنَ عُقْبَةَ، قَالَ سَمِعْتُ أَبَا النَّضْرِ، يُحَدِّثُ عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اتَّخَذَ حُجْرَةً فِي الْمَسْجِدِ مِنْ حَصِيرٍ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا لَيَالِيَ حَتَّى اجْتَمَعَ إِلَيْهِ النَّاسُ ثُمَّ فَقَدُوا صَوْتَهُ لَيْلَةً فَظَنُّوا أَنَّهُ نَائِمٌ فَجَعَلَ بَعْضُهُمْ يَتَنَحْنَحُ لِيَخْرُجَ إِلَيْهِمْ فَقَالَ \n\" مَا زَالَ بِكُمُ الَّذِي رَأَيْتُ مِنْ صُنْعِكُمْ حَتَّى خَشِيتُ أَنْ يُكْتَبَ عَلَيْكُمْ وَلَوْ كُتِبَ عَلَيْكُمْ مَا قُمْتُمْ بِهِ فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ فَإِنَّ أَفْضَلَ صَلاَةِ الْمَرْءِ فِي بَيْتِهِ إِلاَّ الصَّلاَةَ الْمَكْتُوبَةَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 3,
      "hadithNum_inBook": 1605,
      "title": "Sunan an-Nasa'i 1600",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ أَنْبَأَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ، عَنْ سَعْدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْمَغْرِبِ فِي مَسْجِدِ بَنِي عَبْدِ الأَشْهَلِ فَلَمَّا صَلَّى قَامَ نَاسٌ يَتَنَفَّلُونَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \n\" عَلَيْكُمْ بِهَذِهِ الصَّلاَةِ فِي الْبُيُوتِ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 4,
      "hadithNum_inBook": 1606,
      "title": "Sunan an-Nasa'i 1601",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، أَنَّهُ لَقِيَ ابْنَ عَبَّاسٍ فَسَأَلَهُ عَنِ الْوَتْرِ، فَقَالَ أَلاَ أُنَبِّئُكَ بِأَعْلَمِ أَهْلِ الأَرْضِ بِوِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ . قَالَ عَائِشَةُ ائْتِهَا فَسَلْهَا ثُمَّ ارْجِعْ إِلَىَّ فَأَخْبِرْنِي بِرَدِّهَا عَلَيْكَ فَأَتَيْتُ عَلَى حَكِيمِ بْنِ أَفْلَحَ فَاسْتَلْحَقْتُهُ إِلَيْهَا فَقَالَ مَا أَنَا بِقَارِبِهَا إِنِّي نَهَيْتُهَا أَنْ تَقُولَ فِي هَاتَيْنِ الشِّيعَتَيْنِ شَيْئًا فَأَبَتْ فِيهَا إِلاَّ مُضِيًّا . فَأَقْسَمْتُ عَلَيْهِ فَجَاءَ مَعِي فَدَخَلَ عَلَيْهَا فَقَالَتْ لِحَكِيمٍ مَنْ هَذَا مَعَكَ قُلْتُ سَعْدُ بْنُ هِشَامٍ . قَالَتْ مَنْ هِشَامٌ قُلْتُ ابْنُ عَامِرٍ . فَتَرَحَّمَتْ عَلَيْهِ وَقَالَتْ نِعْمَ الْمَرْءُ كَانَ عَامِرًا . قَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَتْ أَلَيْسَ تَقْرَأُ الْقُرْآنَ قَالَ قُلْتُ بَلَى . قَالَتْ فَإِنَّ خُلُقَ نَبِيِّ اللَّهِ صلى الله عليه وسلم الْقُرْآنُ . فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي قِيَامُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ قِيَامِ نَبِيِّ اللَّهِ صلى الله عليه وسلم . قَالَتْ أَلَيْسَ تَقْرَأُ هَذِهِ السُّورَةَ { يَا أَيُّهَا الْمُزَّمِّلُ } قُلْتُ بَلَى . قَالَتْ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ افْتَرَضَ قِيَامَ اللَّيْلِ فِي أَوَّلِ هَذِهِ السُّورَةِ فَقَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ حَوْلاً حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ وَأَمْسَكَ اللَّهُ عَزَّ وَجَلَّ خَاتِمَتَهَا اثْنَىْ عَشَرَ شَهْرًا ثُمَّ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ التَّخْفِيفَ فِي آخِرِ هَذِهِ السُّورَةِ فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ أَنْ كَانَ فَرِيضَةً فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي وِتْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ وِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ عَزَّ وَجَلَّ لِمَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ وَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ لاَ يَجْلِسُ فِيهِنَّ إِلاَّ عِنْدَ الثَّامِنَةِ يَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ ثُمَّ يُصَلِّي رَكْعَةً فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَىَّ فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ وَصَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا سَلَّمَ فَتِلْكَ تِسْعُ رَكَعَاتٍ يَا بُنَىَّ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى صَلاَةً أَحَبَّ أَنْ يَدُومَ عَلَيْهَا وَكَانَ إِذَا شَغَلَهُ عَنْ قِيَامِ اللَّيْلِ نَوْمٌ أَوْ مَرَضٌ أَوْ وَجَعٌ صَلَّى مِنَ النَّهَارِ اثْنَتَىْ عَشْرَةَ رَكْعَةً وَلاَ أَعْلَمُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلاَ قَامَ لَيْلَةً كَامِلَةً حَتَّى الصَّبَاحِ وَلاَ صَامَ شَهْرًا كَامِلاً غَيْرَ رَمَضَانَ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ بِحَدِيثِهَا فَقَالَ صَدَقَتْ أَمَا أَنِّي لَوْ كُنْتُ أَدْخُلُ عَلَيْهَا لأَتَيْتُهَا حَتَّى تُشَافِهَنِي مُشَافَهَةً . قَالَ أَبُو عَبْدِ الرَّحْمَنِ كَذَا وَقَعَ فِي كِتَابِي وَلاَ أَدْرِي مِمَّنِ الْخَطَأُ فِي مَوْضِعِ وِتْرِهِ عَلَيْهِ السَّلاَمُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 5,
      "hadithNum_inBook": 1607,
      "title": "Sunan an-Nasa'i 1602",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 6,
      "hadithNum_inBook": 1608,
      "title": "Sunan an-Nasa'i 1603",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ أَبُو بَكْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، قَالَ قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 7,
      "hadithNum_inBook": 1609,
      "title": "Sunan an-Nasa'i 1604",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي الْمَسْجِدِ ذَاتَ لَيْلَةٍ وَصَلَّى بِصَلاَتِهِ نَاسٌ ثُمَّ صَلَّى مِنَ الْقَابِلَةِ وَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنَ اللَّيْلَةِ الثَّالِثَةِ أَوِ الرَّابِعَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ قَالَ \n\" قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ فَلَمْ يَمْنَعْنِي مِنَ الْخُرُوجِ إِلَيْكُمْ إِلاَّ أَنِّي خَشِيتُ أَنْ يُفْرَضَ عَلَيْكُمْ \" . وَذَلِكَ فِي رَمَضَانَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 8,
      "hadithNum_inBook": 1610,
      "title": "Sunan an-Nasa'i 1605",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي ذَرٍّ، قَالَ صُمْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَلَمْ يَقُمْ بِنَا حَتَّى بَقِيَ سَبْعٌ مِنَ الشَّهْرِ فَقَامَ بِنَا حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ ثُمَّ لَمْ يَقُمْ بِنَا فِي السَّادِسَةِ فَقَامَ بِنَا فِي الْخَامِسَةِ حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَوْ نَفَّلْتَنَا بَقِيَّةَ لَيْلَتِنَا هَذِهِ . قَالَ \n\" إِنَّهُ مَنْ قَامَ مَعَ الإِمَامِ حَتَّى يَنْصَرِفَ كَتَبَ اللَّهُ لَهُ قِيَامَ لَيْلَةٍ \" . ثُمَّ لَمْ يُصَلِّ بِنَا وَلَمْ يَقُمْ حَتَّى بَقِيَ ثَلاَثٌ مِنَ الشَّهْرِ فَقَامَ بِنَا فِي الثَّالِثَةِ وَجَمَعَ أَهْلَهُ وَنِسَاءَهُ حَتَّى تَخَوَّفْنَا أَنْ يَفُوتَنَا الْفَلاَحُ . قُلْتُ وَمَا الْفَلاَحُ قَالَ السُّحُورُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 9,
      "hadithNum_inBook": 1611,
      "title": "Sunan an-Nasa'i 1606",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، قَالَ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، قَالَ حَدَّثَنِي نُعَيْمُ بْنُ زِيَادٍ أَبُو طَلْحَةَ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، عَلَى مِنْبَرِ حِمْصَ يَقُولُ قُمْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شَهْرِ رَمَضَانَ لَيْلَةَ ثَلاَثٍ وَعِشْرِينَ إِلَى ثُلُثِ اللَّيْلِ الأَوَّلِ ثُمَّ قُمْنَا مَعَهُ لَيْلَةَ خَمْسٍ وَعِشْرِينَ إِلَى نِصْفِ اللَّيْلِ ثُمَّ قُمْنَا مَعَهُ لَيْلَةَ سَبْعٍ وَعِشْرِينَ حَتَّى ظَنَنَّا أَنْ لاَ نُدْرِكَ الْفَلاَحَ وَكَانُوا يُسَمُّونَهُ السُّحُورَ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 10,
      "hadithNum_inBook": 1612,
      "title": "Sunan an-Nasa'i 1607",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" إِذَا نَامَ أَحَدُكُمْ عَقَدَ الشَّيْطَانُ عَلَى رَأْسِهِ ثَلاَثَ عُقَدٍ يَضْرِبُ عَلَى كُلِّ عُقْدَةٍ لَيْلاً طَوِيلاً أَىِ ارْقُدْ فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ أُخْرَى فَإِنْ صَلَّى انْحَلَّتِ الْعُقَدُ كُلُّهَا فَيُصْبِحُ طَيِّبَ النَّفْسِ نَشِيطًا وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 11,
      "hadithNum_inBook": 1613,
      "title": "Sunan an-Nasa'i 1608",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ \n\" ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 12,
      "hadithNum_inBook": 1614,
      "title": "Sunan an-Nasa'i 1609",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا مَنْصُورٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ فُلاَنًا نَامَ عَنِ الصَّلاَةِ الْبَارِحَةَ حَتَّى أَصْبَحَ . قَالَ \n\" ذَاكَ شَيْطَانٌ بَالَ فِي أُذُنَيْهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 13,
      "hadithNum_inBook": 1615,
      "title": "Sunan an-Nasa'i 1610",
      "arabic_text": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ عَجْلاَنَ، قَالَ حَدَّثَنِي الْقَعْقَاعُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" رَحِمَ اللَّهُ رَجُلاً قَامَ مِنَ اللَّيْلِ فَصَلَّى ثُمَّ أَيْقَظَ امْرَأَتَهُ فَصَلَّتْ فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ وَرَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنَ اللَّيْلِ فَصَلَّتْ ثُمَّ أَيْقَظَتْ زَوْجَهَا فَصَلَّى فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 14,
      "hadithNum_inBook": 1616,
      "title": "Sunan an-Nasa'i 1611",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ، حَدَّثَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ فَقَالَ \" أَلاَ تُصَلُّونَ \" . قُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِذَا شَاءَ أَنْ يَبْعَثَهَا بَعَثَهَا فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قُلْتُ لَهُ ذَلِكَ ثُمَّ سَمِعْتُهُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ \" { وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً } \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 15,
      "hadithNum_inBook": 1617,
      "title": "Sunan an-Nasa'i 1612",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي حَكِيمُ بْنُ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ، عَنْ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَلَى فَاطِمَةَ مِنَ اللَّيْلِ فَأَيْقَظَنَا لِلصَّلاَةِ ثُمَّ رَجَعَ إِلَى بَيْتِهِ فَصَلَّى هَوِيًّا مِنَ اللَّيْلِ فَلَمْ يَسْمَعْ لَنَا حِسًّا فَرَجَعَ إِلَيْنَا فَأَيْقَظَنَا فَقَالَ \" قُومَا فَصَلِّيَا \" . قَالَ فَجَلَسْتُ وَأَنَا أَعْرُكُ عَيْنِي وَأَقُولُ إِنَّا وَاللَّهِ مَا نُصَلِّي إِلاَّ مَا كَتَبَ اللَّهُ لَنَا إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ . فَإِنْ شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا - قَالَ - فَوَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ يَقُولُ وَيَضْرِبُ بِيَدِهِ عَلَى فَخِذِهِ \" مَا نُصَلِّي إِلاَّ مَا كَتَبَ اللَّهُ لَنَا { وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً } \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 16,
      "hadithNum_inBook": 1618,
      "title": "Sunan an-Nasa'i 1613",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، - هُوَ ابْنُ عَوْفٍ - عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلاَةِ بَعْدَ الْفَرِيضَةِ صَلاَةُ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 17,
      "hadithNum_inBook": 1619,
      "title": "Sunan an-Nasa'i 1614",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ أَنَّهُ سَمِعَ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" أَفْضَلُ الصَّلاَةِ بَعْدَ الْفَرِيضَةِ قِيَامُ اللَّيْلِ وَأَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ الْمُحَرَّمُ \" . أَرْسَلَهُ شُعْبَةُ بْنُ الْحَجَّاجِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 18,
      "hadithNum_inBook": 1620,
      "title": "Sunan an-Nasa'i 1615",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ رِبْعِيًّا، عَنْ زَيْدِ بْنِ ظَبْيَانَ، رَفَعَهُ إِلَى أَبِي ذَرٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" ثَلاَثَةٌ يُحِبُّهُمُ اللَّهُ عَزَّ وَجَلَّ رَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَهُمْ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لاَ يَعْلَمُ بِعَطِيَّتِهِ إِلاَّ اللَّهُ عَزَّ وَجَلَّ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقُوا الْعَدُوَّ فَانْهَزَمُوا فَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 19,
      "hadithNum_inBook": 1621,
      "title": "Sunan an-Nasa'i 1616",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْبَصْرِيُّ، عَنْ بِشْرٍ، - هُوَ ابْنُ الْمُفَضَّلِ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَشْعَثَ بْنِ سُلَيْمٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، قَالَ قُلْتُ لِعَائِشَةَ أَىُّ الأَعْمَالِ أَحَبُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتِ الدَّائِمُ . قُلْتُ فَأَىُّ اللَّيْلِ كَانَ يَقُومُ قَالَتْ إِذَا سَمِعَ الصَّارِخَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 20,
      "hadithNum_inBook": 1622,
      "title": "Sunan an-Nasa'i 1617",
      "arabic_text": "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ، قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، قَالَ حَدَّثَنَا الأَزْهَرُ بْنُ سَعِيدٍ، عَنْ عَاصِمِ بْنِ حُمَيْدٍ، قَالَ سَأَلْتُ عَائِشَةَ بِمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَفْتِحُ قِيَامَ اللَّيْلِ قَالَتْ لَقَدْ سَأَلْتَنِي عَنْ شَىْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُ عَشْرًا وَيَحْمَدُ عَشْرًا وَيُسَبِّحُ عَشْرًا وَيُهَلِّلُ عَشْرًا وَيَسْتَغْفِرُ عَشْرًا وَيَقُولُ \n\" اللَّهُمَّ اغْفِرْ لِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي أَعُوذُ بِاللَّهِ مِنْ ضِيقِ الْمَقَامِ يَوْمَ الْقِيَامَةِ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 21,
      "hadithNum_inBook": 1623,
      "title": "Sunan an-Nasa'i 1618",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، وَالأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ رَبِيعَةَ بْنِ كَعْبٍ الأَسْلَمِيِّ، قَالَ كُنْتُ أَبِيتُ عِنْدَ حُجْرَةِ النَّبِيِّ صلى الله عليه وسلم فَكُنْتُ أَسْمَعُهُ إِذَا قَامَ مِنَ اللَّيْلِ يَقُولُ \" سُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ \" . الْهَوِيَّ ثُمَّ يَقُولُ \" سُبْحَانَ اللَّهِ وَبِحَمْدِهِ \" . الْهَوِيَّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 22,
      "hadithNum_inBook": 1624,
      "title": "Sunan an-Nasa'i 1619",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَحْوَلِ، - يَعْنِي سُلَيْمَانَ بْنَ أَبِي مُسْلِمٍ - عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَتَهَجَّدُ قَالَ \" اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ حَقٌّ وَوَعْدُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ وَالنَّبِيُّونَ حَقٌّ وَمُحَمَّدٌ حَقٌّ لَكَ أَسْلَمْتُ وَعَلَيْكَ تَوَكَّلْتُ وَبِكَ آمَنْتُ \" . ثُمَّ ذَكَرَ قُتَيْبَةُ كَلِمَةً مَعْنَاهَا \" وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 23,
      "hadithNum_inBook": 1625,
      "title": "Sunan an-Nasa'i 1620",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي مَخْرَمَةُ بْنُ سُلَيْمَانَ، عَنْ كُرَيْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ - وَهِيَ خَالَتُهُ - فَاضْطَجَعَ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ قَلِيلاً أَوْ بَعْدَهُ قَلِيلاً اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِيمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 24,
      "hadithNum_inBook": 1626,
      "title": "Sunan an-Nasa'i 1621",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، وَحُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 25,
      "hadithNum_inBook": 1627,
      "title": "Sunan an-Nasa'i 1622",
      "arabic_text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ حُصَيْنٍ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ حُذَيْفَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 26,
      "hadithNum_inBook": 1628,
      "title": "Sunan an-Nasa'i 1623",
      "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ إِسْحَاقَ بْنِ سُلَيْمَانَ، عَنْ أَبِي سِنَانٍ، عَنْ أَبِي حُصَيْنٍ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ كُنَّا نُؤْمَرُ بِالسِّوَاكِ إِذَا قُمْنَا مِنَ اللَّيْلِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 27,
      "hadithNum_inBook": 1629,
      "title": "Sunan an-Nasa'i 1624",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ أَنْبَأَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ شَقِيقٍ، قَالَ كُنَّا نُؤْمَرُ إِذَا قُمْنَا مِنَ اللَّيْلِ أَنْ نَشُوصَ أَفْوَاهَنَا بِالسِّوَاكِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 28,
      "hadithNum_inBook": 1630,
      "title": "Sunan an-Nasa'i 1625",
      "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ أَنْبَأَنَا عُمَرُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ سَأَلْتُ عَائِشَةَ بِأَىِّ شَىْءٍ كَانَ النَّبِيُّ صلى الله عليه وسلم يَفْتَتِحُ صَلاَتَهُ قَالَتْ كَانَ إِذَا قَامَ مِنَ اللَّيْلِ افْتَتَحَ صَلاَتَهُ قَالَ \n\" اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اللَّهُمَّ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 29,
      "hadithNum_inBook": 1631,
      "title": "Sunan an-Nasa'i 1626",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قُلْتُ وَأَنَا فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهِ لأَرْقُبَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لِصَلاَةٍ حَتَّى أَرَى فِعْلَهُ فَلَمَّا صَلَّى صَلاَةَ الْعِشَاءِ - وَهِيَ الْعَتَمَةُ - اضْطَجَعَ هَوِيًّا مِنَ اللَّيْلِ ثُمَّ اسْتَيْقَظَ فَنَظَرَ فِي الأُفُقِ فَقَالَ { رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلاً } حَتَّى بَلَغَ { إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ } . ثُمَّ أَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فِرَاشِهِ فَاسْتَلَّ مِنْهُ سِوَاكًا ثُمَّ أَفْرَغَ فِي قَدَحٍ مِنْ إِدَاوَةٍ عِنْدَهُ مَاءً فَاسْتَنَّ ثُمَّ قَامَ فَصَلَّى حَتَّى قُلْتُ قَدْ صَلَّى قَدْرَ مَا نَامَ ثُمَّ اضْطَجَعَ حَتَّى قُلْتُ قَدْ نَامَ قَدْرَ مَا صَلَّى ثُمَّ اسْتَيْقَظَ فَفَعَلَ كَمَا فَعَلَ أَوَّلَ مَرَّةٍ وَقَالَ مِثْلَ مَا قَالَ فَفَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ قَبْلَ الْفَجْرِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 30,
      "hadithNum_inBook": 1632,
      "title": "Sunan an-Nasa'i 1627",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا يَزِيدُ، قَالَ أَنْبَأَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ مَا كُنَّا نَشَاءُ أَنْ نَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم فِي اللَّيْلِ مُصَلِّيًا إِلاَّ رَأَيْنَاهُ وَلاَ نَشَاءُ أَنْ نَرَاهُ نَائِمًا إِلاَّ رَأَيْنَاهُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 31,
      "hadithNum_inBook": 1633,
      "title": "Sunan an-Nasa'i 1628",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ عَنْ أَبِيهِ، أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ يَعْلَى بْنَ مَمْلَكٍ، أَخْبَرَهُ أَنَّهُ، سَأَلَ أُمَّ سَلَمَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ يُصَلِّي الْعَتَمَةَ ثُمَّ يُسَبِّحُ ثُمَّ يُصَلِّي بَعْدَهَا مَا شَاءَ اللَّهُ مِنَ اللَّيْلِ ثُمَّ يَنْصَرِفُ فَيَرْقُدُ مِثْلَ مَا صَلَّى ثُمَّ يَسْتَيْقِظُ مِنْ نَوْمِهِ ذَلِكَ فَيُصَلِّي مِثْلَ مَا نَامَ وَصَلاَتُهُ تِلْكَ الآخِرَةُ تَكُونُ إِلَى الصُّبْحِ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 32,
      "hadithNum_inBook": 1634,
      "title": "Sunan an-Nasa'i 1629",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ يَعْلَى بْنِ مَمْلَكٍ، أَنَّهُ سَأَلَ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم عَنْ قِرَاءَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَنْ صَلاَتِهِ فَقَالَتْ مَا لَكُمْ وَصَلاَتَهُ كَانَ يُصَلِّي ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى ثُمَّ يُصَلِّي قَدْرَ مَا نَامَ ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى حَتَّى يُصْبِحَ . ثُمَّ نَعَتَتْ لَهُ قِرَاءَتَهُ فَإِذَا هِيَ تَنْعَتُ قِرَاءَةً مُفَسَّرَةً حَرْفًا حَرْفًا .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 33,
      "hadithNum_inBook": 1635,
      "title": "Sunan an-Nasa'i 1630",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" أَحَبُّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صِيَامُ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 34,
      "hadithNum_inBook": 1636,
      "title": "Sunan an-Nasa'i 1631",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ خَالِدٍ، قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلاَمُ عِنْدَ الْكَثِيبِ الأَحْمَرِ وَهُوَ قَائِمٌ يُصَلِّي فِي قَبْرِهِ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 35,
      "hadithNum_inBook": 1637,
      "title": "Sunan an-Nasa'i 1632",
      "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، وَثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" أَتَيْتُ عَلَى مُوسَى عَلَيْهِ السَّلاَمُ عِنْدَ الْكَثِيبِ الأَحْمَرِ وَهُوَ قَائِمٌ يُصَلِّي \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا أَوْلَى بِالصَّوَابِ عِنْدَنَا مِنْ حَدِيثِ مُعَاذِ بْنِ خَالِدٍ وَاللَّهُ تَعَالَى أَعْلَمُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 36,
      "hadithNum_inBook": 1638,
      "title": "Sunan an-Nasa'i 1633",
      "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ثَابِتٌ، وَسُلَيْمَانُ التَّيْمِيُّ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" مَرَرْتُ عَلَى قَبْرِ مُوسَى عَلَيْهِ السَّلاَمُ وَهُوَ يُصَلِّي فِي قَبْرِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 37,
      "hadithNum_inBook": 1639,
      "title": "Sunan an-Nasa'i 1634",
      "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ حَدَّثَنَا عِيسَى، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلاَمُ وَهُوَ يُصَلِّي فِي قَبْرِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 38,
      "hadithNum_inBook": 1640,
      "title": "Sunan an-Nasa'i 1635",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ مَرَّ عَلَى مُوسَى عَلَيْهِ السَّلاَمُ وَهُوَ يُصَلِّي فِي قَبْرِهِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 39,
      "hadithNum_inBook": 1641,
      "title": "Sunan an-Nasa'i 1636",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، وَإِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالاَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسًا، يَقُولُ أَخْبَرَنِي بَعْضُ، أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ مَرَّ عَلَى مُوسَى عَلَيْهِ السَّلاَمُ وَهُوَ يُصَلِّي فِي قَبْرِهِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 40,
      "hadithNum_inBook": 1642,
      "title": "Sunan an-Nasa'i 1637",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سُلَيْمَانَ، عَنْ أَنَسٍ، عَنْ بَعْضِ، أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" لَيْلَةَ أُسْرِيَ بِي مَرَرْتُ عَلَى مُوسَى وَهُوَ يُصَلِّي فِي قَبْرِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 41,
      "hadithNum_inBook": 1643,
      "title": "Sunan an-Nasa'i 1638",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ، قَالَ حَدَّثَنَا أَبِي وَبَقِيَّةُ، قَالاَ حَدَّثَنَا ابْنُ أَبِي حَمْزَةَ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابِ بْنِ الأَرَتِّ، عَنْ أَبِيهِ، وَكَانَ، قَدْ شَهِدَ بَدْرًا",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 42,
      "hadithNum_inBook": 1644,
      "title": "Sunan an-Nasa'i 1639",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي يَعْفُورٍ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، قَالَ قَالَتْ عَائِشَةُ رضى الله عنها كَانَ إِذَا دَخَلَتِ الْعَشْرُ أَحْيَا رَسُولُ اللَّهِ صلى الله عليه وسلم اللَّيْلَ وَأَيْقَظَ أَهْلَهُ وَشَدَّ الْمِئْزَرَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 43,
      "hadithNum_inBook": 1645,
      "title": "Sunan an-Nasa'i 1640",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ أَتَيْتُ الأَسْوَدَ بْنَ يَزِيدَ وَكَانَ لِي أَخًا صَدِيقًا فَقُلْتُ يَا أَبَا عَمْرٍو حَدِّثْنِي مَا حَدَّثَتْكَ بِهِ أُمُّ الْمُؤْمِنِينَ عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَ قَالَتْ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ وَيُحْيِي آخِرَهُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 44,
      "hadithNum_inBook": 1646,
      "title": "Sunan an-Nasa'i 1641",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ لاَ أَعْلَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلاَ قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلاَ صَامَ شَهْرًا كَامِلاً قَطُّ غَيْرَ رَمَضَانَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 45,
      "hadithNum_inBook": 1647,
      "title": "Sunan an-Nasa'i 1642",
      "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، عَنْ يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَعِنْدَهَا امْرَأَةٌ فَقَالَ \" مَنْ هَذِهِ \" . قَالَتْ فُلاَنَةُ لاَ تَنَامُ . فَذَكَرَتْ مِنْ صَلاَتِهَا فَقَالَ \" مَهْ عَلَيْكُمْ بِمَا تُطِيقُونَ فَوَاللَّهِ لاَ يَمَلُّ اللَّهُ عَزَّ وَجَلَّ حَتَّى تَمَلُّوا وَلَكِنَّ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ صَاحِبُهُ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 46,
      "hadithNum_inBook": 1648,
      "title": "Sunan an-Nasa'i 1643",
      "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، عَنْ عَبْدِ الْوَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَرَأَى حَبْلاً مَمْدُودًا بَيْنَ سَارِيَتَيْنِ فَقَالَ \" مَا هَذَا الْحَبْلُ \" . فَقَالُوا لِزَيْنَبَ تُصَلِّي فَإِذَا فَتَرَتْ تَعَلَّقَتْ بِهِ . فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" حُلُّوهُ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا فَتَرَ فَلْيَقْعُدْ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 47,
      "hadithNum_inBook": 1649,
      "title": "Sunan an-Nasa'i 1644",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ مَنْصُورٍ، - وَاللَّفْظُ لَهُ - عَنْ سُفْيَانَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ قَامَ النَّبِيُّ صلى الله عليه وسلم حَتَّى تَوَرَّمَتْ قَدَمَاهُ فَقِيلَ لَهُ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ . قَالَ \n\" أَفَلاَ أَكُونُ عَبْدًا شَكُورًا \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 48,
      "hadithNum_inBook": 1650,
      "title": "Sunan an-Nasa'i 1645",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا صَالِحُ بْنُ مِهْرَانَ، - وَكَانَ ثِقَةً - قَالَ حَدَّثَنَا النُّعْمَانُ بْنُ عَبْدِ السَّلاَمِ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي حَتَّى تَزْلَعَ يَعْنِي تَشَقَّقُ قَدَمَاهُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 49,
      "hadithNum_inBook": 1651,
      "title": "Sunan an-Nasa'i 1646",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ بُدَيْلٍ، وَأَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي لَيْلاً طَوِيلاً فَإِذَا صَلَّى قَائِمًا رَكَعَ قَائِمًا وَإِذَا صَلَّى قَاعِدًا رَكَعَ قَاعِدًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 50,
      "hadithNum_inBook": 1652,
      "title": "Sunan an-Nasa'i 1647",
      "arabic_text": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي قَائِمًا وَقَاعِدًا فَإِذَا افْتَتَحَ الصَّلاَةَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا افْتَتَحَ الصَّلاَةَ قَاعِدًا رَكَعَ قَاعِدًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 51,
      "hadithNum_inBook": 1653,
      "title": "Sunan an-Nasa'i 1648",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ، وَأَبُو النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي وَهُوَ جَالِسٌ فَيَقْرَأُ وَهُوَ جَالِسٌ فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلاَثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَ وَهُوَ قَائِمٌ ثُمَّ رَكَعَ ثُمَّ سَجَدَ ثُمَّ يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 52,
      "hadithNum_inBook": 1654,
      "title": "Sunan an-Nasa'i 1649",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى جَالِسًا حَتَّى دَخَلَ فِي السِّنِّ فَكَانَ يُصَلِّي وَهُوَ جَالِسٌ يَقْرَأُ فَإِذَا غَبَرَ مِنَ السُّورَةِ ثَلاَثُونَ أَوْ أَرْبَعُونَ آيَةً قَامَ فَقَرَأَ بِهَا ثُمَّ رَكَعَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 53,
      "hadithNum_inBook": 1655,
      "title": "Sunan an-Nasa'i 1650",
      "arabic_text": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي هِشَامٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ قَدْرَ مَا يَقْرَأُ إِنْسَانٌ أَرْبَعِينَ آيَةً .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 54,
      "hadithNum_inBook": 1656,
      "title": "Sunan an-Nasa'i 1651",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا هِشَامٌ، عَنِ الْحَسَنِ، عَنْ سَعْدِ بْنِ هِشَامِ بْنِ عَامِرٍ، قَالَ قَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَى عَائِشَةَ - رضى الله عنها - قَالَتْ مَنْ أَنْتَ قُلْتُ أَنَا سَعْدُ بْنُ هِشَامِ بْنِ عَامِرٍ . قَالَتْ رَحِمَ اللَّهُ أَبَاكَ . قُلْتُ أَخْبِرِينِي عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ وَكَانَ . قُلْتُ أَجَلْ . قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي بِاللَّيْلِ صَلاَةَ الْعِشَاءِ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَيَنَامُ فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى حَاجَتِهِ وَإِلَى طَهُورِهِ فَتَوَضَّأَ ثُمَّ دَخَلَ الْمَسْجِدَ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يُخَيَّلُ إِلَىَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ وَيُوتِرُ بِرَكْعَةٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ يَضَعُ جَنْبَهُ فَرُبَّمَا جَاءَ بِلاَلٌ فَآذَنَهُ بِالصَّلاَةِ قَبْلَ أَنْ يُغْفِيَ وَرُبَّمَا يُغْفِي وَرُبَّمَا شَكَكْتُ أَغْفَى أَوْ لَمْ يُغْفِ حَتَّى يُؤْذِنَهُ بِالصَّلاَةِ فَكَانَتْ تِلْكَ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى أَسَنَّ وَلَحُمَ - فَذَكَرَتْ مِنْ لَحْمِهِ مَا شَاءَ اللَّهُ - قَالَتْ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي بِالنَّاسِ الْعِشَاءَ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى طَهُورِهِ وَإِلَى حَاجَتِهِ فَتَوَضَّأَ ثُمَّ يَدْخُلُ الْمَسْجِدَ فَيُصَلِّي سِتَّ رَكَعَاتٍ يُخَيَّلُ إِلَىَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ ثُمَّ يُوتِرُ بِرَكْعَةٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ يَضَعُ جَنْبَهُ وَرُبَّمَا جَاءَ بِلاَلٌ فَآذَنَهُ بِالصَّلاَةِ قَبْلَ أَنْ يُغْفِيَ وَرُبَّمَا أَغْفَى وَرُبَّمَا شَكَكْتُ أَغْفَى أَمْ لاَ حَتَّى يُؤْذِنَهُ بِالصَّلاَةِ قَالَتْ فَمَا زَالَتْ تِلْكَ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 55,
      "hadithNum_inBook": 1657,
      "title": "Sunan an-Nasa'i 1652",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ حَدِيثِ أَبِي عَاصِمٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْتَنِعُ مِنْ وَجْهِي وَهُوَ صَائِمٌ وَمَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلاَتِهِ قَاعِدًا ثُمَّ ذَكَرَتْ كَلِمَةً مَعْنَاهَا إِلاَّ الْمَكْتُوبَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ مَا دَامَ عَلَيْهِ الإِنْسَانُ وَإِنْ كَانَ يَسِيرًا . خَالَفَهُ يُونُسُ رَوَاهُ عَنْ أَبِي إِسْحَاقَ عَنِ الأَسْوَدِ عَنْ أُمِّ سَلَمَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 56,
      "hadithNum_inBook": 1658,
      "title": "Sunan an-Nasa'i 1653",
      "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ، قَالَ حَدَّثَنَا النَّضْرُ، قَالَ أَنْبَأَنَا يُونُسُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ مَا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَانَ أَكْثَرُ صَلاَتِهِ جَالِسًا إِلاَّ الْمَكْتُوبَةَ . خَالَفَهُ شُعْبَةُ وَسُفْيَانُ وَقَالاَ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 57,
      "hadithNum_inBook": 1659,
      "title": "Sunan an-Nasa'i 1654",
      "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَانَ أَكْثَرُ صَلاَتِهِ قَاعِدًا إِلاَّ الْفَرِيضَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ أَدْوَمَهُ وَإِنْ قَلَّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 58,
      "hadithNum_inBook": 1660,
      "title": "Sunan an-Nasa'i 1655",
      "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ وَالَّذِي نَفْسِي بِيَدِهِ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَانَ أَكْثَرُ صَلاَتِهِ قَاعِدًا إِلاَّ الْمَكْتُوبَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ وَإِنْ قَلَّ . خَالَفَهُ عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ فَرَوَاهُ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 59,
      "hadithNum_inBook": 1661,
      "title": "Sunan an-Nasa'i 1656",
      "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، عَنْ حَجَّاجٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، أَنَّ أَبَا سَلَمَةَ، أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَمُتْ حَتَّى كَانَ يُصَلِّي كَثِيرًا مِنْ صَلاَتِهِ وَهُوَ جَالِسٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 60,
      "hadithNum_inBook": 1662,
      "title": "Sunan an-Nasa'i 1657",
      "arabic_text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، عَنْ يَزِيدَ بْنِ زُرَيْعٍ، قَالَ أَنْبَأَنَا الْجُرَيْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ قُلْتُ لِعَائِشَةَ هَلْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَهُوَ قَاعِدٌ قَالَتْ نَعَمْ بَعْدَ مَا حَطَمَهُ النَّاسُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 61,
      "hadithNum_inBook": 1663,
      "title": "Sunan an-Nasa'i 1658",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ، عَنْ حَفْصَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي سُبْحَتِهِ قَاعِدًا قَطُّ حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي قَاعِدًا يَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 62,
      "hadithNum_inBook": 1664,
      "title": "Sunan an-Nasa'i 1659",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا مَنْصُورٌ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ أَبِي يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي جَالِسًا فَقُلْتُ حُدِّثْتُ أَنَّكَ قُلْتَ \" إِنَّ صَلاَةَ الْقَاعِدِ عَلَى النِّصْفِ مِنْ صَلاَةِ الْقَائِمِ \" . وَأَنْتَ تُصَلِّي قَاعِدًا . قَالَ \" أَجَلْ وَلَكِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 63,
      "hadithNum_inBook": 1665,
      "title": "Sunan an-Nasa'i 1660",
      "arabic_text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ سُفْيَانَ بْنِ حَبِيبٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الَّذِي يُصَلِّي قَاعِدًا قَالَ \n\" مَنْ صَلَّى قَائِمًا فَهُوَ أَفْضَلُ وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 64,
      "hadithNum_inBook": 1666,
      "title": "Sunan an-Nasa'i 1661",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ حَفْصٍ، عَنْ حُمَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، قَالَتْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي مُتَرَبِّعًا . قَالَ أَبُو عَبْدِ الرَّحْمَنِ لاَ أَعْلَمُ أَحَدًا رَوَى هَذَا الْحَدِيثَ غَيْرَ أَبِي دَاوُدَ وَهُوَ ثِقَةٌ وَلاَ أَحْسِبُ هَذَا الْحَدِيثَ إِلاَّ خَطَأً وَاللَّهُ تَعَالَى أَعْلَمُ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 65,
      "hadithNum_inBook": 1667,
      "title": "Sunan an-Nasa'i 1662",
      "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ سَأَلْتُ عَائِشَةَ كَيْفَ كَانَتْ قِرَاءَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ يَجْهَرُ أَمْ يُسِرُّ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا جَهَرَ وَرُبَّمَا أَسَرَّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 66,
      "hadithNum_inBook": 1668,
      "title": "Sunan an-Nasa'i 1663",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلاَلٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ سُمَيْعٍ - قَالَ حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ وَاقِدٍ، عَنْ كَثِيرِ بْنِ مُرَّةَ، أَنَّ عُقْبَةَ بْنَ عَامِرٍ، حَدَّثَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" إِنَّ الَّذِي يَجْهَرُ بِالْقُرْآنِ كَالَّذِي يَجْهَرُ بِالصَّدَقَةِ وَالَّذِي يُسِرُّ بِالْقُرْآنِ كَالَّذِي يُسِرُّ بِالصَّدَقَةِ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 67,
      "hadithNum_inBook": 1669,
      "title": "Sunan an-Nasa'i 1664",
      "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْمُسْتَوْرِدِ بْنِ الأَحْنَفِ، عَنْ صِلَةَ بْنِ زُفَرَ، عَنْ حُذَيْفَةَ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم لَيْلَةً فَافْتَتَحَ الْبَقَرَةَ فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَةِ فَمَضَى فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَتَيْنِ فَمَضَى فَقُلْتُ يُصَلِّي بِهَا فِي رَكْعَةٍ فَمَضَى فَافْتَتَحَ النِّسَاءَ فَقَرَأَهَا ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا يَقْرَأُ مُتَرَسِّلاً إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ ثُمَّ رَكَعَ فَقَالَ \" سُبْحَانَ رَبِّيَ الْعَظِيمِ \" . فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" . فَكَانَ قِيَامُهُ قَرِيبًا مِنْ رُكُوعِهِ ثُمَّ سَجَدَ فَجَعَلَ يَقُولُ \" سُبْحَانَ رَبِّيَ الأَعْلَى \" . فَكَانَ سُجُودُهُ قَرِيبًا مِنْ رُكُوعِهِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 68,
      "hadithNum_inBook": 1670,
      "title": "Sunan an-Nasa'i 1665",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ، - ثِقَةٌ - قَالَ حَدَّثَنَا الْعَلاَءُ بْنُ الْمُسَيَّبِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ طَلْحَةَ بْنِ يَزِيدَ الأَنْصَارِيِّ، عَنْ حُذَيْفَةَ، أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَرَكَعَ فَقَالَ فِي رُكُوعِهِ \" سُبْحَانَ رَبِّيَ الْعَظِيمِ \" . مِثْلَ مَا كَانَ قَائِمًا ثُمَّ جَلَسَ يَقُولُ \" رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي \" . مِثْلَ مَا كَانَ قَائِمًا ثُمَّ سَجَدَ فَقَالَ \" سُبْحَانَ رَبِّيَ الأَعْلَى \" . مِثْلَ مَا كَانَ قَائِمًا فَمَا صَلَّى إِلاَّ أَرْبَعَ رَكَعَاتٍ حَتَّى جَاءَ بِلاَلٌ إِلَى الْغَدَاةِ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الْحَدِيثُ عِنْدِي مُرْسَلٌ وَطَلْحَةُ بْنُ يَزِيدَ لاَ أَعْلَمُهُ سَمِعَ مِنْ حُذَيْفَةَ شَيْئًا وَغَيْرُ الْعَلاَءِ بْنِ الْمُسَيَّبِ قَالَ فِي هَذَا الْحَدِيثِ عَنْ طَلْحَةَ عَنْ رَجُلٍ عَنْ حُذَيْفَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 69,
      "hadithNum_inBook": 1671,
      "title": "Sunan an-Nasa'i 1666",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، أَنَّهُ سَمِعَ عَلِيًّا الأَزْدِيَّ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" صَلاَةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الْحَدِيثُ عِنْدِي خَطَأٌ وَاللَّهُ تَعَالَى أَعْلَمُ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 70,
      "hadithNum_inBook": 1672,
      "title": "Sunan an-Nasa'i 1667",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ حَبِيبٍ، عَنْ طَاوُسٍ، قَالَ قَالَ ابْنُ عُمَرَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ \n\" مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَوَاحِدَةٌ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 71,
      "hadithNum_inBook": 1673,
      "title": "Sunan an-Nasa'i 1668",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، وَمُحَمَّدُ بْنُ صَدَقَةَ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 72,
      "hadithNum_inBook": 1674,
      "title": "Sunan an-Nasa'i 1669",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي لَبِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يُسْأَلُ عَنْ صَلاَةِ اللَّيْلِ فَقَالَ \n\" مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِرَكْعَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 73,
      "hadithNum_inBook": 1675,
      "title": "Sunan an-Nasa'i 1670",
      "arabic_text": "أَخْبَرَنَا مُوسَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ، قَالَ حَدَّثَنَا نَافِعٌ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُمْ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ قَالَ \n\" مَثْنَى مَثْنَى فَإِنْ خَشِيَ أَحَدُكُمُ الصُّبْحَ فَلْيُوتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 74,
      "hadithNum_inBook": 1676,
      "title": "Sunan an-Nasa'i 1671",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 75,
      "hadithNum_inBook": 1677,
      "title": "Sunan an-Nasa'i 1672",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ سَأَلَ رَجُلٌ مِنَ الْمُسْلِمِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم كَيْفَ صَلاَةُ اللَّيْلِ فَقَالَ \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 76,
      "hadithNum_inBook": 1678,
      "title": "Sunan an-Nasa'i 1673",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَخْبَرَهُ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 77,
      "hadithNum_inBook": 1679,
      "title": "Sunan an-Nasa'i 1674",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ الْهَيْثَمِ، قَالَ حَدَّثَنَا حَرْمَلَةُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ ابْنَ شِهَابٍ، حَدَّثَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ وَحُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَاهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ صَلاَةُ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 78,
      "hadithNum_inBook": 1680,
      "title": "Sunan an-Nasa'i 1675",
      "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمٍ، - وَهُوَ ابْنُ ضَمْرَةَ - عَنْ عَلِيٍّ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ \n\" يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ وِتْرٌ يُحِبُّ الْوِتْرَ \" .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 79,
      "hadithNum_inBook": 1681,
      "title": "Sunan an-Nasa'i 1676",
      "arabic_text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، رضى الله عنه قَالَ الْوِتْرُ لَيْسَ بِحَتْمٍ كَهَيْئَةِ الْمَكْتُوبَةِ وَلَكِنَّهُ سُنَّةٌ سَنَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 80,
      "hadithNum_inBook": 1682,
      "title": "Sunan an-Nasa'i 1677",
      "arabic_text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ، وَمُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ، عَنِ النَّضْرِ بْنِ شُمَيْلٍ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ أَبِي شِمْرٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَوْصَانِي خَلِيلِي صلى الله عليه وسلم بِثَلاَثٍ النَّوْمِ عَلَى وِتْرٍ وَصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَىِ الضُّحَى .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 81,
      "hadithNum_inBook": 1683,
      "title": "Sunan an-Nasa'i 1678",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَوْصَانِي خَلِيلِي صلى الله عليه وسلم بِثَلاَثٍ الْوِتْرِ أَوَّلَ اللَّيْلِ وَرَكْعَتَىِ الْفَجْرِ وَصَوْمِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 82,
      "hadithNum_inBook": 1684,
      "title": "Sunan an-Nasa'i 1679",
      "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ مُلاَزِمِ بْنِ عَمْرٍو، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَدْرٍ، عَنْ قَيْسِ بْنِ طَلْقٍ، قَالَ زَارَنَا أَبِي طَلْقُ بْنُ عَلِيٍّ فِي يَوْمٍ مِنْ رَمَضَانَ فَأَمْسَى بِنَا وَقَامَ بِنَا تِلْكَ اللَّيْلَةَ وَأَوْتَرَ بِنَا ثُمَّ انْحَدَرَ إِلَى مَسْجِدٍ فَصَلَّى بِأَصْحَابِهِ حَتَّى بَقِيَ الْوِتْرُ ثُمَّ قَدَّمَ رَجُلاً فَقَالَ لَهُ أَوْتِرْ بِهِمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \n\" لاَ وِتْرَانِ فِي لَيْلَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 83,
      "hadithNum_inBook": 1685,
      "title": "Sunan an-Nasa'i 1680",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ ثُمَّ يَقُومُ فَإِذَا كَانَ مِنَ السَّحَرِ أَوْتَرَ ثُمَّ أَتَى فِرَاشَهُ فَإِذَا كَانَ لَهُ حَاجَةٌ أَلَمَّ بِأَهْلِهِ فَإِذَا سَمِعَ الأَذَانَ وَثَبَ فَإِنْ كَانَ جُنُبًا أَفَاضَ عَلَيْهِ مِنَ الْمَاءِ وَإِلاَّ تَوَضَّأَ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 84,
      "hadithNum_inBook": 1686,
      "title": "Sunan an-Nasa'i 1681",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي حَصِينٍ، عَنْ يَحْيَى بْنِ وَثَّابٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ أَوَّلِهِ وَآخِرِهِ وَأَوْسَطِهِ وَانْتَهَى وَتْرُهُ إِلَى السَّحَرِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 85,
      "hadithNum_inBook": 1687,
      "title": "Sunan an-Nasa'i 1682",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، قَالَ مَنْ صَلَّى مِنَ اللَّيْلِ فَلْيَجْعَلْ آخِرَ صَلاَتِهِ وَتْرًا فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِذَلِكَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 86,
      "hadithNum_inBook": 1688,
      "title": "Sunan an-Nasa'i 1683",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ الْمُبَارَكِ - قَالَ حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمِ بْنِ أَبِي سَلاَّمٍ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي أَبُو نَضْرَةَ الْعَوَقِيُّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوَتْرِ فَقَالَ \n\" أَوْتِرُوا قَبْلَ الصُّبْحِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 87,
      "hadithNum_inBook": 1689,
      "title": "Sunan an-Nasa'i 1684",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا أَبُو إِسْمَاعِيلَ الْقَنَّادُ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" أَوْتِرُوا قَبْلَ الْفَجْرِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 88,
      "hadithNum_inBook": 1690,
      "title": "Sunan an-Nasa'i 1685",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ فِي مَسْجِدِ عَمْرِو بْنِ شُرَحْبِيلَ فَأُقِيمَتِ الصَّلاَةُ فَجَعَلُوا يَنْتَظِرُونَهُ فَجَاءَ فَقَالَ إِنِّي كُنْتُ أُوتِرُ . قَالَ وَسُئِلَ عَبْدُ اللَّهِ هَلْ بَعْدَ الأَذَانِ وَتْرٌ قَالَ نَعَمْ وَبَعْدَ الإِقَامَةِ . وَحَدَّثَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَامَ عَنِ الصَّلاَةِ حَتَّى طَلَعَتِ الشَّمْسُ ثُمَّ صَلَّى .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 89,
      "hadithNum_inBook": 1691,
      "title": "Sunan an-Nasa'i 1686",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الرَّاحِلَةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 90,
      "hadithNum_inBook": 1692,
      "title": "Sunan an-Nasa'i 1687",
      "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنِ الْحَسَنِ بْنِ الْحُرِّ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يُوتِرُ عَلَى بَعِيرِهِ وَيَذْكُرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 91,
      "hadithNum_inBook": 1693,
      "title": "Sunan an-Nasa'i 1688",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ سَعِيدِ بْنِ يَسَارٍ، قَالَ قَالَ لِي ابْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 92,
      "hadithNum_inBook": 1694,
      "title": "Sunan an-Nasa'i 1689",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَبِي مِجْلَزٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" الْوَتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 93,
      "hadithNum_inBook": 1695,
      "title": "Sunan an-Nasa'i 1690",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، وَمُحَمَّدٌ، قَالاَ حَدَّثَنَا ثُمَّ، ذَكَرَ كَلِمَةً مَعْنَاهَا شُعْبَةُ عَنْ قَتَادَةَ، عَنْ أَبِي مِجْلَزٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" الْوَتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 94,
      "hadithNum_inBook": 1696,
      "title": "Sunan an-Nasa'i 1691",
      "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، عَنْ عَفَّانَ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، مِنْ أَهْلِ الْبَادِيَةِ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ قَالَ \n\" مَثْنَى مَثْنَى وَالْوَتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 95,
      "hadithNum_inBook": 1697,
      "title": "Sunan an-Nasa'i 1692",
      "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ بِوَاحِدَةٍ تُوتِرُ لَكَ مَا قَدْ صَلَّيْتَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 96,
      "hadithNum_inBook": 1698,
      "title": "Sunan an-Nasa'i 1693",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا خَالِدُ بْنُ زِيَادٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى وَالْوَتْرُ رَكْعَةٌ وَاحِدَةٌ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 97,
      "hadithNum_inBook": 1699,
      "title": "Sunan an-Nasa'i 1694",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 98,
      "hadithNum_inBook": 1700,
      "title": "Sunan an-Nasa'i 1695",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ الْمُبَارَكِ - قَالَ حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَنَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَمِعَهُ يَقُولُ \n\" صَلاَةُ اللَّيْلِ رَكْعَتَيْنِ رَكْعَتَيْنِ فَإِذَا خِفْتُمُ الصُّبْحَ فَأَوْتِرُوا بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 99,
      "hadithNum_inBook": 1701,
      "title": "Sunan an-Nasa'i 1696",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 100,
      "hadithNum_inBook": 1702,
      "title": "Sunan an-Nasa'i 1697",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَأَلَ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ قَالَتْ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزِيدُ فِي رَمَضَانَ وَلاَ غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلاَثًا قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ \n\" يَا عَائِشَةُ إِنَّ عَيْنِي تَنَامُ وَلاَ يَنَامُ قَلْبِي \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 101,
      "hadithNum_inBook": 1703,
      "title": "Sunan an-Nasa'i 1698",
      "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ، حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يُسَلِّمُ فِي رَكْعَتَىِ الْوَتْرِ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 102,
      "hadithNum_inBook": 1704,
      "title": "Sunan an-Nasa'i 1699",
      "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ، قَالَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ، عَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِثَلاَثِ رَكَعَاتٍ كَانَ يَقْرَأُ فِي الأُولَى بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَفِي الثَّانِيَةِ بِـ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَفِي الثَّالِثَةِ بِـ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَيَقْنُتُ قَبْلَ الرُّكُوعِ فَإِذَا فَرَغَ قَالَ عِنْدَ فَرَاغِهِ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ يُطِيلُ فِي آخِرِهِنَّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 103,
      "hadithNum_inBook": 1705,
      "title": "Sunan an-Nasa'i 1700",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الرَّكْعَةِ الأُولَى مِنَ الْوَتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَفِي الثَّانِيَةِ بِـ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَفِي الثَّالِثَةِ بِـ { قُلْ هُوَ اللَّهُ أَحَدٌ }",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 104,
      "hadithNum_inBook": 1706,
      "title": "Sunan an-Nasa'i 1701",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى، قَالَ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْوَتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَفِي الرَّكْعَةِ الثَّانِيَةِ بِـ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَفِي الثَّالِثَةِ بِـ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَلاَ يُسَلِّمُ إِلاَّ فِي آخِرِهِنَّ وَيَقُولُ يَعْنِي بَعْدَ التَّسْلِيمِ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 105,
      "hadithNum_inBook": 1707,
      "title": "Sunan an-Nasa'i 1702",
      "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَائِدَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِثَلاَثٍ يَقْرَأُ فِي الأُولَى بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَفِي الثَّانِيَةِ بِـ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَفِي الثَّالِثَةِ بِـ { قُلْ هُوَ اللَّهُ أَحَدٌ } أَوْقَفَهُ زُهَيْرٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 106,
      "hadithNum_inBook": 1708,
      "title": "Sunan an-Nasa'i 1703",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ كَانَ يُوتِرُ بِثَلاَثٍ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ }",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 107,
      "hadithNum_inBook": 1709,
      "title": "Sunan an-Nasa'i 1704",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَامَ مِنَ اللَّيْلِ فَاسْتَنَّ ثُمَّ صَلَّى رَكْعَتَيْنِ ثُمَّ نَامَ ثُمَّ قَامَ فَاسْتَنَّ ثُمَّ تَوَضَّأَ فَصَلَّى رَكْعَتَيْنِ حَتَّى صَلَّى سِتًّا ثُمَّ أَوْتَرَ بِثَلاَثٍ وَصَلَّى رَكْعَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 108,
      "hadithNum_inBook": 1710,
      "title": "Sunan an-Nasa'i 1705",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ حُصَيْنٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ فَتَوَضَّأَ وَاسْتَاكَ وَهُوَ يَقْرَأُ هَذِهِ الآيَةَ حَتَّى فَرَغَ مِنْهَا { إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لأُولِي الأَلْبَابِ } ثُمَّ صَلَّى رَكْعَتَيْنِ ثُمَّ عَادَ فَنَامَ حَتَّى سَمِعْتُ نَفْخَهُ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَاكَ ثُمَّ صَلَّى رَكْعَتَيْنِ ثُمَّ نَامَ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَاكَ وَصَلَّى رَكْعَتَيْنِ وَأَوْتَرَ بِثَلاَثٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 109,
      "hadithNum_inBook": 1711,
      "title": "Sunan an-Nasa'i 1706",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ جَبَلَةَ، قَالَ حَدَّثَنَا مَعْمَرُ بْنُ مَخْلَدٍ، - ثِقَةٌ - قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو، عَنْ زَيْدٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاسْتَنَّ وَسَاقَ الْحَدِيثَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 110,
      "hadithNum_inBook": 1712,
      "title": "Sunan an-Nasa'i 1707",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ ثَمَانِ رَكَعَاتٍ وَيُوتِرُ بِثَلاَثٍ وَيُصَلِّي رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ . خَالَفَهُ عَمْرُو بْنُ مُرَّةَ فَرَوَاهُ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ أُمِّ سَلَمَةَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 111,
      "hadithNum_inBook": 1713,
      "title": "Sunan an-Nasa'i 1708",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِثَلاَثِ عَشْرَةَ رَكْعَةً فَلَمَّا كَبِرَ وَضَعُفَ أَوْتَرَ بِتِسْعٍ . خَالَفَهُ عُمَارَةُ بْنُ عُمَيْرٍ فَرَوَاهُ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَائِشَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 112,
      "hadithNum_inBook": 1714,
      "title": "Sunan an-Nasa'i 1709",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ تِسْعًا فَلَمَّا أَسَنَّ وَثَقُلَ صَلَّى سَبْعًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 113,
      "hadithNum_inBook": 1715,
      "title": "Sunan an-Nasa'i 1710",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنِي ضُبَارَةُ بْنُ أَبِي السَّلِيلِ، قَالَ حَدَّثَنِي دُوَيْدُ بْنُ نَافِعٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ، عَنْ أَبِي أَيُّوبَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" الْوِتْرُ حَقٌّ فَمَنْ شَاءَ أَوْتَرَ بِسَبْعٍ وَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلاَثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 114,
      "hadithNum_inBook": 1716,
      "title": "Sunan an-Nasa'i 1711",
      "arabic_text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزِيدٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ يَزِيدَ، عَنْ أَبِي أَيُّوبَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" الْوِتْرُ حَقٌّ فَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلاَثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 115,
      "hadithNum_inBook": 1717,
      "title": "Sunan an-Nasa'i 1712",
      "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ، قَالَ حَدَّثَنِي أَبُو مُعَيْدٍ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ، أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الأَنْصَارِيَّ، يَقُولُ الْوِتْرُ حَقٌّ فَمَنْ أَحَبَّ أَنْ يُوتِرَ بِخَمْسِ رَكَعَاتٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِثَلاَثٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِوَاحِدَةٍ فَلْيَفْعَلْ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 116,
      "hadithNum_inBook": 1718,
      "title": "Sunan an-Nasa'i 1713",
      "arabic_text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي أَيُّوبَ، قَالَ مَنْ شَاءَ أَوْتَرَ بِسَبْعٍ وَمَنْ شَاءَ أَوْتَرَ بِخَمْسٍ وَمَنْ شَاءَ أَوْتَرَ بِثَلاَثٍ وَمَنْ شَاءَ أَوْتَرَ بِوَاحِدَةٍ وَمَنْ شَاءَ أَوْمَأَ إِيمَاءً .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 117,
      "hadithNum_inBook": 1719,
      "title": "Sunan an-Nasa'i 1714",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِخَمْسٍ وَبِسَبْعٍ لاَ يَفْصِلُ بَيْنَهَا بِسَلاَمٍ وَلاَ بِكَلاَمٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 118,
      "hadithNum_inBook": 1720,
      "title": "Sunan an-Nasa'i 1715",
      "arabic_text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِسَبْعٍ أَوْ بِخَمْسٍ وَلاَ يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 119,
      "hadithNum_inBook": 1721,
      "title": "Sunan an-Nasa'i 1716",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ الْحُسَيْنِ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، قَالَ الْوَتْرُ سَبْعٌ فَلاَ أَقَلَّ مِنْ خَمْسٍ فَذَكَرْتُ ذَلِكَ لإِبْرَاهِيمَ فَقَالَ عَمَّنْ ذَكَرَهُ قُلْتُ لاَ أَدْرِي . قَالَ الْحَكَمُ فَحَجَجْتُ فَلَقِيتُ مِقْسَمًا فَقُلْتُ لَهُ عَمَّنْ قَالَ عَنِ الثِّقَةِ عَنْ عَائِشَةَ وَعَنْ مَيْمُونَةَ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 120,
      "hadithNum_inBook": 1722,
      "title": "Sunan an-Nasa'i 1717",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُوتِرُ بِخَمْسٍ وَلاَ يَجْلِسُ إِلاَّ فِي آخِرِهِنَّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 121,
      "hadithNum_inBook": 1723,
      "title": "Sunan an-Nasa'i 1718",
      "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أَسَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَخَذَ اللَّحْمَ صَلَّى سَبْعَ رَكَعَاتٍ لاَ يَقْعُدُ إِلاَّ فِي آخِرِهِنَّ وَصَلَّى رَكْعَتَيْنِ وَهُوَ قَاعِدٌ بَعْدَ مَا يُسَلِّمُ فَتِلْكَ تِسْعٌ يَا بُنَىَّ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى صَلاَةً أَحَبَّ أَنْ يُدَاوِمَ عَلَيْهَا . مُخْتَصَرٌ . خَالَفَهُ هِشَامٌ الدَّسْتَوَائِيُّ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 122,
      "hadithNum_inBook": 1724,
      "title": "Sunan an-Nasa'i 1719",
      "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَوْتَرَ بِتِسْعِ رَكَعَاتٍ لَمْ يَقْعُدْ إِلاَّ فِي الثَّامِنَةِ فَيَحْمَدُ اللَّهَ وَيَذْكُرُهُ وَيَدْعُو ثُمَّ يَنْهَضُ وَلاَ يُسَلِّمُ ثُمَّ يُصَلِّي التَّاسِعَةَ فَيَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمَةً يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَلَمَّا كَبِرَ وَضَعُفَ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ لاَ يَقْعُدُ إِلاَّ فِي السَّادِسَةِ ثُمَّ يَنْهَضُ وَلاَ يُسَلِّمُ فَيُصَلِّي السَّابِعَةَ ثُمَّ يُسَلِّمُ تَسْلِيمَةً ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 123,
      "hadithNum_inBook": 1725,
      "title": "Sunan an-Nasa'i 1720",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، عَنْ عَبْدَةَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ، قَالَتْ كُنَّا نُعِدُّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ عَزَّ وَجَلَّ لِمَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ فَيَسْتَاكُ وَيَتَوَضَّأُ وَيُصَلِّي تِسْعَ رَكَعَاتٍ لاَ يَجْلِسُ فِيهِنَّ إِلاَّ عِنْدَ الثَّامِنَةِ وَيَحْمَدُ اللَّهَ وَيُصَلِّي عَلَى نَبِيِّهِ صلى الله عليه وسلم وَيَدْعُو بَيْنَهُنَّ وَلاَ يُسَلِّمُ تَسْلِيمًا ثُمَّ يُصَلِّي التَّاسِعَةَ وَيَقْعُدُ وَذَكَرَ كَلِمَةً نَحْوَهَا وَيَحْمَدُ اللَّهَ وَيُصَلِّي عَلَى نَبِيِّهِ صلى الله عليه وسلم وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ قَاعِدٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 124,
      "hadithNum_inBook": 1726,
      "title": "Sunan an-Nasa'i 1721",
      "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، أَنَّ سَعْدَ بْنَ هِشَامِ بْنِ عَامِرٍ، لَمَّا أَنْ قَدِمَ، عَلَيْنَا أَخْبَرَنَا أَنَّهُ، أَتَى ابْنَ عَبَّاسٍ فَسَأَلَهُ عَنْ وَتْرِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَلاَ أَدُلُّكَ أَوْ أَلاَ أُنَبِّئُكَ بِأَعْلَمِ أَهْلِ الأَرْضِ بِوَتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قُلْتُ مَنْ قَالَ عَائِشَةُ . فَأَتَيْنَاهَا فَسَلَّمْنَا عَلَيْهَا وَدَخَلْنَا فَسَأَلْنَاهَا فَقُلْتُ أَنْبِئِينِي عَنْ وِتْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ عَزَّ وَجَلَّ مَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ ثُمَّ يُصَلِّي تِسْعَ رَكَعَاتٍ وَلاَ يَقْعُدُ فِيهِنَّ إِلاَّ فِي الثَّامِنَةِ فَيَحْمَدُ اللَّهَ وَيَذْكُرُهُ وَيَدْعُو ثُمَّ يَنْهَضُ وَلاَ يُسَلِّمُ ثُمَّ يُصَلِّي التَّاسِعَةَ فَيَجْلِسُ فَيَحْمَدُ اللَّهَ وَيَذْكُرُهُ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَىَّ فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ فَتِلْكَ تِسْعًا أَىْ بُنَىَّ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى صَلاَةً أَحَبَّ أَنْ يُدَاوِمَ عَلَيْهَا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 125,
      "hadithNum_inBook": 1727,
      "title": "Sunan an-Nasa'i 1722",
      "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، قَالَ أَخْبَرَنِي سَعْدُ بْنُ هِشَامٍ، عَنْ عَائِشَةَ، أَنَّهُ سَمِعَهَا تَقُولُ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِتِسْعِ رَكَعَاتٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَلَمَّا ضَعُفَ أَوْتَرَ بِسَبْعِ رَكَعَاتٍ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 126,
      "hadithNum_inBook": 1728,
      "title": "Sunan an-Nasa'i 1723",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِتِسْعٍ وَيَرْكَعُ رَكْعَتَيْنِ وَهُوَ جَالِسٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 127,
      "hadithNum_inBook": 1729,
      "title": "Sunan an-Nasa'i 1724",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ، - يَعْنِي مَوْلَى بَنِي هَاشِمٍ - قَالَ حَدَّثَنَا حُصَيْنُ بْنُ نَافِعٍ، قَالَ حَدَّثَنَا الْحَسَنُ، عَنْ سَعْدِ بْنِ هِشَامٍ، أَنَّهُ وَفَدَ عَلَى أُمِّ الْمُؤْمِنِينَ عَائِشَةَ فَسَأَلَهَا عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ يُصَلِّي مِنَ اللَّيْلِ ثَمَانَ رَكَعَاتٍ وَيُوتِرُ بِالتَّاسِعَةِ وَيُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ . مُخْتَصَرٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 128,
      "hadithNum_inBook": 1730,
      "title": "Sunan an-Nasa'i 1725",
      "arabic_text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي الأَحْوَصِ، عَنِ الأَعْمَشِ، أُرَاهُ عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 129,
      "hadithNum_inBook": 1731,
      "title": "Sunan an-Nasa'i 1726",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَالِكٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً وَيُوتِرُ مِنْهَا بِوَاحِدَةٍ ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 130,
      "hadithNum_inBook": 1732,
      "title": "Sunan an-Nasa'i 1727",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِثَلاَثَ عَشْرَةَ رَكْعَةً فَلَمَّا كَبِرَ وَضَعُفَ أَوْتَرَ بِتِسْعٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 131,
      "hadithNum_inBook": 1733,
      "title": "Sunan an-Nasa'i 1728",
      "arabic_text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي مِجْلَزٍ، أَنَّ أَبَا مُوسَى، كَانَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَصَلَّى الْعِشَاءَ رَكْعَتَيْنِ ثُمَّ قَامَ فَصَلَّى رَكْعَةً أَوْتَرَ بِهَا فَقَرَأَ فِيهَا بِمِائَةِ آيَةٍ مِنَ النِّسَاءِ ثُمَّ قَالَ مَا أَلَوْتُ أَنْ أَضَعَ قَدَمَىَّ حَيْثُ وَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدَمَيْهِ وَأَنَا أَقْرَأُ بِمَا قَرَأَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 132,
      "hadithNum_inBook": 1734,
      "title": "Sunan an-Nasa'i 1729",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ بْنِ إِشْكَابَ النَّسَائِيُّ، قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ، قَالَ حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ طَلْحَةَ، عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْوِتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } فَإِذَا سَلَّمَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 133,
      "hadithNum_inBook": 1735,
      "title": "Sunan an-Nasa'i 1730",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنِ الأَعْمَشِ، عَنْ زُبَيْدٍ، وَطَلْحَةَ، عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } خَالَفَهُمَا حُصَيْنٌ فَرَوَاهُ عَنْ ذَرٍّ عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 134,
      "hadithNum_inBook": 1736,
      "title": "Sunan an-Nasa'i 1731",
      "arabic_text": "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ، عَنْ حُصَيْنِ بْنِ نُمَيْرٍ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الْوِتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ }",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 135,
      "hadithNum_inBook": 1737,
      "title": "Sunan an-Nasa'i 1732",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، وَزُبَيْدٍ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَكَانَ يَقُولُ إِذَا سَلَّمَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا وَيَرْفَعُ صَوْتَهُ بِالثَّالِثَةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 136,
      "hadithNum_inBook": 1738,
      "title": "Sunan an-Nasa'i 1733",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي سَلَمَةُ، وَزُبَيْدٌ، عَنْ ذَرٍّ، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ عَبْدِ الرَّحْمَنِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الْوَتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } ثُمَّ يَقُولُ إِذَا سَلَّمَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . وَيَرْفَعُ بِـ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . صَوْتَهُ بِالثَّالِثَةِ . رَوَاهُ مَنْصُورٌ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ وَلَمْ يَذْكُرْ ذَرًّا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 137,
      "hadithNum_inBook": 1739,
      "title": "Sunan an-Nasa'i 1734",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَكَانَ إِذَا سَلَّمَ وَفَرَغَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا طَوَّلَ فِي الثَّالِثَةِ . وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ زُبَيْدٍ وَلَمْ يَذْكُرْ ذَرًّا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 138,
      "hadithNum_inBook": 1740,
      "title": "Sunan an-Nasa'i 1735",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ زُبَيْدٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَرَوَاهُ مُحَمَّدُ بْنُ جُحَادَةَ عَنْ زُبَيْدٍ وَلَمْ يَذْكُرْ ذَرًّا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 139,
      "hadithNum_inBook": 1741,
      "title": "Sunan an-Nasa'i 1736",
      "arabic_text": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ، عَنْ زُبَيْدٍ، عَنِ ابْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } فَإِذَا فَرَغَ مِنَ الصَّلاَةِ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 140,
      "hadithNum_inBook": 1742,
      "title": "Sunan an-Nasa'i 1737",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ، عَنْ مَالِكٍ، عَنْ زُبَيْدٍ، عَنِ ابْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْوِتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 141,
      "hadithNum_inBook": 1743,
      "title": "Sunan an-Nasa'i 1738",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ زُبَيْدٍ، عَنْ ذَرٍّ، عَنِ ابْنِ أَبْزَى، مُرْسَلٌ . وَقَدْ رَوَاهُ عَطَاءُ بْنُ السَّائِبِ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 142,
      "hadithNum_inBook": 1744,
      "title": "Sunan an-Nasa'i 1739",
      "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الْوِتْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ }",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 143,
      "hadithNum_inBook": 1745,
      "title": "Sunan an-Nasa'i 1740",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عَزْرَةَ، يُحَدِّثُ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } فَإِذَا فَرَغَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 144,
      "hadithNum_inBook": 1746,
      "title": "Sunan an-Nasa'i 1741",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } فَإِذَا فَرَغَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا وَيَمُدُّ فِي الثَّالِثَةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 145,
      "hadithNum_inBook": 1747,
      "title": "Sunan an-Nasa'i 1742",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ زُرَارَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } خَالَفَهُمَا شَبَابَةُ فَرَوَاهُ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 146,
      "hadithNum_inBook": 1748,
      "title": "Sunan an-Nasa'i 1743",
      "arabic_text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا شَبَابَةُ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَوْتَرَ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } . قَالَ أَبُو عَبْدِ الرَّحْمَنِ لاَ أَعْلَمُ أَحَدًا تَابَعَ شَبَابَةَ عَلَى هَذَا الْحَدِيثِ . خَالَفَهُ يَحْيَى بْنُ سَعِيدٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 147,
      "hadithNum_inBook": 1749,
      "title": "Sunan an-Nasa'i 1744",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ فَقَرَأَ رَجُلٌ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } فَلَمَّا صَلَّى قَالَ \" مَنْ قَرَأَ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } \" . قَالَ رَجُلٌ أَنَا . قَالَ \" قَدْ عَلِمْتُ أَنَّ بَعْضَهُمْ خَالَجَنِيهَا \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 148,
      "hadithNum_inBook": 1750,
      "title": "Sunan an-Nasa'i 1745",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ بُرَيْدٍ، عَنْ أَبِي الْحَوْرَاءِ، قَالَ قَالَ الْحَسَنُ عَلَّمَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم كَلِمَاتٍ أَقُولُهُنَّ فِي الْوَتْرِ فِي الْقُنُوتِ \n\" اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ إِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ وَإِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 149,
      "hadithNum_inBook": 1751,
      "title": "Sunan an-Nasa'i 1746",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَلِيٍّ، عَنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ عَلَّمَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم هَؤُلاَءِ الْكَلِمَاتِ فِي الْوَتْرِ قَالَ \n\" اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ وَإِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ وَصَلَّى اللَّهُ عَلَى النَّبِيِّ مُحَمَّدٍ \" .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 150,
      "hadithNum_inBook": 1752,
      "title": "Sunan an-Nasa'i 1747",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَهِشَامُ بْنُ عَبْدِ الْمَلِكِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ هِشَامِ بْنِ عَمْرٍو الْفَزَارِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ فِي آخِرِ وِتْرِهِ \n\" اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 151,
      "hadithNum_inBook": 1753,
      "title": "Sunan an-Nasa'i 1748",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ شُعْبَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَرْفَعُ يَدَيْهِ فِي شَىْءٍ مِنْ دُعَائِهِ إِلاَّ فِي الاِسْتِسْقَاءِ . قَالَ شُعْبَةُ فَقُلْتُ لِثَابِتٍ أَنْتَ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ سُبْحَانَ اللَّهِ . قُلْتُ سَمِعْتَهُ قَالَ سُبْحَانَ اللَّهِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 152,
      "hadithNum_inBook": 1754,
      "title": "Sunan an-Nasa'i 1749",
      "arabic_text": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا لَيْثٌ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلاَةِ الْعِشَاءِ إِلَى الْفَجْرِ بِاللَّيْلِ سِوَى رَكْعَتَىِ الْفَجْرِ وَيَسْجُدُ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 153,
      "hadithNum_inBook": 1755,
      "title": "Sunan an-Nasa'i 1750",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا قَاسِمٌ، عَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَيَقُولُ بَعْدَ مَا يُسَلِّمُ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ يَرْفَعُ بِهَا صَوْتَهُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 154,
      "hadithNum_inBook": 1756,
      "title": "Sunan an-Nasa'i 1751",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ سُفْيَانَ الثَّوْرِيِّ، وَعَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ زُبَيْدٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَيَقُولُ بَعْدَ مَا يُسَلِّمُ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ يَرْفَعُ بِهَا صَوْتَهُ . خَالَفَهُمَا أَبُو نُعَيْمٍ فَرَوَاهُ عَنْ سُفْيَانَ عَنْ زُبَيْدٍ عَنْ ذَرٍّ عَنْ سَعِيدٍ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 155,
      "hadithNum_inBook": 1757,
      "title": "Sunan an-Nasa'i 1752",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي نُعَيْمٍ، عَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } فَإِذَا أَرَادَ أَنْ يَنْصَرِفَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثًا يَرْفَعُ بِهَا صَوْتَهُ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو نُعَيْمٍ أَثْبَتُ عِنْدَنَا مِنْ مُحَمَّدِ بْنِ عُبَيْدٍ وَمِنْ قَاسِمِ بْنِ يَزِيدَ وَأَثْبَتُ أَصْحَابِ سُفْيَانَ عِنْدَنَا وَاللَّهُ أَعْلَمُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ ثُمَّ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ ثُمَّ وَكِيعُ بْنُ الْجَرَّاحِ ثُمَّ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ثُمَّ أَبُو نُعَيْمٍ ثُمَّ الأَسْوَدُ فِي هَذَا الْحَدِيثِ . وَرَوَاهُ جَرِيرُ بْنُ حَازِمٍ عَنْ زُبَيْدٍ فَقَالَ يَمُدُّ صَوْتَهُ فِي الثَّالِثَةِ وَيَرْفَعُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 156,
      "hadithNum_inBook": 1758,
      "title": "Sunan an-Nasa'i 1753",
      "arabic_text": "أَخْبَرَنَا حَرَمِيُّ بْنُ يُونُسَ بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا جَرِيرٌ، قَالَ سَمِعْتُ زُبَيْدًا، يُحَدِّثُ عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَإِذَا سَلَّمَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . ثَلاَثَ مَرَّاتٍ يَمُدُّ صَوْتَهُ فِي الثَّالِثَةِ ثُمَّ يَرْفَعُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 157,
      "hadithNum_inBook": 1759,
      "title": "Sunan an-Nasa'i 1754",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى } وَ { قُلْ يَا أَيُّهَا الْكَافِرُونَ } وَ { قُلْ هُوَ اللَّهُ أَحَدٌ } وَإِذَا فَرَغَ قَالَ \" سُبْحَانَ الْمَلِكِ الْقُدُّوسِ \" . أَرْسَلَهُ هِشَامٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 158,
      "hadithNum_inBook": 1760,
      "title": "Sunan an-Nasa'i 1755",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلُ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي عَامِرٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُوتِرُ . وَسَاقَ الْحَدِيثَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 159,
      "hadithNum_inBook": 1761,
      "title": "Sunan an-Nasa'i 1756",
      "arabic_text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ الْمُبَارَكِ الصُّورِيَّ - قَالَ حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ اللَّيْلِ فَقَالَتْ كَانَ يُصَلِّي ثَلاَثَ عَشْرَةَ رَكْعَةً تِسْعَ رَكَعَاتٍ قَائِمًا يُوتِرُ فِيهَا وَرَكْعَتَيْنِ جَالِسًا فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ وَسَجَدَ وَيَفْعَلُ ذَلِكَ بَعْدَ الْوَتْرِ فَإِذَا سَمِعَ نِدَاءَ الصُّبْحِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 160,
      "hadithNum_inBook": 1762,
      "title": "Sunan an-Nasa'i 1757",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَدَعُ أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ . خَالَفَهُ عَامَّةُ أَصْحَابِ شُعْبَةَ مِمَّنْ رَوَى هَذَا الْحَدِيثَ فَلَمْ يَذْكُرُوا مَسْرُوقًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 161,
      "hadithNum_inBook": 1763,
      "title": "Sunan an-Nasa'i 1758",
      "arabic_text": "أَخْبَرَنِي أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَ أَبَاهُ، يُحَدِّثُ أَنَّهُ سَمِعَ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الصُّبْحِ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الصَّوَابُ عِنْدَنَا وَحَدِيثُ عُثْمَانَ بْنِ عُمَرَ خَطَأٌ وَاللَّهُ تَعَالَى أَعْلَمُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 162,
      "hadithNum_inBook": 1764,
      "title": "Sunan an-Nasa'i 1759",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدَةُ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 163,
      "hadithNum_inBook": 1765,
      "title": "Sunan an-Nasa'i 1760",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا نُودِيَ لِصَلاَةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلاَةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 164,
      "hadithNum_inBook": 1766,
      "title": "Sunan an-Nasa'i 1761",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَخْبَرَتْنِي حَفْصَةُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَضَاءَ لَهُ الْفَجْرُ صَلَّى رَكْعَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 165,
      "hadithNum_inBook": 1767,
      "title": "Sunan an-Nasa'i 1762",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَكَتَ الْمُؤَذِّنُ بِالأُولَى مِنْ صَلاَةِ الْفَجْرِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ بَعْدَ أَنْ يَتَبَيَّنَ الْفَجْرُ ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 166,
      "hadithNum_inBook": 1768,
      "title": "Sunan an-Nasa'i 1763",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" لاَ تَكُنْ مِثْلَ فُلاَنٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 167,
      "hadithNum_inBook": 1769,
      "title": "Sunan an-Nasa'i 1764",
      "arabic_text": "أَخْبَرَنَا الْحَارِثُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ بْنِ ثَوْبَانَ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" لاَ تَكُنْ يَا عَبْدَ اللَّهِ مِثْلَ فُلاَنٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 168,
      "hadithNum_inBook": 1770,
      "title": "Sunan an-Nasa'i 1765",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْبَصْرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ قَرَأْتُ عَلَى عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ نَافِعٍ، عَنْ صَفِيَّةَ، عَنْ حَفْصَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يُصَلِّي رَكْعَتَىِ الْفَجْرِ رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 169,
      "hadithNum_inBook": 1771,
      "title": "Sunan an-Nasa'i 1766",
      "arabic_text": "أَخْبَرَنَا شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ أَنْبَأَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَنِي نَافِعٌ، قَالَ حَدَّثَنِي ابْنُ عُمَرَ، قَالَ حَدَّثَتْنِي حَفْصَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْكَعُ رَكْعَتَيْنِ خَفِيفَتَيْنِ بَيْنَ النِّدَاءِ وَالإِقَامَةِ مِنْ صَلاَةِ الْفَجْرِ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ كِلاَ الْحَدِيثَيْنِ عِنْدَنَا خَطَأٌ وَاللَّهُ تَعَالَى أَعْلَمُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 170,
      "hadithNum_inBook": 1772,
      "title": "Sunan an-Nasa'i 1767",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا يَحْيَى، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَرْكَعُ بَيْنَ النِّدَاءِ وَالصَّلاَةِ رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 171,
      "hadithNum_inBook": 1773,
      "title": "Sunan an-Nasa'i 1768",
      "arabic_text": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ حَمْزَةَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ هُوَ وَنَافِعٌ عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي بَيْنَ النِّدَاءِ وَالإِقَامَةِ رَكْعَتَيْنِ خَفِيفَتَيْنِ رَكْعَتَىِ الْفَجْرِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 172,
      "hadithNum_inBook": 1774,
      "title": "Sunan an-Nasa'i 1769",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي نَافِعٌ، أَنَّ ابْنَ عُمَرَ، حَدَّثَهُ أَنَّ حَفْصَةَ حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ بَيْنَ النِّدَاءِ وَالإِقَامَةِ مِنْ صَلاَةِ الصُّبْحِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 173,
      "hadithNum_inBook": 1775,
      "title": "Sunan an-Nasa'i 1770",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، قَالَ إِسْمَاعِيلُ حَدَّثَنَا عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ أَخْبَرَتْنِي حَفْصَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الصُّبْحِ رَكْعَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 174,
      "hadithNum_inBook": 1776,
      "title": "Sunan an-Nasa'i 1771",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ أَنْبَأَنَا إِسْحَاقُ بْنُ الْفُرَاتِ، عَنْ يَحْيَى بْنِ أَيُّوبَ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَنْبَأَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا نُودِيَ لِصَلاَةِ الصُّبْحِ سَجَدَ سَجْدَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 175,
      "hadithNum_inBook": 1777,
      "title": "Sunan an-Nasa'i 1772",
      "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِسْحَاقَ، عَنْ أَبِي عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 176,
      "hadithNum_inBook": 1778,
      "title": "Sunan an-Nasa'i 1773",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ حَفْصَةَ أُمَّ الْمُؤْمِنِينَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ مِنَ الأَذَانِ لِصَلاَةِ الصُّبْحِ وَبَدَا الصُّبْحُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلاَةُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 177,
      "hadithNum_inBook": 1779,
      "title": "Sunan an-Nasa'i 1774",
      "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ حَدَّثَتْنِي أُخْتِي، حَفْصَةُ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْفَجْرِ رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 178,
      "hadithNum_inBook": 1780,
      "title": "Sunan an-Nasa'i 1775",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي رَكْعَتَيْنِ إِذَا طَلَعَ الْفَجْرُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 179,
      "hadithNum_inBook": 1781,
      "title": "Sunan an-Nasa'i 1776",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زَيْدِ بْنِ مُحَمَّدٍ، قَالَ سَمِعْتُ نَافِعًا، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا طَلَعَ الْفَجْرُ لاَ يُصَلِّي إِلاَّ رَكْعَتَيْنِ خَفِيفَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 180,
      "hadithNum_inBook": 1782,
      "title": "Sunan an-Nasa'i 1777",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا نُودِيَ لِصَلاَةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلاَةِ . وَرَوَى سَالِمٌ عَنِ ابْنِ عُمَرَ عَنْ حَفْصَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 181,
      "hadithNum_inBook": 1783,
      "title": "Sunan an-Nasa'i 1778",
      "arabic_text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، قَالَ ابْنُ عُمَرَ أَخْبَرَتْنِي حَفْصَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْكَعُ رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَذَلِكَ بَعْدَ مَا يَطْلُعُ الْفَجْرُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 182,
      "hadithNum_inBook": 1784,
      "title": "Sunan an-Nasa'i 1779",
      "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ أَخْبَرَتْنِي حَفْصَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَضَاءَ لَهُ الْفَجْرُ صَلَّى رَكْعَتَيْنِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 183,
      "hadithNum_inBook": 1785,
      "title": "Sunan an-Nasa'i 1780",
      "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنْ أَبِي عَمْرٍو، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ بَيْنَ النِّدَاءِ وَالإِقَامَةِ مِنْ صَلاَةِ الْفَجْرِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 184,
      "hadithNum_inBook": 1786,
      "title": "Sunan an-Nasa'i 1781",
      "arabic_text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ قَالَتْ كَانَ يُصَلِّي ثَلاَثَ عَشْرَةَ رَكْعَةً يُصَلِّي ثَمَانَ رَكَعَاتٍ ثُمَّ يُوتِرُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ وَيُصَلِّي رَكْعَتَيْنِ بَيْنَ الأَذَانِ وَالإِقَامَةِ فِي صَلاَةِ الصُّبْحِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 185,
      "hadithNum_inBook": 1787,
      "title": "Sunan an-Nasa'i 1782",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي رَكْعَتَىِ الْفَجْرِ إِذَا سَمِعَ الأَذَانَ وَيُخَفِّفُهُمَا . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا حَدِيثٌ مُنْكَرٌ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 186,
      "hadithNum_inBook": 1788,
      "title": "Sunan an-Nasa'i 1783",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ أَنْبَأَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّ شُرَيْحًا الْحَضْرَمِيَّ، ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" ذَاكَ رَجُلٌ لاَ يَتَوَسَّدُ الْقُرْآنَ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 187,
      "hadithNum_inBook": 1789,
      "title": "Sunan an-Nasa'i 1784",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ رَجُلٍ، عِنْدَهُ رِضًا أَخْبَرَهُ أَنَّ عَائِشَةَ رضى الله عنها أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" مَا مِنِ امْرِئٍ تَكُونُ لَهُ صَلاَةٌ بِلَيْلٍ فَغَلَبَهُ عَلَيْهَا نَوْمٌ إِلاَّ كَتَبَ اللَّهُ لَهُ أَجْرَ صَلاَتِهِ وَكَانَ نَوْمُهُ صَدَقَةً عَلَيْهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 188,
      "hadithNum_inBook": 1790,
      "title": "Sunan an-Nasa'i 1785",
      "arabic_text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ كَانَتْ لَهُ صَلاَةٌ صَلاَّهَا مِنَ اللَّيْلِ فَنَامَ عَنْهَا كَانَ ذَلِكَ صَدَقَةً تَصَدَّقَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِ وَكَتَبَ لَهُ أَجْرَ صَلاَتِهِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 189,
      "hadithNum_inBook": 1791,
      "title": "Sunan an-Nasa'i 1786",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فَذَكَرَ نَحْوَهُ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو جَعْفَرٍ الرَّازِيُّ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 190,
      "hadithNum_inBook": 1792,
      "title": "Sunan an-Nasa'i 1787",
      "arabic_text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، عَنْ أَبِي الدَّرْدَاءِ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" مَنْ أَتَى فِرَاشَهُ وَهُوَ يَنْوِي أَنْ يَقُومَ يُصَلِّي مِنَ اللَّيْلِ فَغَلَبَتْهُ عَيْنَاهُ حَتَّى أَصْبَحَ كُتِبَ لَهُ مَا نَوَى وَكَانَ نَوْمُهُ صَدَقَةً عَلَيْهِ مِنْ رَبِّهِ عَزَّ وَجَلَّ \" . خَالَفَهُ سُفْيَانُ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 191,
      "hadithNum_inBook": 1793,
      "title": "Sunan an-Nasa'i 1788",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ عَبْدَةَ، قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ، عَنْ أَبِي ذَرٍّ، وَأَبِي الدَّرْدَاءِ، مَوْقُوفًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 192,
      "hadithNum_inBook": 1794,
      "title": "Sunan an-Nasa'i 1789",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا لَمْ يُصَلِّ مِنَ اللَّيْلِ مَنَعَهُ مِنْ ذَلِكَ نَوْمٌ أَوْ وَجَعٌ صَلَّى مِنَ النَّهَارِ ثِنْتَىْ عَشْرَةَ رَكْعَةً .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 193,
      "hadithNum_inBook": 1795,
      "title": "Sunan an-Nasa'i 1790",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، وَعُبَيْدَ اللَّهِ، أَخْبَرَاهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَىْءٍ مِنْهُ فَقَرَأَهُ فِيمَا بَيْنَ صَلاَةِ الْفَجْرِ وَصَلاَةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ \" .",
      "grade": "none"
    },
    {
      "hadithNum_inChapter": 194,
      "hadithNum_inBook": 1796,
      "title": "Sunan an-Nasa'i 1791",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ نَامَ عَنْ حِزْبِهِ - أَوْ قَالَ جُزْئِهِ - مِنَ اللَّيْلِ فَقَرَأَهُ فِيمَا بَيْنَ صَلاَةِ الصُّبْحِ إِلَى صَلاَةِ الظُّهْرِ فَكَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 195,
      "hadithNum_inBook": 1797,
      "title": "Sunan an-Nasa'i 1792",
      "arabic_text": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ فَاتَهُ حِزْبُهُ مِنَ اللَّيْلِ فَقَرَأَهُ حِينَ تَزُولُ الشَّمْسُ إِلَى صَلاَةِ الظُّهْرِ فَإِنَّهُ لَمْ يَفُتْهُ أَوْ كَأَنَّهُ أَدْرَكَهُ . رَوَاهُ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مَوْقُوفًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 196,
      "hadithNum_inBook": 1798,
      "title": "Sunan an-Nasa'i 1793",
      "arabic_text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُمَرَ، قَالَ مَنْ فَاتَهُ وِرْدُهُ مِنَ اللَّيْلِ فَلْيَقْرَأْهُ فِي صَلاَةٍ قَبْلَ الظُّهْرِ فَإِنَّهَا تَعْدِلُ صَلاَةَ اللَّيْلِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 197,
      "hadithNum_inBook": 1799,
      "title": "Sunan an-Nasa'i 1794",
      "arabic_text": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُغِيرَةُ بْنُ زِيَادٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ ثَابَرَ عَلَى اثْنَتَىْ عَشْرَةَ رَكْعَةً فِي الْيَوْمِ وَاللَّيْلَةِ دَخَلَ الْجَنَّةَ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 198,
      "hadithNum_inBook": 1800,
      "title": "Sunan an-Nasa'i 1795",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا أَبُو يَحْيَى، إِسْحَاقُ بْنُ سُلَيْمَانَ الرَّازِيُّ عَنِ الْمُغِيرَةِ بْنِ زِيَادٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَائِشَةَ، رضى الله عنها عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" مَنْ ثَابَرَ عَلَى اثْنَتَىْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ \" .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 199,
      "hadithNum_inBook": 1801,
      "title": "Sunan an-Nasa'i 1796",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، قَالَ حَدَّثَنَا مَعْقِلٌ، عَنْ عَطَاءٍ، قَالَ أُخْبِرْتُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \n\" مَنْ رَكَعَ ثِنْتَىْ عَشْرَةَ رَكْعَةً فِي يَوْمِهِ وَلَيْلَتِهِ سِوَى الْمَكْتُوبَةِ بَنَى اللَّهُ لَهُ بِهَا بَيْتًا فِي الْجَنَّةِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 200,
      "hadithNum_inBook": 1802,
      "title": "Sunan an-Nasa'i 1797",
      "arabic_text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ بَلَغَنِي أَنَّكَ تَرْكَعُ قَبْلَ الْجُمُعَةِ اثْنَتَىْ عَشْرَةَ رَكْعَةً مَا بَلَغَكَ فِي ذَلِكَ قَالَ أَخْبَرَتْ أُمُّ حَبِيبَةَ عَنْبَسَةَ بْنَ أَبِي سُفْيَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \n\" مَنْ رَكَعَ اثْنَتَىْ عَشْرَةَ رَكْعَةً فِي الْيَوْمِ وَاللَّيْلَةِ سِوَى الْمَكْتُوبَةِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 201,
      "hadithNum_inBook": 1803,
      "title": "Sunan an-Nasa'i 1798",
      "arabic_text": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ، قَالَ أَنْبَأَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا زَيْدُ بْنُ حِبَّانَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \n\" مَنْ صَلَّى فِي يَوْمٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ عَطَاءٌ لَمْ يَسْمَعْهُ مِنْ عَنْبَسَةَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 202,
      "hadithNum_inBook": 1804,
      "title": "Sunan an-Nasa'i 1799",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ سَعِيدٍ الطَّائِفِيُّ، قَالَ حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ قَدِمْتُ الطَّائِفَ فَدَخَلْتُ عَلَى عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ وَهُوَ بِالْمَوْتِ فَرَأَيْتُ مِنْهُ جَزَعًا فَقُلْتُ إِنَّكَ عَلَى خَيْرٍ . فَقَالَ أَخْبَرَتْنِي أُخْتِي أُمُّ حَبِيبَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" مَنْ صَلَّى ثِنْتَىْ عَشْرَةَ رَكْعَةً بِالنَّهَارِ أَوْ بِاللَّيْلِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ \" . خَالَفَهُمْ أَبُو يُونُسَ الْقُشَيْرِيُّ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 203,
      "hadithNum_inBook": 1805,
      "title": "Sunan an-Nasa'i 1800",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حَبَّانُ، وَمُحَمَّدُ بْنُ مَكِّيٍّ، قَالاَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ أَبِي يُونُسَ الْقُشَيْرِيِّ، عَنِ ابْنِ أَبِي رَبَاحٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، حَدَّثَهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ، قَالَتْ مَنْ صَلَّى ثِنْتَىْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ فَصَلَّى قَبْلَ الظُّهْرِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 204,
      "hadithNum_inBook": 1806,
      "title": "Sunan an-Nasa'i 1801",
      "arabic_text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا أَبُو الأَسْوَدِ، قَالَ حَدَّثَنِي بَكْرُ بْنُ مُضَرَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" اثْنَتَا عَشْرَةَ رَكْعَةً مَنْ صَلاَّهُنَّ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْعَصْرِ وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 205,
      "hadithNum_inBook": 1807,
      "title": "Sunan an-Nasa'i 1802",
      "arabic_text": "أَخْبَرَنَا أَبُو الأَزْهَرِ، أَحْمَدُ بْنُ الأَزْهَرِ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْمُسَيَّبِ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ صَلَّى اثْنَتَىْ عَشْرَةَ رَكْعَةً بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ أَرْبَعًا قَبْلَ الظُّهْرِ وَاثْنَتَيْنِ بَعْدَهَا وَاثْنَتَيْنِ قَبْلَ الْعَصْرِ وَاثْنَتَيْنِ بَعْدَ الْمَغْرِبِ وَاثْنَتَيْنِ قَبْلَ الصُّبْحِ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ فُلَيْحُ بْنُ سُلَيْمَانَ لَيْسَ بِالْقَوِيِّ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 206,
      "hadithNum_inBook": 1808,
      "title": "Sunan an-Nasa'i 1803",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ أَنْبَأَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ عَنْبَسَةَ، أَخِي أُمِّ حَبِيبَةَ عَنْ أُمِّ حَبِيبَةَ، قَالَتْ مَنْ صَلَّى فِي الْيَوْمِ وَاللَّيْلَةِ ثِنْتَىْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَهَا وَثِنْتَيْنِ قَبْلَ الْعَصْرِ وَثِنْتَيْنِ بَعْدَ الْمَغْرِبِ وَثِنْتَيْنِ قَبْلَ الْفَجْرِ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 207,
      "hadithNum_inBook": 1809,
      "title": "Sunan an-Nasa'i 1804",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" مَنْ صَلَّى فِي الْيَوْمِ وَاللَّيْلَةِ ثِنْتَىْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 208,
      "hadithNum_inBook": 1810,
      "title": "Sunan an-Nasa'i 1805",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ مَنْ صَلَّى فِي اللَّيْلِ وَالنَّهَارِ ثِنْتَىْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 209,
      "hadithNum_inBook": 1811,
      "title": "Sunan an-Nasa'i 1806",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مَكِّيٍّ، وَحِبَّانُ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ إِسْمَاعِيلَ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً سِوَى الْمَكْتُوبَةِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ . لَمْ يَرْفَعْهُ حُصَيْنٌ وَأَدْخَلَ بَيْنَ عَنْبَسَةَ وَبَيْنَ الْمُسَيَّبِ ذَكْوَانَ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 210,
      "hadithNum_inBook": 1812,
      "title": "Sunan an-Nasa'i 1807",
      "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا وَهْبٌ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ حُصَيْنٍ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ أَبِي صَالِحٍ، ذَكْوَانَ قَالَ حَدَّثَنِي عَنْبَسَةُ بْنُ أَبِي سُفْيَانَ، أَنَّ أُمَّ حَبِيبَةَ، حَدَّثَتْهُ أَنَّهُ، مَنْ صَلَّى فِي يَوْمٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 211,
      "hadithNum_inBook": 1813,
      "title": "Sunan an-Nasa'i 1808",
      "arabic_text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ صَلَّى فِي يَوْمٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً سِوَى الْفَرِيضَةِ بَنَى اللَّهُ لَهُ أَوْ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 212,
      "hadithNum_inBook": 1814,
      "title": "Sunan an-Nasa'i 1809",
      "arabic_text": "أَخْبَرَنَا عَلِيُّ بْنُ الْمُثَنَّى، عَنْ سُوَيْدِ بْنِ عَمْرٍو، قَالَ حَدَّثَنِي حَمَّادٌ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أُمِّ حَبِيبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \n\" مَنْ صَلَّى ثِنْتَىْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ وَلَيْلَةٍ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 213,
      "hadithNum_inBook": 1815,
      "title": "Sunan an-Nasa'i 1810",
      "arabic_text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا النَّضْرُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ مَنْ صَلَّى فِي يَوْمٍ اثْنَتَىْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 214,
      "hadithNum_inBook": 1816,
      "title": "Sunan an-Nasa'i 1811",
      "arabic_text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" مَنْ صَلَّى فِي يَوْمٍ ثِنْتَىْ عَشْرَةَ رَكْعَةً سِوَى الْفَرِيضَةِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَمُحَمَّدُ بْنُ سُلَيْمَانَ ضَعِيفٌ هُوَ ابْنُ الأَصْبَهَانِيِّ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ أَوْجُهٍ سِوَى هَذَا الْوَجْهِ بِغَيْرِ اللَّفْظِ الَّذِي تَقَدَّمَ ذِكْرُهُ .",
      "grade": "Da'if (Darussalam)"
    },
    {
      "hadithNum_inChapter": 215,
      "hadithNum_inBook": 1817,
      "title": "Sunan an-Nasa'i 1812",
      "arabic_text": "أَخْبَرَنِي يَزِيدُ بْنُ مُحَمَّدِ بْنِ عَبْدِ الصَّمَدِ، قَالَ حَدَّثَنَا هِشَامٌ الْعَطَّارُ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ، عَنْ مُوسَى بْنِ أَعْيَنَ، عَنْ أَبِي عَمْرٍو الأَوْزَاعِيِّ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ، قَالَ لَمَّا نُزِلَ بِعَنْبَسَةَ جَعَلَ يَتَضَوَّرُ فَقِيلَ لَهُ فَقَالَ أَمَا إِنِّي سَمِعْتُ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم تُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ \n\" مَنْ رَكَعَ أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَ اللَّهُ عَزَّ وَجَلَّ لَحْمَهُ عَلَى النَّارِ \" . فَمَا تَرَكْتُهُنَّ مُنْذُ سَمِعْتُهُنَّ .",
      "grade": "Hasan (Darussalam)"
    },
    {
      "hadithNum_inChapter": 216,
      "hadithNum_inBook": 1818,
      "title": "Sunan an-Nasa'i 1813",
      "arabic_text": "أَخْبَرَنَا هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، قَالَ حَدَّثَنِي أَيُّوبُ، - رَجُلٌ مِنْ أَهْلِ الشَّامِ - عَنِ الْقَاسِمِ الدِّمَشْقِيِّ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، قَالَ أَخْبَرَتْنِي أُخْتِي أُمُّ حَبِيبَةَ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ حَبِيبَهَا أَبَا الْقَاسِمِ صلى الله عليه وسلم أَخْبَرَهَا قَالَ \n\" مَا مِنْ عَبْدٍ مُؤْمِنٍ يُصَلِّي أَرْبَعَ رَكَعَاتٍ بَعْدَ الظُّهْرِ فَتَمَسُّ وَجْهَهُ النَّارُ أَبَدًا إِنْ شَاءَ اللَّهُ عَزَّ وَجَلَّ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 217,
      "hadithNum_inBook": 1819,
      "title": "Sunan an-Nasa'i 1814",
      "arabic_text": "أَخْبَرَنَا أَحْمَدُ بْنُ نَاصِحٍ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ مَكْحُولٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ \n\" مَنْ صَلَّى أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَهُ اللَّهُ عَزَّ وَجَلَّ عَلَى النَّارِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 218,
      "hadithNum_inBook": 1820,
      "title": "Sunan an-Nasa'i 1815",
      "arabic_text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، عَنْ مَرْوَانَ بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ مَكْحُولٍ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، - قَالَ مَرْوَانُ وَكَانَ سَعِيدٌ إِذَا قُرِئَ عَلَيْهِ عَنْ أُمِّ حَبِيبَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَقَرَّ بِذَلِكَ وَلَمْ يُنْكِرْهُ وَإِذَا حَدَّثَنَا بِهِ هُوَ لَمْ يَرْفَعْهُ - قَالَتْ مَنْ رَكَعَ أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَهُ اللَّهُ عَلَى النَّارِ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ مَكْحُولٌ لَمْ يَسْمَعْ مِنْ عَنْبَسَةَ شَيْئًا .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 219,
      "hadithNum_inBook": 1821,
      "title": "Sunan an-Nasa'i 1816",
      "arabic_text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ مُوسَى، يُحَدِّثُ عَنْ مُحَمَّدِ بْنِ أَبِي سُفْيَانَ، قَالَ لَمَّا نَزَلَ بِهِ الْمَوْتُ أَخَذَهُ أَمْرٌ شَدِيدٌ فَقَالَ حَدَّثَتْنِي أُخْتِي أُمُّ حَبِيبَةَ بِنْتُ أَبِي سُفْيَانَ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \n\" مَنْ حَافَظَ عَلَى أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعٍ بَعْدَهَا حَرَّمَهُ اللَّهُ تَعَالَى عَلَى النَّارِ \" .",
      "grade": "Sahih (Darussalam)"
    },
    {
      "hadithNum_inChapter": 220,
      "hadithNum_inBook": 1822,
      "title": "Sunan an-Nasa'i 1817",
      "arabic_text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ، عَنْ أَبِيهِ، عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّ حَبِيبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \n\" مَنْ صَلَّى أَرْبَعًا قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا لَمْ تَمَسَّهُ النَّارُ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ حَدِيثُ مَرْوَانَ مِنْ حَدِيثِ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ .",
      "grade": "Sahih (Darussalam)"
    }
  ]
}